{
  "version": 1,
  "names": [
    {
      "name": "محمد ﷺ",
      "transliteration": "Muhammad ﷺ",
      "name_urdu": "محمد ﷺ",
      "name_hindi": "मुहम्मद ﷺ",
      "title": {
        "en": "Prophet of Allah",
        "ur": "اللہ کے نبی",
        "hi": "अल्लाह के नबी",
        "ar": "نبی اللہ"
      },
      "description": {
        "en": "Prophet Muhammad ﷺ is the head of Ahlul Bayt and the final messenger of Allah. Born in 570 CE in Makkah, he received prophethood at age 40. He is Al-Amin (The Trustworthy), sent as a mercy to all worlds. He brought the Quran and established Islam. He said: \"I am leaving behind two weighty things: the Book of Allah and my Ahlul Bayt. They will never separate until they meet me at the Pool (of Kawthar).\"",
        "ur": "نبی محمد ﷺ اہل بیت کے سربراہ اور اللہ کے آخری رسول ہیں۔ 570 عیسوی میں مکہ میں پیدا ہوئے، 40 سال کی عمر میں نبوت ملی۔ وہ الامین (قابل اعتماد) ہیں، تمام جہانوں کے لیے رحمت بن کر بھیجے گئے۔ انہوں نے قرآن لایا اور اسلام قائم کیا۔ فرمایا: \"میں تمہارے درمیان دو بھاری چیزیں چھوڑ کر جا رہا ہوں: اللہ کی کتاب اور میرے اہل بیت۔ یہ کبھی جدا نہیں ہوں گے جب تک حوض (کوثر) پر مجھ سے نہ ملیں۔\"",
        "hi": "नबी मुहम्मद ﷺ अहले-बैत के सरबराह और अल्लाह के आख़िरी रसूल हैं। 570 ई. में मक्का में पैदा हुए, 40 साल की उम्र में नबुव्वत मिली। वे अल-अमीन (क़ाबिल-ए-एतिमाद) हैं, तमाम जहानों के लिए रहमत बनकर भेजे गए। उन्होंने क़ुरआन लाया और इस्लाम क़ायम किया। फ़रमाया: \"मैं तुम्हारे दरमियान दो भारी चीज़ें छोड़कर जा रहा हूं: अल्लाह की किताब और मेरे अहले-बैत। ये कभी जुदा नहीं होंगे जब तक हौज़ (कौसर) पर मुझसे न मिलें।\"",
        "ar": "النبي محمد ﷺ رأس أهل البيت وخاتم رسل الله. ولد في مكة عام 570م، وتلقى النبوة في سن الأربعين. هو الأمين، أُرسل رحمة للعالمين. جاء بالقرآن وأسس الإسلام. قال: \"إني تارك فيكم ثقلين: كتاب الله وأهل بيتي. لن يفترقا حتى يردا علي الحوض.\""
      },
      "father_name": {
        "en": "Abdullah ibn Abd al-Muttalib",
        "ur": "عبداللہ بن عبدالمطلب",
        "hi": "अब्दुल्लाह बिन अब्दुल मुत्तलिब",
        "ar": "عبدالله بن عبد المطلب"
      },
      "mother_name": {
        "en": "Aminah bint Wahb",
        "ur": "آمنہ بنت وہب",
        "hi": "आमिना बिन्त वहब",
        "ar": "آمنة بنت وهب"
      },
      "birth_date": {
        "en": "12 Rabi al-Awwal, 53 BH (570 CE)",
        "ur": "12 ربیع الاول، 53 قبل ہجرت (570 عیسوی)",
        "hi": "12 रबीउल अव्वल, 53 हिजरत से पहले (570 ई.)",
        "ar": "12 ربيع الأول، 53 قبل الهجرة (570م)"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "12 Rabi al-Awwal, 11 AH (632 CE)",
        "ur": "12 ربیع الاول، 11 ہجری (632 عیسوی)",
        "hi": "12 रबीउल अव्वल, 11 हिजरी (632 ई.)",
        "ar": "12 ربيع الأول، 11 هـ (632م)"
      },
      "death_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Khadijah, Sawda, Aisha, Hafsa, Zaynab, Umm Salamah, and others",
        "ur": "خدیجہ، سودہ، عائشہ، حفصہ، زینب، ام سلمہ اور دیگر",
        "hi": "ख़दीजा, सौदा, आयशा, हफ़सा, ज़ैनब, उम्मे सलमा और दीगर",
        "ar": "خديجة، سودة، عائشة، حفصة، زينب، أم سلمة وغيرهن"
      },
      "children": {
        "en": "Qasim, Abdullah, Ibrahim, Zaynab, Ruqayyah, Umm Kulthum, Fatimah",
        "ur": "قاسم، عبداللہ، ابراہیم، زینب، رقیہ، ام کلثوم، فاطمہ",
        "hi": "क़ासिम, अब्दुल्लाह, इब्राहीम, ज़ैनब, रुक़य्या, उम्मे कुलसूम, फ़ातिमा",
        "ar": "القاسم، عبدالله، إبراهيم، زينب، رقية، أم كلثوم، فاطمة"
      },
      "tribe": {
        "en": "Banu Hashim, Quraysh",
        "ur": "بنو ہاشم، قریش",
        "hi": "बनू हाशिम, क़ुरैश",
        "ar": "بنو هاشم، قريش"
      },
      "known_for": {
        "en": "Final Prophet, Founder of Islam, Received the Quran",
        "ur": "آخری نبی، اسلام کے بانی، قرآن کے حامل",
        "hi": "आख़िरी नबी, इस्लाम के बानी, क़ुरआन के हामिल",
        "ar": "خاتم الأنبياء، مؤسس الإسلام، حامل القرآن"
      }
    },
    {
      "name": "خديجة",
      "transliteration": "Khadijah bint Khuwaylid",
      "name_urdu": "خدیجہ بنت خویلد",
      "name_hindi": "ख़दीजा बिन्त ख़ुवैलिद",
      "title": {
        "en": "Wife of Prophet ﷺ",
        "ur": "نبی ﷺ کی زوجہ",
        "hi": "नबी ﷺ की ज़ौजा",
        "ar": "زوجة النبي ﷺ"
      },
      "description": {
        "en": "Khadijah (RA) was the first wife of Prophet Muhammad ﷺ and the first person to accept Islam. She was a successful businesswoman who proposed marriage to the Prophet. She supported him emotionally and financially during the difficult early years of Islam. She bore all his children except Ibrahim. The Prophet never forgot her love and loyalty. Angel Jibreel conveyed Allah's salam to her and gave her glad tidings of a palace in Paradise. She is one of the four perfect women of all time.",
        "ur": "خدیجہ (رض) نبی محمد ﷺ کی پہلی بیوی اور اسلام قبول کرنے والی پہلی شخصیت تھیں۔ وہ ایک کامیاب تاجر خاتون تھیں جنہوں نے نبی کو شادی کی پیشکش کی۔ انہوں نے اسلام کے مشکل ابتدائی سالوں میں جذباتی اور مالی طور پر ان کی مدد کی۔ ابراہیم کے علاوہ ان کے تمام بچے انہی سے ہوئے۔ نبی ﷺ ان کی محبت اور وفاداری کبھی نہیں بھولے۔ فرشتہ جبرائیل نے انہیں اللہ کا سلام پہنچایا اور جنت میں ایک محل کی خوشخبری دی۔ وہ تاریخ کی چار کامل خواتین میں سے ایک ہیں۔",
        "hi": "ख़दीजा (र.अ.) नबी मुहम्मद ﷺ की पहली बीवी और इस्लाम क़बूल करने वाली पहली शख़्सियत थीं। वे एक कामयाब ताजिर ख़ातून थीं जिन्होंने नबी को शादी की पेशकश की। उन्होंने इस्लाम के मुश्किल इब्तिदाई सालों में जज़्बाती और माली तौर पर उनकी मदद की। इब्राहीम के अलावा उनके तमाम बच्चे उन्हीं से हुए। नबी ﷺ उनकी मुहब्बत और वफ़ादारी कभी नहीं भूले। फ़रिश्ता जिब्राईल ने उन्हें अल्लाह का सलाम पहुंचाया और जन्नत में एक महल की ख़ुशख़बरी दी। वे तारीख़ की चार कामिल ख़वातीन में से एक हैं।",
        "ar": "خديجة (رضي الله عنها) كانت أول زوجات النبي محمد ﷺ وأول من أسلم. كانت سيدة أعمال ناجحة عرضت الزواج على النبي. دعمته عاطفياً ومادياً خلال السنوات الأولى الصعبة للإسلام. أنجبت جميع أولاده ما عدا إبراهيم. لم ينسَ النبي أبداً حبها ووفاءها. نقل جبريل إليها سلام الله وبشّرها بقصر في الجنة. هي إحدى أربع نساء كاملات في التاريخ."
      },
      "father_name": {
        "en": "Khuwaylid ibn Asad",
        "ur": "خویلد بن اسد",
        "hi": "ख़ुवैलिद बिन असद",
        "ar": "خويلد بن أسد"
      },
      "mother_name": {
        "en": "Fatimah bint Za'idah",
        "ur": "فاطمہ بنت زائدہ",
        "hi": "फ़ातिमा बिन्त ज़ाइदा",
        "ar": "فاطمة بنت زائدة"
      },
      "birth_date": {
        "en": "555 CE",
        "ur": "555 عیسوی",
        "hi": "555 ई.",
        "ar": "555م"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "10 Ramadan, 3 BH (619 CE)",
        "ur": "10 رمضان، 3 قبل ہجرت (619 عیسوی)",
        "hi": "10 रमज़ान, 3 हिजरत से पहले (619 ई.)",
        "ar": "10 رمضان، 3 قبل الهجرة (619م)"
      },
      "death_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Prophet Muhammad ﷺ",
        "ur": "نبی محمد ﷺ",
        "hi": "नबी मुहम्मद ﷺ",
        "ar": "النبي محمد ﷺ"
      },
      "children": {
        "en": "Qasim, Abdullah, Zaynab, Ruqayyah, Umm Kulthum, Fatimah",
        "ur": "قاسم، عبداللہ، زینب، رقیہ، ام کلثوم، فاطمہ",
        "hi": "क़ासिम, अब्दुल्लाह, ज़ैनब, रुक़य्या, उम्मे कुलसूम, फ़ातिमा",
        "ar": "القاسم، عبدالله، زينب، رقية، أم كلثوم، فاطمة"
      },
      "tribe": {
        "en": "Quraysh (Banu Asad)",
        "ur": "قریش (بنو اسد)",
        "hi": "क़ुरैश (बनू असद)",
        "ar": "قريش (بنو أسد)"
      },
      "known_for": {
        "en": "First Muslim, First wife of Prophet, Mother of Believers",
        "ur": "پہلی مسلمان، نبی کی پہلی زوجہ، ام المومنین",
        "hi": "पहली मुसलमान, नबी की पहली ज़ौजा, उम्मुल मोमिनीन",
        "ar": "أول مسلمة، أول زوجات النبي، أم المؤمنين"
      }
    },
    {
      "name": "علي",
      "transliteration": "Ali ibn Abi Talib",
      "name_urdu": "علی بن ابی طالب",
      "name_hindi": "अली बिन अबी तालिब",
      "title": {
        "en": "Cousin & Son-in-law",
        "ur": "چچا زاد اور داماد",
        "hi": "चचाज़ाद और दामाद",
        "ar": "ابن عم وصهر"
      },
      "description": {
        "en": "Imam Ali (AS) was the cousin of the Prophet ﷺ, raised in his household, and married to his daughter Fatimah. He was the first male to accept Islam and was born inside the Kaaba. Known as Asadullah (Lion of Allah), he never fled from battle. The Prophet said: \"Ali is from me and I am from Ali.\" He was the father of Hasan and Husayn, and the fourth Caliph. He was known for his justice, wisdom, bravery, and worship.",
        "ur": "امام علی (ع) نبی ﷺ کے چچا زاد تھے، ان کے گھر میں پرورش پائی، اور ان کی بیٹی فاطمہ سے شادی کی۔ وہ اسلام قبول کرنے والے پہلے مرد تھے اور کعبہ کے اندر پیدا ہوئے۔ اسد اللہ (اللہ کا شیر) کے نام سے مشہور، کبھی میدان جنگ سے نہیں بھاگے۔ نبی ﷺ نے فرمایا: \"علی مجھ سے ہے اور میں علی سے ہوں۔\" وہ حسن و حسین کے والد اور چوتھے خلیفہ تھے۔ اپنے انصاف، حکمت، بہادری اور عبادت کے لیے مشہور تھے۔",
        "hi": "इमाम अली (अ.स.) नबी ﷺ के चचाज़ाद थे, उनके घर में परवरिश पाई, और उनकी बेटी फ़ातिमा से शादी की। वे इस्लाम क़बूल करने वाले पहले मर्द थे और काबा के अंदर पैदा हुए। असदुल्लाह (अल्लाह का शेर) के नाम से मशहूर, कभी मैदान-ए-जंग से नहीं भागे। नबी ﷺ ने फ़रमाया: \"अली मुझसे है और मैं अली से हूं।\" वे हसन व हुसैन के वालिद और चौथे ख़लीफ़ा थे। अपने इंसाफ़, हिकमत, बहादुरी और इबादत के लिए मशहूर थे।",
        "ar": "الإمام علي (ع) كان ابن عم النبي ﷺ، نشأ في بيته، وتزوج ابنته فاطمة. كان أول ذكر أسلم ووُلد داخل الكعبة. عُرف بأسد الله، لم يفر من معركة قط. قال النبي ﷺ: \"علي مني وأنا من علي.\" كان أباً للحسن والحسين، والخليفة الرابع. اشتهر بعدله وحكمته وشجاعته وعبادته."
      },
      "father_name": {
        "en": "Abu Talib ibn Abd al-Muttalib",
        "ur": "ابو طالب بن عبدالمطلب",
        "hi": "अबू तालिब बिन अब्दुल मुत्तलिब",
        "ar": "أبو طالب بن عبد المطلب"
      },
      "mother_name": {
        "en": "Fatimah bint Asad",
        "ur": "فاطمہ بنت اسد",
        "hi": "फ़ातिमा बिन्त असद",
        "ar": "فاطمة بنت أسد"
      },
      "birth_date": {
        "en": "13 Rajab, 30 BH (600 CE)",
        "ur": "13 رجب، 30 قبل ہجرت (600 عیسوی)",
        "hi": "13 रजब, 30 हिजरत से पहले (600 ई.)",
        "ar": "13 رجب، 30 قبل الهجرة (600م)"
      },
      "birth_place": {
        "en": "Inside the Kaaba, Makkah",
        "ur": "کعبہ کے اندر، مکہ",
        "hi": "काबा के अंदर, मक्का",
        "ar": "داخل الكعبة، مكة المكرمة"
      },
      "death_date": {
        "en": "21 Ramadan, 40 AH (661 CE)",
        "ur": "21 رمضان، 40 ہجری (661 عیسوی)",
        "hi": "21 रमज़ान, 40 हिजरी (661 ई.)",
        "ar": "21 رمضان، 40 هـ (661م)"
      },
      "death_place": {
        "en": "Kufa, Iraq (Martyred)",
        "ur": "کوفہ، عراق (شہید)",
        "hi": "कूफ़ा, इराक़ (शहीद)",
        "ar": "الكوفة، العراق (استشهد)"
      },
      "spouse": {
        "en": "Fatimah bint Muhammad",
        "ur": "فاطمہ بنت محمد",
        "hi": "फ़ातिमा बिन्त मुहम्मद",
        "ar": "فاطمة بنت محمد"
      },
      "children": {
        "en": "Hasan, Husayn, Zaynab, Umm Kulthum",
        "ur": "حسن، حسین، زینب، ام کلثوم",
        "hi": "हसन, हुसैन, ज़ैनब, उम्मे कुलसूम",
        "ar": "الحسن، الحسين، زينب، أم كلثوم"
      },
      "era": {
        "en": "656-661 CE (Caliphate)",
        "ur": "656-661 عیسوی (خلافت)",
        "hi": "656-661 ई. (ख़िलाफ़त)",
        "ar": "656-661م (الخلافة)"
      },
      "known_for": {
        "en": "First Imam, Fourth Caliph, Lion of Allah, Bab al-Ilm",
        "ur": "پہلے امام، چوتھے خلیفہ، اللہ کا شیر، باب العلم",
        "hi": "पहले इमाम, चौथे ख़लीफ़ा, अल्लाह का शेर, बाबुल इल्म",
        "ar": "الإمام الأول، الخليفة الرابع، أسد الله، باب العلم"
      }
    },
    {
      "name": "فاطمة",
      "transliteration": "Fatimah Az-Zahra",
      "name_urdu": "فاطمہ زہرا",
      "name_hindi": "फ़ातिमा ज़हरा",
      "title": {
        "en": "Daughter of Prophet ﷺ",
        "ur": "نبی ﷺ کی بیٹی",
        "hi": "नबी ﷺ की बेटी",
        "ar": "بنت النبي ﷺ"
      },
      "description": {
        "en": "Fatimah (AS) was the beloved daughter of the Prophet ﷺ from Khadijah. She is called \"part of me\" by the Prophet - whoever angers her angers him. She is the leader of the women of Paradise. She married Ali and was the mother of Hasan, Husayn, Zaynab, and Umm Kulthum. Through her, the Prophet's lineage continues. The verse of purification was revealed about her family. She lived a life of simplicity, worship, and charity.",
        "ur": "فاطمہ (ع) نبی ﷺ کی خدیجہ سے محبوب بیٹی تھیں۔ نبی ﷺ نے انہیں \"میرا ٹکڑا\" کہا - جس نے انہیں ناراض کیا اس نے مجھے ناراض کیا۔ وہ جنت کی خواتین کی سردار ہیں۔ انہوں نے علی سے شادی کی اور حسن، حسین، زینب اور ام کلثوم کی ماں تھیں۔ ان کے ذریعے نبی ﷺ کا سلسلہ نسب جاری ہے۔ آیت تطہیر ان کے خاندان کے بارے میں نازل ہوئی۔ انہوں نے سادگی، عبادت اور خیرات کی زندگی گزاری۔",
        "hi": "फ़ातिमा (अ.स.) नबी ﷺ की ख़दीजा से महबूब बेटी थीं। नबी ﷺ ने उन्हें \"मेरा टुकड़ा\" कहा - जिसने उन्हें नाराज़ किया उसने मुझे नाराज़ किया। वे जन्नत की ख़वातीन की सरदार हैं। उन्होंने अली से शादी की और हसन, हुसैन, ज़ैनब और उम्मे कुलसूम की माँ थीं। उनके ज़रिए नबी ﷺ का सिलसिला-ए-नसब जारी है। आयत-ए-तत्हीर उनके ख़ानदान के बारे में नाज़िल हुई। उन्होंने सादगी, इबादत और ख़ैरात की ज़िंदगी गुज़ारी।",
        "ar": "فاطمة (ع) كانت ابنة النبي ﷺ الحبيبة من خديجة. قال النبي عنها \"بضعة مني\" - من أغضبها فقد أغضبني. هي سيدة نساء أهل الجنة. تزوجت علياً وكانت أماً للحسن والحسين وزينب وأم كلثوم. من خلالها استمر نسل النبي. نزلت آية التطهير في أهل بيتها. عاشت حياة البساطة والعبادة والصدقة."
      },
      "father_name": {
        "en": "Prophet Muhammad ﷺ",
        "ur": "نبی محمد ﷺ",
        "hi": "नबी मुहम्मद ﷺ",
        "ar": "النبي محمد ﷺ"
      },
      "mother_name": {
        "en": "Khadijah bint Khuwaylid",
        "ur": "خدیجہ بنت خویلد",
        "hi": "ख़दीजा बिन्त ख़ुवैलिद",
        "ar": "خديجة بنت خويلد"
      },
      "birth_date": {
        "en": "20 Jumada al-Thani, 5 BH (615 CE)",
        "ur": "20 جمادی الثانی، 5 قبل ہجرت (615 عیسوی)",
        "hi": "20 जुमादल सानी, 5 हिजरत से पहले (615 ई.)",
        "ar": "20 جمادى الآخرة، 5 قبل الهجرة (615م)"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "3 Jumada al-Thani, 11 AH (632 CE)",
        "ur": "3 جمادی الثانی، 11 ہجری (632 عیسوی)",
        "hi": "3 जुमादल सानी, 11 हिजरी (632 ई.)",
        "ar": "3 جمادى الآخرة، 11 هـ (632م)"
      },
      "death_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Ali ibn Abi Talib",
        "ur": "علی بن ابی طالب",
        "hi": "अली बिन अबी तालिब",
        "ar": "علي بن أبي طالب"
      },
      "children": {
        "en": "Hasan, Husayn, Zaynab, Umm Kulthum, Muhsin",
        "ur": "حسن، حسین، زینب، ام کلثوم، محسن",
        "hi": "हसन, हुसैन, ज़ैनब, उम्मे कुलसूम, मोहसिन",
        "ar": "الحسن، الحسين، زينب، أم كلثوم، محسن"
      },
      "full_title": {
        "en": "Az-Zahra (The Radiant), Sayyidatu Nisa al-Alamin",
        "ur": "الزہرا (چمکنے والی)، سیدۃ النساء العالمین",
        "hi": "अज़-ज़हरा (चमकने वाली), सय्यिदतुन निसा अल-आलमीन",
        "ar": "الزهراء، سيدة نساء العالمين"
      },
      "known_for": {
        "en": "Leader of Women of Paradise, Mother of the Imams",
        "ur": "جنت کی خواتین کی سردار، اماموں کی ماں",
        "hi": "जन्नत की ख़वातीन की सरदार, इमामों की माँ",
        "ar": "سيدة نساء أهل الجنة، أم الأئمة"
      }
    },
    {
      "name": "الحسن",
      "transliteration": "Hasan ibn Ali",
      "name_urdu": "حسن بن علی",
      "name_hindi": "हसन बिन अली",
      "title": {
        "en": "Grandson of Prophet ﷺ",
        "ur": "نبی ﷺ کے نواسے",
        "hi": "नबी ﷺ के नवासे",
        "ar": "حفيد النبي ﷺ"
      },
      "description": {
        "en": "Imam Hasan (AS) was the elder grandson of Prophet Muhammad ﷺ, born to Ali and Fatimah. The Prophet loved him dearly and said he and Husayn are \"leaders of the youth of Paradise.\" He resembled the Prophet in appearance. He was known for his generosity, patience, and piety. He made peace with Muawiyah to prevent Muslim bloodshed. He was poisoned and is buried in Jannat al-Baqi, Madinah.",
        "ur": "امام حسن (ع) نبی محمد ﷺ کے بڑے نواسے تھے، علی اور فاطمہ سے پیدا ہوئے۔ نبی ﷺ انہیں بہت پیار کرتے تھے اور فرمایا وہ اور حسین \"جنت کے نوجوانوں کے سردار\" ہیں۔ وہ شکل میں نبی ﷺ سے ملتے تھے۔ اپنی سخاوت، صبر اور تقویٰ کے لیے مشہور تھے۔ انہوں نے مسلمانوں کی خونریزی روکنے کے لیے معاویہ سے صلح کی۔ انہیں زہر دیا گیا اور جنت البقیع مدینہ میں مدفون ہیں۔",
        "hi": "इमाम हसन (अ.स.) नबी मुहम्मद ﷺ के बड़े नवासे थे, अली और फ़ातिमा से पैदा हुए। नबी ﷺ उन्हें बहुत प्यार करते थे और फ़रमाया वे और हुसैन \"जन्नत के नौजवानों के सरदार\" हैं। वे शक्ल में नबी ﷺ से मिलते थे। अपनी सख़ावत, सब्र और तक़वा के लिए मशहूर थे। उन्होंने मुसलमानों की ख़ूंरेज़ी रोकने के लिए मुआविया से सुलह की। उन्हें ज़हर दिया गया और जन्नतुल बक़ी मदीना में मदफ़ून हैं।",
        "ar": "الإمام الحسن (ع) كان الحفيد الأكبر للنبي محمد ﷺ، وُلد لعلي وفاطمة. أحبه النبي ﷺ كثيراً وقال إنه والحسين \"سيدا شباب أهل الجنة.\" كان يشبه النبي في الهيئة. اشتهر بكرمه وصبره وتقواه. صالح معاوية لحقن دماء المسلمين. سُمّ ودُفن في جنة البقيع بالمدينة."
      },
      "father_name": {
        "en": "Ali ibn Abi Talib",
        "ur": "علی بن ابی طالب",
        "hi": "अली बिन अबी तालिब",
        "ar": "علي بن أبي طالب"
      },
      "mother_name": {
        "en": "Fatimah bint Muhammad",
        "ur": "فاطمہ بنت محمد",
        "hi": "फ़ातिमा बिन्त मुहम्मद",
        "ar": "فاطمة بنت محمد"
      },
      "birth_date": {
        "en": "15 Ramadan, 3 AH (625 CE)",
        "ur": "15 رمضان، 3 ہجری (625 عیسوی)",
        "hi": "15 रमज़ान, 3 हिजरी (625 ई.)",
        "ar": "15 رمضان، 3 هـ (625م)"
      },
      "birth_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "death_date": {
        "en": "28 Safar, 50 AH (670 CE)",
        "ur": "28 صفر، 50 ہجری (670 عیسوی)",
        "hi": "28 सफ़र, 50 हिजरी (670 ई.)",
        "ar": "28 صفر، 50 هـ (670م)"
      },
      "death_place": {
        "en": "Madinah (Poisoned)",
        "ur": "مدینہ (زہر دیا گیا)",
        "hi": "मदीना (ज़हर दिया गया)",
        "ar": "المدينة المنورة (سُمّ)"
      },
      "spouse": {
        "en": "Ja'da bint al-Ash'ath, Umm Ishaq",
        "ur": "جعدہ بنت الاشعث، ام اسحاق",
        "hi": "जअदा बिन्त अल-अशअस, उम्मे इसहाक़",
        "ar": "جعدة بنت الأشعث، أم إسحاق"
      },
      "children": {
        "en": "Zayd, Hasan, Qasim, Abdullah",
        "ur": "زید، حسن، قاسم، عبداللہ",
        "hi": "ज़ैद, हसन, क़ासिम, अब्दुल्लाह",
        "ar": "زيد، حسن، قاسم، عبدالله"
      },
      "full_title": {
        "en": "Al-Mujtaba (The Chosen One)",
        "ur": "المجتبیٰ (چنا ہوا)",
        "hi": "अल-मुज्तबा (चुना हुआ)",
        "ar": "المجتبى"
      },
      "known_for": {
        "en": "Second Imam, Leader of Youth of Paradise, Peace Maker",
        "ur": "دوسرے امام، جنت کے نوجوانوں کے سردار، صلح کرنے والے",
        "hi": "दूसरे इमाम, जन्नत के नौजवानों के सरदार, सुलह करने वाले",
        "ar": "الإمام الثاني، سيد شباب أهل الجنة، صانع السلام"
      }
    },
    {
      "name": "الحسين",
      "transliteration": "Husayn ibn Ali",
      "name_urdu": "حسین بن علی",
      "name_hindi": "हुसैन बिन अली",
      "title": {
        "en": "Grandson of Prophet ﷺ",
        "ur": "نبی ﷺ کے نواسے",
        "hi": "नबी ﷺ के नवासे",
        "ar": "حفيد النبي ﷺ"
      },
      "description": {
        "en": "Imam Husayn (AS) was the younger grandson of the Prophet ﷺ. The Prophet said \"Husayn is from me and I am from Husayn.\" He stood against tyranny at Karbala in 680 CE, where he and 72 companions were martyred. His sacrifice symbolizes the eternal struggle of truth against falsehood. His sister Zaynab preserved his message. Millions visit his shrine in Karbala annually. Muharram commemorates his martyrdom.",
        "ur": "امام حسین (ع) نبی ﷺ کے چھوٹے نواسے تھے۔ نبی ﷺ نے فرمایا \"حسین مجھ سے ہے اور میں حسین سے ہوں۔\" انہوں نے 680 عیسوی میں کربلا میں ظلم کے خلاف کھڑے ہوکر 72 ساتھیوں سمیت شہادت پائی۔ ان کی قربانی حق کی باطل کے خلاف ابدی جدوجہد کی علامت ہے۔ ان کی بہن زینب نے ان کا پیغام محفوظ کیا۔ کربلا میں ان کے مزار کی سالانہ لاکھوں زیارت کرتے ہیں۔ محرم ان کی شہادت کی یاد ہے۔",
        "hi": "इमाम हुसैन (अ.स.) नबी ﷺ के छोटे नवासे थे। नबी ﷺ ने फ़रमाया \"हुसैन मुझसे है और मैं हुसैन से हूं।\" उन्होंने 680 ई. में कर्बला में ज़ुल्म के ख़िलाफ़ खड़े होकर 72 साथियों समेत शहादत पाई। उनकी क़ुर्बानी हक़ की बातिल के ख़िलाफ़ अबदी जद्दोजहद की निशानी है। उनकी बहन ज़ैनब ने उनका पैग़ाम महफ़ूज़ किया। कर्बला में उनके मज़ार की सालाना लाखों ज़ियारत करते हैं। मुहर्रम उनकी शहादत की याद है।",
        "ar": "الإمام الحسين (ع) كان الحفيد الأصغر للنبي ﷺ. قال النبي: \"حسين مني وأنا من حسين.\" وقف ضد الظلم في كربلاء عام 680م، حيث استشهد هو و72 من أصحابه. تمثل تضحيته الصراع الأبدي بين الحق والباطل. حفظت أخته زينب رسالته. يزور ملايين ضريحه في كربلاء سنوياً. يحيي محرم ذكرى استشهاده."
      },
      "father_name": {
        "en": "Ali ibn Abi Talib",
        "ur": "علی بن ابی طالب",
        "hi": "अली बिन अबी तालिब",
        "ar": "علي بن أبي طالب"
      },
      "mother_name": {
        "en": "Fatimah bint Muhammad",
        "ur": "فاطمہ بنت محمد",
        "hi": "फ़ातिमा बिन्त मुहम्मद",
        "ar": "فاطمة بنت محمد"
      },
      "birth_date": {
        "en": "3 Sha'ban, 4 AH (626 CE)",
        "ur": "3 شعبان، 4 ہجری (626 عیسوی)",
        "hi": "3 शाबान, 4 हिजरी (626 ई.)",
        "ar": "3 شعبان، 4 هـ (626م)"
      },
      "birth_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "death_date": {
        "en": "10 Muharram, 61 AH (680 CE)",
        "ur": "10 محرم، 61 ہجری (680 عیسوی)",
        "hi": "10 मुहर्रम, 61 हिजरी (680 ई.)",
        "ar": "10 محرم، 61 هـ (680م)"
      },
      "death_place": {
        "en": "Karbala, Iraq (Martyred)",
        "ur": "کربلا، عراق (شہید)",
        "hi": "कर्बला, इराक़ (शहीद)",
        "ar": "كربلاء، العراق (استشهد)"
      },
      "spouse": {
        "en": "Shahrbanu, Rabab, Layla",
        "ur": "شہربانو، رباب، لیلیٰ",
        "hi": "शहरबानू, रबाब, लैला",
        "ar": "شهربانو، رباب، ليلى"
      },
      "children": {
        "en": "Ali Zayn al-Abidin, Ali Akbar, Ali Asghar, Sakina, Fatimah",
        "ur": "علی زین العابدین، علی اکبر، علی اصغر، سکینہ، فاطمہ",
        "hi": "अली ज़ैनुल आबिदीन, अली अकबर, अली असग़र, सकीना, फ़ातिमा",
        "ar": "علي زين العابدين، علي الأكبر، علي الأصغر، سكينة، فاطمة"
      },
      "full_title": {
        "en": "Sayyid al-Shuhada (Master of Martyrs)",
        "ur": "سید الشہداء (شہیدوں کے سردار)",
        "hi": "सय्यिदुश शुहदा (शहीदों के सरदार)",
        "ar": "سيد الشهداء"
      },
      "known_for": {
        "en": "Third Imam, Hero of Karbala, Symbol of Sacrifice",
        "ur": "تیسرے امام، کربلا کے ہیرو، قربانی کی علامت",
        "hi": "तीसरे इमाम, कर्बला के हीरो, क़ुर्बानी की निशानी",
        "ar": "الإمام الثالث، بطل كربلاء، رمز التضحية"
      }
    },
    {
      "name": "زينب",
      "transliteration": "Zaynab bint Ali",
      "name_urdu": "زینب بنت علی",
      "name_hindi": "ज़ैनब बिन्त अली",
      "title": {
        "en": "Granddaughter of Prophet ﷺ",
        "ur": "نبی ﷺ کی نواسی",
        "hi": "नबी ﷺ की नवासी",
        "ar": "حفيدة النبي ﷺ"
      },
      "description": {
        "en": "Sayyidah Zaynab (AS) was the daughter of Ali and Fatimah, and granddaughter of the Prophet ﷺ. She was present at Karbala and witnessed the martyrdom of her brother Husayn and many family members. After Karbala, she delivered powerful sermons in the courts of Ibn Ziyad and Yazid, preserving the message of Husayn's sacrifice. She is known as the \"Heroine of Karbala\" for her courage and eloquence. Her shrine in Damascus is a major pilgrimage site.",
        "ur": "سیدہ زینب (ع) علی اور فاطمہ کی بیٹی اور نبی ﷺ کی نواسی تھیں۔ وہ کربلا میں موجود تھیں اور اپنے بھائی حسین اور بہت سے خاندان کے افراد کی شہادت دیکھی۔ کربلا کے بعد انہوں نے ابن زیاد اور یزید کے درباروں میں طاقتور خطبات دیے، حسین کی قربانی کا پیغام محفوظ کیا۔ انہیں اپنی ہمت اور فصاحت کے لیے \"کربلا کی ہیروئن\" کہا جاتا ہے۔ دمشق میں ان کا مزار ایک اہم زیارت گاہ ہے۔",
        "hi": "सय्यिदा ज़ैनब (अ.स.) अली और फ़ातिमा की बेटी और नबी ﷺ की नवासी थीं। वे कर्बला में मौजूद थीं और अपने भाई हुसैन और बहुत से ख़ानदान के अफ़राद की शहादत देखी। कर्बला के बाद उन्होंने इब्न ज़ियाद और यज़ीद के दरबारों में ताक़तवर ख़ुत्बात दिए, हुसैन की क़ुर्बानी का पैग़ाम महफ़ूज़ किया। उन्हें अपनी हिम्मत और फ़साहत के लिए \"कर्बला की हीरोइन\" कहा जाता है। दमिश्क़ में उनका मज़ार एक अहम ज़ियारतगाह है।",
        "ar": "السيدة زينب (ع) كانت بنت علي وفاطمة وحفيدة النبي ﷺ. حضرت كربلاء وشهدت استشهاد أخيها الحسين وكثير من أفراد عائلتها. بعد كربلاء ألقت خطباً قوية في مجالس ابن زياد ويزيد، حفظت رسالة تضحية الحسين. تُعرف بـ\"بطلة كربلاء\" لشجاعتها وفصاحتها. ضريحها في دمشق مزار حج رئيسي."
      },
      "father_name": {
        "en": "Ali ibn Abi Talib",
        "ur": "علی بن ابی طالب",
        "hi": "अली बिन अबी तालिब",
        "ar": "علي ب�� أبي طالب"
      },
      "mother_name": {
        "en": "Fatimah bint Muhammad",
        "ur": "فاطمہ بنت محمد",
        "hi": "फ़ातिमा बिन्त मुहम्मद",
        "ar": "فاطمة بنت محمد"
      },
      "birth_date": {
        "en": "5 Jumada al-Awwal, 6 AH (627 CE)",
        "ur": "5 جمادی الاول، 6 ہجری (627 عیسوی)",
        "hi": "5 जुमादल अव्वल, 6 हिजरी (627 ई.)",
        "ar": "5 جمادى الأولى، 6 هـ (627م)"
      },
      "birth_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "death_date": {
        "en": "15 Rajab, 62 AH (682 CE)",
        "ur": "15 رجب، 62 ہجری (682 عیسوی)",
        "hi": "15 रजब, 62 हिजरी (682 ई.)",
        "ar": "15 رجب، 62 هـ (682م)"
      },
      "death_place": {
        "en": "Damascus, Syria",
        "ur": "دمشق، شام",
        "hi": "दमिश्क़, सीरिया",
        "ar": "دمشق، سوريا"
      },
      "spouse": {
        "en": "Abdullah ibn Ja'far",
        "ur": "عبداللہ بن جعفر",
        "hi": "अब्दुल्लाह बिन जअफ़र",
        "ar": "عبدالله بن جعفر"
      },
      "children": {
        "en": "Ali, Aun, Muhammad, Umm Kulthum",
        "ur": "علی، عون، محمد، ام کلثوم",
        "hi": "अली, औन, मुहम्मद, उम्मे कुलसूम",
        "ar": "علي، عون، محمد، أم كلثوم"
      },
      "full_title": {
        "en": "Aqilat Bani Hashim (Wise Woman of Banu Hashim)",
        "ur": "عقیلۃ بنی ہاشم (بنی ہاشم کی دانا خاتون)",
        "hi": "अक़ीलत बनी हाशिम (बनू हाशिम की दाना ख़ातून)",
        "ar": "عقيلة بني هاشم"
      },
      "known_for": {
        "en": "Heroine of Karbala, Preserved Husayn's message, Eloquent speaker",
        "ur": "کربلا کی ہیروئن، حسین کا پیغام محفوظ کیا، فصیح مقررہ",
        "hi": "कर्बला की हीरोइन, हुसैन का पैग़ाम महफ़ूज़ किया, फ़सीह मुक़र्रिरा",
        "ar": "بطلة كربلاء، حافظة رسالة الحسين، خطيبة فصيحة"
      }
    },
    {
      "name": "أم كلثوم",
      "transliteration": "Umm Kulthum bint Ali",
      "name_urdu": "ام کلثوم بنت علی",
      "name_hindi": "उम्मे कुलसूम बिन्त अली",
      "title": {
        "en": "Granddaughter of Prophet ﷺ",
        "ur": "نبی ﷺ کی نواسی",
        "hi": "नबी ﷺ की नवासी",
        "ar": "حفيدة النبي ﷺ"
      },
      "description": {
        "en": "Umm Kulthum (AS) was the daughter of Ali and Fatimah, and granddaughter of the Prophet ﷺ. She accompanied her sister Zaynab and the surviving family members after the tragedy of Karbala. She supported her sister in preserving the message of Husayn's sacrifice. She was known for her piety and patience during the difficult times the Ahlul Bayt faced.",
        "ur": "ام کلثوم (ع) علی اور فاطمہ کی بیٹی اور نبی ﷺ کی نواسی تھیں۔ انہوں نے کربلا کے سانحے کے بعد اپنی بہن زینب اور بچ جانے والے خاندان کے افراد کا ساتھ دیا۔ انہوں نے حسین کی قربانی کا پیغام محفوظ کرنے میں اپنی بہن کی مدد کی۔ وہ اہل بیت کے مشکل وقت میں اپنی تقویٰ اور صبر کے لیے مشہور تھیں۔",
        "hi": "उम्मे कुलसूम (अ.स.) अली और फ़ातिमा की बेटी और नबी ﷺ की नवासी थीं। उन्होंने कर्बला के सानिहे के बाद अपनी बहन ज़ैनब और बच जाने वाले ख़ानदान के अफ़राद का साथ दिया। उन्होंने हुसैन की क़ुर्बानी का पैग़ाम महफ़ूज़ करने में अपनी बहन की मदद की। वे अहले-बैत के मुश्किल वक़्त में अपने तक़वा और सब्र के लिए मशहूर थीं।",
        "ar": "أم كلثوم (ع) كانت بنت علي وفاطمة وحفيدة النبي ﷺ. رافقت أختها زينب والناجين من أفراد العائلة بعد مأساة كربلاء. دعمت أختها في حفظ رسالة تضحية الحسين. اشتهرت بتقواها وصبرها خلال الأوقات الصعبة التي واجهها أهل البيت."
      },
      "father_name": {
        "en": "Ali ibn Abi Talib",
        "ur": "علی بن ابی طالب",
        "hi": "अली बिन अबी तालिब",
        "ar": "علي بن أبي طالب"
      },
      "mother_name": {
        "en": "Fatimah bint Muhammad",
        "ur": "فاطمہ بنت محمد",
        "hi": "फ़ातिमा बिन्त मुहम्मद",
        "ar": "فاطمة بنت محمد"
      },
      "birth_date": {
        "en": "6 AH (628 CE)",
        "ur": "6 ہجری (628 عیسوی)",
        "hi": "6 हिजरी (628 ई.)",
        "ar": "6 هـ (628م)"
      },
      "birth_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "death_date": {
        "en": "After Karbala (exact date unknown)",
        "ur": "کربلا کے بعد (صحیح تاریخ نامعلوم)",
        "hi": "कर्बला के बाद (सही तारीख़ नामालूम)",
        "ar": "بعد كربلاء (التاريخ الدقيق غير معروف)"
      },
      "death_place": {
        "en": "Unknown",
        "ur": "نامعلوم",
        "hi": "नामालूम",
        "ar": "غير معروف"
      },
      "spouse": {
        "en": "Umar ibn al-Khattab (disputed), Awn ibn Ja'far",
        "ur": "عمر بن الخطاب (متنازع)، عون بن جعفر",
        "hi": "उमर बिन अल-ख़त्ताब (विवादित), औन बिन जअफ़र",
        "ar": "عمر بن الخطاب (مختلف فيه)، عون بن جعفر"
      },
      "children": {
        "en": "Zayd, Ruqayyah",
        "ur": "زید، رقیہ",
        "hi": "ज़ैद, रुक़य्या",
        "ar": "زيد، رقية"
      },
      "full_title": {
        "en": "Granddaughter of the Prophet",
        "ur": "نبی ﷺ کی نواسی",
        "hi": "नबी ﷺ की नवासी",
        "ar": "حفيدة النبي"
      },
      "known_for": {
        "en": "Supported Zaynab after Karbala, Piety and patience",
        "ur": "کربلا کے بعد زینب کی مدد، تقویٰ اور صبر",
        "hi": "कर्बला के बाद ज़ैनब की मदद, तक़वा और सब्र",
        "ar": "دعمت زينب بعد كربلاء، التقوى والصبر"
      }
    },
    {
      "name": "عائشة",
      "transliteration": "Aisha bint Abi Bakr",
      "name_urdu": "عائشہ بنت ابی بکر",
      "name_hindi": "आयशा बिन्त अबी बक्र",
      "title": {
        "en": "Wife of Prophet ﷺ",
        "ur": "نبی ﷺ کی زوجہ",
        "hi": "नबी ﷺ की ज़ौजा",
        "ar": "زوجة النبي ﷺ"
      },
      "description": {
        "en": "Aisha (RA) was the daughter of Abu Bakr and wife of the Prophet ﷺ. She was one of the most learned women of her time, and many companions sought her knowledge of hadith, fiqh, and the Prophet's personal life. She narrated over 2,200 hadiths. The Prophet loved her dearly and passed away in her room with his head in her lap. She continued teaching Islam for decades after his death, and many great scholars learned from her.",
        "ur": "عائشہ (رض) ابوبکر کی بیٹی اور نبی ﷺ کی زوجہ تھیں۔ وہ اپنے وقت کی سب سے عالم خواتین میں سے تھیں، بہت سے صحابہ حدیث، فقہ اور نبی ﷺ کی ذاتی زندگی کے بارے میں ان سے علم حاصل کرتے۔ انہوں نے 2200 سے زیادہ احادیث روایت کیں۔ نبی ﷺ انہیں بہت پیار کرتے تھے اور ان کے کمرے میں سر ان کی گود میں رکھ کر وفات پائی۔ انہوں نے ان کی وفات کے بعد دہائیوں تک اسلام کی تعلیم جاری رکھی۔",
        "hi": "आयशा (र.अ.) अबू बक्र की बेटी और नबी ﷺ की ज़ौजा थीं। वे अपने वक़्त की सबसे आलिम ख़वातीन में से थीं, बहुत से सहाबा हदीस, फ़िक़्ह और नबी ﷺ की ज़ाती ज़िंदगी के बारे में उनसे इल्म हासिल करते। उन्होंने 2200 से ज़्यादा अहादीस रिवायत कीं। नबी ﷺ उन्हें बहुत प्यार करते थे और उनके कमरे में सर उनकी गोद में रखकर वफ़ात पाई। उन्होंने उनकी वफ़ात के बाद दहाइयों तक इस्लाम की तालीम जारी रखी।",
        "ar": "عائشة (رضي الله عنها) كانت بنت أبي بكر وزوجة النبي ﷺ. كانت من أعلم نساء عصرها، وكثير من الصحابة طلبوا علمها في الحديث والفقه وحياة النبي الشخصية. روت أكثر من 2200 حديث. أحبها النبي كثيراً وتوفي في حجرتها ورأسه في حجرها. واصلت تعليم الإسلام لعقود بعد وفاته، وتعلم منها كثير من كبار العلماء."
      },
      "father_name": {
        "en": "Abu Bakr al-Siddiq",
        "ur": "ابوبکر صدیق",
        "hi": "अबू बक्र सिद्दीक़",
        "ar": "أبو بكر الصديق"
      },
      "mother_name": {
        "en": "Umm Ruman",
        "ur": "ام رومان",
        "hi": "उम्मे रूमान",
        "ar": "أم رومان"
      },
      "birth_date": {
        "en": "613 or 614 CE",
        "ur": "613 یا 614 عیسوی",
        "hi": "613 या 614 ई.",
        "ar": "613 أو 614م"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "17 Ramadan, 58 AH (678 CE)",
        "ur": "17 رمضان، 58 ہجری (678 عیسوی)",
        "hi": "17 रमज़ान, 58 हिजरी (678 ई.)",
        "ar": "17 رمضان، 58 هـ (678م)"
      },
      "death_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Prophet Muhammad ﷺ",
        "ur": "نبی محمد ﷺ",
        "hi": "नबी मुहम्मद ﷺ",
        "ar": "النبي محمد ﷺ"
      },
      "full_title": {
        "en": "Umm al-Mu'minin (Mother of the Believers)",
        "ur": "ام المومنین (مومنوں کی ماں)",
        "hi": "उम्मुल मोमिनीन (मोमिनों की माँ)",
        "ar": "أم المؤمنين"
      },
      "known_for": {
        "en": "Greatest female scholar, Narrated 2200+ hadiths, Teacher",
        "ur": "سب سے بڑی عالمہ، 2200 سے زیادہ احادیث کی راویہ، معلمہ",
        "hi": "सबसे बड़ी आलिमा, 2200 से ज़्यादा अहादीस की राविया, मुअल्लिमा",
        "ar": "أعظم عالمة، روت أكثر من 2200 حديث، معلمة"
      }
    },
    {
      "name": "حفصة",
      "transliteration": "Hafsa bint Umar",
      "name_urdu": "حفصہ بنت عمر",
      "name_hindi": "हफ़सा बिन्त उमर",
      "title": {
        "en": "Wife of Prophet ﷺ",
        "ur": "نبی ﷺ کی زوجہ",
        "hi": "नबी ﷺ की ज़ौजा",
        "ar": "زوجة النبي ﷺ"
      },
      "description": {
        "en": "Hafsa (RA) was the daughter of Umar ibn Al-Khattab and wife of the Prophet ﷺ. She was known for her piety, knowledge, and strong character. After the Prophet's death, the original manuscript of the Quran compiled by Abu Bakr was entrusted to her for safekeeping. This manuscript was later used by Uthman when standardizing the Quran. She was devoted to fasting and prayer.",
        "ur": "حفصہ (رض) عمر بن الخطاب کی بیٹی اور نبی ﷺ کی زوجہ تھیں۔ وہ اپنی تقویٰ، علم اور مضبوط کردار کے لیے مشہور تھیں۔ نبی ﷺ کی وفات کے بعد ابوبکر کا مرتب کردہ قرآن کا اصل مسودہ حفاظت کے لیے انہیں سونپا گیا۔ یہ مسودہ بعد میں عثمان نے قرآن کی معیاری کاری کے وقت استعمال کیا۔ وہ روزے اور نماز کی پابند تھیں۔",
        "hi": "हफ़सा (र.अ.) उमर बिन अल-ख़त्ताब की बेटी और नबी ﷺ की ज़ौजा थीं। वे अपने तक़वा, इल्म और मज़बूत किरदार के लिए मशहूर थीं। नबी ﷺ की वफ़ात के बाद अबू बक्र का मुरत्तब करदा क़ुरआन का असल मुसव्वदा हिफ़ाज़त के लिए उन्हें सौंपा गया। यह मुसव्वदा बाद में उस्मान ने क़ुरआन की मेयारीकारी के वक़्त इस्तेमाल किया। वे रोज़े और नमाज़ की पाबंद थीं।",
        "ar": "حفصة (رضي الله عنها) كانت بنت عمر بن الخطاب وزوجة النبي ﷺ. اشتهرت بتقواها وعلمها وقوة شخصيتها. بعد وفاة النبي، أُودعت عندها المصحف الأصلي الذي جمعه أبو بكر للحفظ. استخدم عثمان هذا المصحف لاحقاً عند توحيد القرآن. كانت ملتزمة بالصيام والصلاة."
      },
      "father_name": {
        "en": "Umar ibn al-Khattab",
        "ur": "عمر بن الخطاب",
        "hi": "उमर बिन अल-ख़त्ताब",
        "ar": "عمر بن الخطاب"
      },
      "mother_name": {
        "en": "Zaynab bint Maz'un",
        "ur": "زینب بنت مظعون",
        "hi": "ज़ैनब बिन्त मज़ऊन",
        "ar": "زينب بنت مظعون"
      },
      "birth_date": {
        "en": "605 CE",
        "ur": "605 عیسوی",
        "hi": "605 ई.",
        "ar": "605م"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "45 AH (665 CE)",
        "ur": "45 ہجری (665 عیسوی)",
        "hi": "45 हिजरी (665 ई.)",
        "ar": "45 هـ (665م)"
      },
      "death_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Prophet Muhammad ﷺ (previously Khunays ibn Hudhafa)",
        "ur": "نبی محمد ﷺ (اس سے پہلے خنیس بن حذافہ)",
        "hi": "नबी मुहम्मद ﷺ (इससे पहले ख़ुनैस बिन हुज़ैफ़ा)",
        "ar": "النبي محمد ﷺ (سابقاً خنيس بن حذافة)"
      },
      "full_title": {
        "en": "Umm al-Mu'minin (Mother of the Believers)",
        "ur": "ام المومنین (مومنوں کی ماں)",
        "hi": "उम्मुल मोमिनीन (मोमिनों की माँ)",
        "ar": "أم المؤمنين"
      },
      "known_for": {
        "en": "Guardian of the first Quran manuscript, Piety and fasting",
        "ur": "پہلے قرآنی مسودے کی محافظ، تقویٰ اور روزے",
        "hi": "पहले क़ुरआनी मुसव्वदे की मुहाफ़िज़, तक़वा और रोज़े",
        "ar": "حارسة المصحف الأول، التقوى والصيام"
      }
    },
    {
      "name": "زينب بنت جحش",
      "transliteration": "Zaynab bint Jahsh",
      "name_urdu": "زینب بنت جحش",
      "name_hindi": "ज़ैनब बिन्त जहश",
      "title": {
        "en": "Wife of Prophet ﷺ",
        "ur": "نبی ﷺ کی زوجہ",
        "hi": "नबी ﷺ की ज़ौजा",
        "ar": "زوجة النبي ﷺ"
      },
      "description": {
        "en": "Zaynab (RA) was the cousin of the Prophet ﷺ and became his wife after a divine command. She was known for her generosity, charitable works, and skill in leather work and crafts, the proceeds of which she gave to the poor. She was called \"the Mother of the Poor.\" The Prophet said she would be the first of his wives to join him after death, and she passed away during Umar's caliphate.",
        "ur": "زینب (رض) نبی ﷺ کی چچا زاد تھیں اور الہٰی حکم کے بعد ان کی زوجہ بنیں۔ وہ اپنی سخاوت، خیراتی کاموں اور چمڑے کے کام اور دستکاری میں مہارت کے لیے مشہور تھیں، جن کی آمدنی غریبوں کو دیتیں۔ انہیں \"غریبوں کی ماں\" کہا جاتا تھا۔ نبی ﷺ نے فرمایا وہ ان کی بیویوں میں سب سے پہلے ان سے ملیں گی، اور انہوں نے عمر کی خلافت میں وفات پائی۔",
        "hi": "ज़ैनब (र.अ.) नबी ﷺ की चचाज़ाद थीं और इलाही हुक्म के बाद उनकी ज़ौजा बनीं। वे अपनी सख़ावत, ख़ैराती कामों और चमड़े के काम और दस्तकारी में महारत के लिए मशहूर थीं, जिनकी आमदनी ग़रीबों को देतीं। उन्हें \"ग़रीबों की माँ\" कहा जाता था। नबी ﷺ ने फ़रमाया वे उनकी बीवियों में सबसे पहले उनसे मिलेंगी, और उन्होंने उमर की ख़िलाफ़त में वफ़ात पाई।",
        "ar": "زينب (رضي الله عنها) كانت بنت عمة النبي ﷺ وأصبحت زوجته بأمر إلهي. اشتهرت بكرمها وأعمالها الخيرية ومهارتها في الحرف اليدوية وصناعة الجلود، وكانت تتصدق بعوائدها على الفقراء. لُقبت بـ\"أم المساكين.\" قال النبي إنها أول أزواجه لحاقاً به، وتوفيت في خلافة عمر."
      },
      "father_name": {
        "en": "Jahsh ibn Ri'ab",
        "ur": "جحش بن رئاب",
        "hi": "जहश बिन रिआब",
        "ar": "جحش بن رئاب"
      },
      "mother_name": {
        "en": "Umaymah bint Abd al-Muttalib (Prophet's aunt)",
        "ur": "امیمہ بنت عبدالمطلب (نبی ﷺ کی پھوپھی)",
        "hi": "उमैमा बिन्त अब्दुल मुत्तलिब (नबी ﷺ की फूफी)",
        "ar": "أميمة بنت عبد المطلب (عمة النبي)"
      },
      "birth_date": {
        "en": "590 CE",
        "ur": "590 عیسوی",
        "hi": "590 ई.",
        "ar": "590م"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "20 AH (641 CE)",
        "ur": "20 ہجری (641 عیسوی)",
        "hi": "20 हिजरी (641 ई.)",
        "ar": "20 هـ (641م)"
      },
      "death_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Prophet Muhammad ﷺ (previously Zayd ibn Haritha)",
        "ur": "نبی محمد ﷺ (اس سے پہلے زید بن حارثہ)",
        "hi": "नबी मुहम्मद ﷺ (इससे पहले ज़ैद बिन हारिसा)",
        "ar": "النبي محمد ﷺ (سابقاً زيد بن حارثة)"
      },
      "full_title": {
        "en": "Umm al-Mu'minin (Mother of the Believers)",
        "ur": "ام المومنین (مومنوں کی ماں)",
        "hi": "उम्मुल मोमिनीन (मोमिनों की माँ)",
        "ar": "أم المؤمنين"
      },
      "known_for": {
        "en": "Mother of the Poor, Generous charity, First to die after Prophet",
        "ur": "غریبوں کی ماں، فیاض خیرات، نبی ﷺ کے بعد سب سے پہلے وفات",
        "hi": "ग़रीबों की माँ, फ़य्याज़ ख़ैरात, नबी ﷺ के बाद सबसे पहले वफ़ात",
        "ar": "أم المساكين، كريمة الصدقات، أول أزواج النبي وفاة بعده"
      }
    },
    {
      "name": "أم سلمة",
      "transliteration": "Umm Salamah",
      "name_urdu": "ام سلمہ",
      "name_hindi": "उम्मे सलमा",
      "title": {
        "en": "Wife of Prophet ﷺ",
        "ur": "نبی ﷺ کی زوجہ",
        "hi": "नबी ﷺ की ज़ौजा",
        "ar": "زوجة النبي ﷺ"
      },
      "description": {
        "en": "Umm Salamah (RA) was known for her wisdom and intelligence. She gave the Prophet ﷺ crucial advice during the Treaty of Hudaybiyyah. She was among the early emigrants to Abyssinia and later to Madinah. She narrated many hadiths and was consulted by companions on religious matters. She was present at many important events in Islamic history and lived until the caliphate of Yazid, witnessing the tragedy of Karbala.",
        "ur": "ام سلمہ (رض) اپنی حکمت اور ذہانت کے لیے مشہور تھیں۔ انہوں نے صلح حدیبیہ کے موقع پر نبی ﷺ کو اہم مشورہ دیا۔ وہ حبشہ اور بعد میں مدینہ ہجرت کرنے والوں میں شامل تھیں۔ انہوں نے بہت سی احادیث روایت کیں اور صحابہ دینی معاملات میں ان سے مشورہ کرتے۔ وہ اسلامی تاریخ کے بہت سے اہم واقعات میں موجود تھیں اور یزید کی خلافت تک زندہ رہیں، کربلا کا سانحہ دیکھا۔",
        "hi": "उम्मे सलमा (र.अ.) अपनी हिकमत और ज़हानत के लिए मशहूर थीं। उन्होंने सुलह-ए-हुदैबिया के मौक़े पर नबी ﷺ को अहम मश्वरा दिया। वे हबशा और बाद में मदीना हिजरत करने वालों में शामिल थीं। उन्होंने बहुत सी अहादीस रिवायत कीं और सहाबा दीनी मामलात में उनसे मश्वरा करते। वे इस्लामी तारीख़ के बहुत से अहम वाक़ेआत में मौजूद थीं और यज़ीद की ख़िलाफ़त तक ज़िंदा रहीं, कर्बला का सानिहा देखा।",
        "ar": "أم سلمة (رضي الله عنها) اشتهرت بحكمتها وذكائها. قدمت للنبي ﷺ نصيحة حاسمة أثناء صلح الحديبية. كانت من المهاجرات الأوائل إلى الحبشة ثم إلى المدينة. روت كثيراً من الأحاديث واستشارها الصحابة في المسائل الدينية. حضرت كثيراً من الأحداث المهمة في التاريخ الإسلامي وعاشت حتى خلافة يزيد، وشهدت مأساة كربلاء."
      },
      "father_name": {
        "en": "Abu Umayya ibn al-Mughira",
        "ur": "ابو امیہ بن المغیرہ",
        "hi": "अबू उमय्या बिन अल-मुग़ीरा",
        "ar": "أبو أمية بن المغيرة"
      },
      "mother_name": {
        "en": "Atikah bint Amir",
        "ur": "عاتکہ بنت عامر",
        "hi": "आतिका बिन्त आमिर",
        "ar": "عاتكة بنت عامر"
      },
      "birth_date": {
        "en": "596 CE",
        "ur": "596 عیسوی",
        "hi": "596 ई.",
        "ar": "596م"
      },
      "birth_place": {
        "en": "Makkah, Arabia",
        "ur": "مکہ، عرب",
        "hi": "मक्का, अरब",
        "ar": "مكة المكرمة، الجزيرة العربية"
      },
      "death_date": {
        "en": "61 AH (680 CE)",
        "ur": "61 ہجری (680 عیسوی)",
        "hi": "61 हिजरी (680 ई.)",
        "ar": "61 هـ (680م)"
      },
      "death_place": {
        "en": "Madinah, Arabia",
        "ur": "مدینہ، عرب",
        "hi": "मदीना, अरब",
        "ar": "المدينة المنورة، الجزيرة العربية"
      },
      "spouse": {
        "en": "Prophet Muhammad ﷺ (previously Abu Salamah)",
        "ur": "نبی محمد ﷺ (اس سے پہلے ابو سلمہ)",
        "hi": "नबी मुहम्मद ﷺ (इससे पहले अबू सलमा)",
        "ar": "النبي محمد ﷺ (سابقاً أبو سلمة)"
      },
      "children": {
        "en": "Salamah, Umar, Zaynab, Durrah",
        "ur": "سلمہ، عمر، زینب، درہ",
        "hi": "सलमा, उमर, ज़ैनब, दुर्रा",
        "ar": "سلمة، عمر، زينب، درة"
      },
      "full_title": {
        "en": "Umm al-Mu'minin (Mother of the Believers)",
        "ur": "ام المومنین (مومنوں کی ماں)",
        "hi": "उम्मुल मोमिनीन (मोमिनों की माँ)",
        "ar": "أم المؤمنين"
      },
      "known_for": {
        "en": "Wisdom, Advice at Hudaybiyyah, Longest living wife",
        "ur": "حکمت، حدیبیہ میں مشورہ، سب سے لمبی عمر والی زوجہ",
        "hi": "हिकमत, हुदैबिया में मश्वरा, सबसे लंबी उम्र वाली ज़ौजा",
        "ar": "الحكمة، النصيحة في الحديبية، أطول أزواج النبي عمراً"
      }
    }
  ]
}
