{
  "title": {
    "en": "Jahannam (Hell)",
    "ur": "جہنم",
    "hi": "जहन्नम",
    "ar": "جهنم"
  },
  "icon": "local_fire_department",
  "steps": [
    {
      "step": 1,
      "title_key": "jahannam_fazilat_1_description_of_jahannam",
      "title": {
        "en": "Description of Jahannam",
        "ur": "جہنم کی تفصیل",
        "hi": "जहन्नम की तफ़सील",
        "ar": "وصف جهنم"
      },
      "icon": "local_fire_department",
      "color": "red",
      "details": {
        "en": "Description of Jahannam (Hellfire)\n\nJahannam is the abode of eternal punishment prepared by Allah Almighty for disbelievers, polytheists, hypocrites, and unrepentant sinners. It is a place of unimaginable torment and suffering.\n\nMEANING AND REALITY:\n• The Arabic word \"Jahannam\" means \"a dark storm\" or \"a stern expression\"\n• It is a real, physical place that exists now and will exist forever\n• \"Indeed, Hell is lying in wait, a destination for the transgressors. They will remain therein for ages [unending].\" (Quran 78:21-23)\n• Created by Allah as a manifestation of His perfect justice\n• It serves as the ultimate consequence for those who reject faith and commit grave injustices\n\nTHE CREATION OF HELLFIRE:\n• When Hell was created, Allah kept it burning for one thousand years until it became red\n• Then it was heated for another thousand years until it turned bright white\n• Finally heated again for another thousand years until the flames became pitch black\n• This pitch-black fire is what exists today - the most intense form of fire\n• Real fire that is 70 times hotter than worldly fire\n• The Prophet ﷺ said: \"The fire you kindle is one of 70 parts of the fire of Hell.\" (Sahih Bukhari)\n• The fire never extinguishes, never decreases, and never requires fuel to maintain\n\nITS SIZE AND VASTNESS:\n• Jahannam is extremely vast and bottomless - beyond human comprehension\n• \"On the Day when We will say to Hell: 'Are you filled?' It will say: 'Are there any more?'\" (Quran 50:30)\n• The Prophet ﷺ said: \"A stone as big as seven khalifat (huge camels) thrown from the edge of Hell would fall for seventy years before reaching its bottom.\" (Sahih Muslim)\n• So enormous that it needs 70,000 angels to pull each of its seven gates on the Day of Judgment\n• The Messenger ﷺ described it: \"Jahannam is built inside like a well with side posts, and beside each post there is an angel carrying an iron mace\"\n• Has a width that would take years to traverse\n• Contains valleys, mountains, and endless depths of torment\n\nFUEL OF HELLFIRE:\n• Primary fuel: People and stones (idols)\n• \"O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.\" (Quran 66:6)\n• The disbelievers themselves become fuel, continuously burning\n• Never needs additional fuel - self-sustaining by Allah's command\n• \"And they will have no food except from a poisonous, thorny plant\" (Quran 88:6)\n\nSTRUCTURE AND PHYSICAL FEATURES:\n• Seven distinct levels/gates, each deeper and more severe than the last\n• \"It has seven gates; for every gate is of them a portion designated.\" (Quran 15:43-44)\n• Made of walls of fire, floors of fire, and ceilings of fire\n• Contains mountains of fire and valleys of fire\n• Rivers of boiling water, pus, and blood flow through it\n• Extreme darkness within darkness despite the intense flames\n• The fire gives off no light - only burning heat\n• Filled with scorching winds and black smoke\n• Foul, unbearable smells that suffocate\n\nTHE INTENSITY OF ITS HEAT:\n• Heat so intense it melts everything - skin, flesh, bones, and organs\n• The Prophet ﷺ said: \"The mildest punishment for a person in Hell will be that burning coals will be placed under the arch of his feet which will cause his brain to boil.\" (Sahih Bukhari)\n• \"And what can make you know what is Hell-Fire? It spares not, nor does it leave [anything]. It scorches the skin.\" (Quran 74:27-29)\n• If even one drop of Jahannam's fire fell on earth, it would destroy all life\n• The Prophet ﷺ said: \"If one drop from Az-Zaqqum were to land in this world, the people of earth and all their means of sustenance would be destroyed. So how must it be for the one who must eat it?\" (Tirmidhi)\n\nTHE TREE OF ZAQQUM:\n• A cursed tree that springs from the bottom of Hellfire\n• \"Indeed, the tree of Zaqqum is food for the sinful. Like murky oil, it boils within bellies, like the boiling of scalding water.\" (Quran 44:43-46)\n• \"Verily, the tree of Zaqqum will be the food of the sinners. It is like boiling oil, it will boil in the bellies, like the boiling of scalding water.\" (Quran 44:43-46)\n• Its fruits are described as resembling the heads of devils (Quran 37:62-65)\n• Extremely bitter and causes immense internal pain\n• Does not satisfy hunger but increases suffering\n\nSOUNDS OF HELL:\n• Hell has a terrifying roar and fury\n• \"When they are thrown into it, they hear from it a [dreadful] inhaling while it boils up. It almost bursts with rage.\" (Quran 67:7-8)\n• Continuous screaming, wailing, and crying of its inhabitants\n• The sound of chains being dragged\n• The crackling and roaring of the flames\n• So terrifying that even the angels fear it\n\nTHE ETERNAL NATURE:\n• For disbelievers and polytheists: ETERNAL punishment with no end\n• \"And they will cry out therein, 'Our Lord, remove us; we will do righteousness - other than what we were doing!' But did We not grant you life enough for whoever would remember therein to remember? And the warner had come to you. So taste [the punishment], for there is not for the wrongdoers any helper.\" (Quran 35:37)\n• \"They will wish to get out of the Fire, but never are they to emerge from it, and for them is an enduring punishment.\" (Quran 5:37)\n• Time in Hell: \"Abiding therein for ages [unending]\" (Quran 78:23)\n• No death, no relief, no escape - only continuous suffering\n• \"Indeed, whoever comes to his Lord as a criminal - indeed, for him is Hell; he will neither die therein nor live.\" (Quran 20:74)\n\nTHE HORROR BEYOND IMAGINATION:\n• If a bucket of Hellfire were revealed to earth, everything would burn instantly\n• Its roar and fury frighten even the angels of Allah\n• The Prophet ﷺ heard Hell's breathing and became deeply concerned for his Ummah\n• He ﷺ said: \"If you knew what I know, you would laugh little and weep much.\" (Sahih Bukhari)\n• No eye has seen, no ear has heard such punishment\n• The Prophet ﷺ would often cry when thinking about Hellfire\n• He said: \"Hell is surrounded by desires, and Paradise is surrounded by hardships\"\n\nPURPOSE AND WISDOM:\n• Demonstrates Allah's perfect justice - every sin has its consequence\n• Warning and deterrent for humanity to choose righteousness\n• Purification for sinful believers before entering Paradise\n• Eternal abode for those who rejected Allah's mercy and guidance\n• \"And whoever disobeys Allah and His Messenger and transgresses His limits - He will put him into the Fire to abide eternally therein, and he will have a humiliating punishment.\" (Quran 4:14)\n\nCONVERSATION BETWEEN PARADISE AND HELL:\n• The Prophet ﷺ narrated that Paradise and Hell argued before Allah\n• Hell said: \"I have been favored with the arrogant and tyrants\"\n• Paradise said: \"What is the matter with me? Only the weak and humble enter me\"\n• Allah said to Paradise: \"You are My Mercy which I bestow on whom I wish\"\n• And to Hell: \"You are My punishment with which I punish whom I wish\"\n• (Sahih Bukhari & Muslim)\n\nMay Allah protect us all from the punishment of Hellfire and grant us entry into Paradise. Ameen.",
        "ur": "جہنم کی تفصیل\n\nجہنم ابدی عذاب کی جگہ ہے جسے اللہ نے کافروں اور گنہگاروں کے لیے تیار کیا ہے۔\n\nدوزخ کی حقیقت:\n• \"بیشک جہنم گھات میں ہے، حد سے بڑھنے والوں کا ٹھکانا۔\" (قرآن 78:21-22)\n• اللہ نے انصاف اور سزا کی جگہ کے طور پر بنائی\n• حقیقی آگ جو دنیاوی آگ سے 70 گنا زیادہ گرم ہے\n• نبی کریم ﷺ نے فرمایا: \"تم جو آگ جلاتے ہو وہ جہنم کی آگ کے 70 حصوں میں سے ایک ہے۔\" (بخاری)\n\nاس کا سائز اور وسعت:\n• انتہائی وسیع اور لامحدود\n• \"جس دن ہم جہنم سے کہیں گے: 'کیا تو بھر گئی؟' وہ کہے گی: 'کیا اور بھی ہیں؟'\" (قرآن 50:30)\n• نبی کریم ﷺ نے فرمایا: \"جہنم میں پھینکا گیا پتھر 70 سال گرتا رہے گا اس کی تہہ تک پہنچنے سے پہلے۔\"\n• اتنی بڑی کہ قیامت کے دن اسے کھینچنے کے لیے 70,000 فرشتوں کی ضرورت ہے\n\nجہنم کی آگ:\n• کبھی نہیں بجھتی اور نہ کم ہوتی ہے\n• \"ان کا رب انہیں اپنی رحمت اور رضامندی کی خوشخبری دیتا ہے اور باغات کی جن میں ان کے لیے دائمی نعمت ہے۔\" (قرآن 9:21)\n• ایندھن: لوگ اور پتھر\n• \"اے ایمان والو! اپنے آپ کو اور اپنے خاندانوں کو اس آگ سے بچاؤ جس کا ایندھن لوگ اور پتھر ہیں۔\" (قرآن 66:6)\n\nجسمانی تفصیل:\n• شدید گرمی جو سب کچھ پگھلا دیتی ہے\n• تاریکی کے اندر تاریکی\n• بدبو اور دھواں\n• پینے کے لیے کھولتا پانی اور پیپ\n• تلخ پھل والا زقوم کا درخت\n• زنجیریں، بیڑیاں اور لوہے کے طوق\n\nجہنم کے دروازے:\n• سات دروازے، ہر ایک مختلف قسم کے گنہگاروں کے لیے\n• \"اور بیشک جہنم ان سب کے لیے وعدہ گاہ ہے۔ اس کے سات دروازے ہیں؛ ہر دروازے کے لیے ان میں سے ایک مقررہ حصہ ہے۔\" (قرآن 15:43-44)\n\nخوفناکی:\n• اگر جہنم کی ایک بالٹی زمین پر ظاہر کر دی جائے تو سب کچھ جل جائے\n• اس کی گرج اور غصہ فرشتوں کو بھی خوفزدہ کرتا ہے\n• نبی کریم ﷺ نے اس کی سانس سنی اور اپنی امت کے لیے پریشان ہوئے",
        "hi": "जहन्नम की तफ़सील\n\nजहन्नम अबदी अज़ाब की जगह है जिसे अल्लाह ने काफ़िरों और गुनहगारों के लिए तैयार किया है।\n\nदोज़ख़ की हक़ीक़त:\n• \"बेशक जहन्नम घात में है, हद से बढ़ने वालों का ठिकाना।\" (क़ुरआन 78:21-22)\n• अल्लाह ने इंसाफ़ और सज़ा की जगह के तौर पर बनाई\n• हक़ीक़ी आग जो दुनियावी आग से 70 गुना ज़्यादा गरम है\n• नबी करीम ﷺ ने फ़रमाया: \"तुम जो आग जलाते हो वो जहन्नम की आग के 70 हिस्सों में से एक है।\" (बुख़ारी)\n\nइसका साइज़ और वुसअत:\n• इंतिहाई वसीअ और लामहदूद\n• \"जिस दिन हम जहन्नम से कहेंगे: 'क्या तू भर गई?' वो कहेगी: 'क्या और भी हैं?'\" (क़ुरआन 50:30)\n• नबी करीम ﷺ ने फ़रमाया: \"जहन्नम में फेंका गया पत्थर 70 साल गिरता रहेगा उसकी तह तक पहुंचने से पहले।\"\n• इतनी बड़ी कि क़यामत के दिन उसे खींचने के लिए 70,000 फ़रिश्तों की ज़रूरत है\n\nजहन्नम की आग:\n• कभी नहीं बुझती और न कम होती है\n• \"उनका रब उन्हें अपनी रहमत और रज़ामंदी की ख़ुशख़बरी देता है और बाग़ात की जिनमें उनके लिए दाइमी नेमत है।\" (क़ुरआन 9:21)\n• ईंधन: लोग और पत्थर\n• \"ऐ ईमान वालो! अपने आपको और अपने ख़ानदानों को उस आग से बचाओ जिसका ईंधन लोग और पत्थर हैं।\" (क़ुरआन 66:6)\n\nजिस्मानी तफ़सील:\n• शदीद गर्मी जो सब कुछ पिघला देती है\n• तारीकी के अंदर तारीकी\n• बदबू और धुआं\n• पीने के लिए खौलता पानी और पीप\n• तल्ख़ फल वाला ज़क़्क़ूम का दरख़्त\n• ज़ंजीरें, बेड़ियां और लोहे के तौक़\n\nजहन्नम के दरवाज़े:\n• सात दरवाज़े, हर एक मुख़्तलिफ़ क़िस्म के गुनहगारों के लिए\n• \"और बेशक जहन्नम उन सबके लिए वादागाह है। इसके सात दरवाज़े हैं; हर दरवाज़े के लिए उनमें से एक मुक़र्ररा हिस्सा है।\" (क़ुरआन 15:43-44)\n\nख़ौफ़नाकी:\n• अगर जहन्नम की एक बाल्टी ज़मीन पर ज़ाहिर कर दी जाए तो सब कुछ जल जाए\n• इसकी गर्ज और ग़ुस्सा फ़रिश्तों को भी ख़ौफ़ज़दा करता है\n• नबी करीम ﷺ ने इसकी सांस सुनी और अपनी उम्मत के लिए परेशान हुए",
        "ar": "وصف جهنم\n\nجهنم دار العذاب الأليم التي أعدها الله للكافرين.\n\nعظم جهنم:\n• \"إِذَا رَأَتْهُم مِّن مَّكَانٍ بَعِيدٍ سَمِعُوا لَهَا تَغَيُّظًا وَزَفِيرًا\" (سورة الفرقان: 12)\n• نارها أشد من نار الدنيا بسبعين مرة\n• \"نَارُ اللَّهِ الْمُوقَدَةُ * الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ\" (سورة الهمزة: 6-7)\n• حرها شديد لا يطاق\n\nبناء جهنم:\n• سوداء مظلمة\n• لها سبعة أبواب\n• \"لَهَا سَبْعَةُ أَبْوَابٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ\" (سورة الحجر: 44)\n• أودية وجبال من نار\n• لا راحة ولا نجاة منها\n\nشدة حرها:\n• قال النبي ﷺ: \"نار ابن آدم التي توقدون جزء من سبعين جزءاً من نار جهنم\" (البخاري)\n• تأكل اللحم والعظم\n• تصهر ما في البطون والجلود\n• \"كُلَّمَا نَضِجَتْ جُلُودُهُم بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا\" (سورة النساء: 56)\n\nطعام أهل النار:\n• الزقوم: شجرة تخرج في أصل الجحيم\n• \"إِنَّ شَجَرَتَ الزَّقُّومِ * طَعَامُ الْأَثِيمِ\" (سورة الدخان: 43-44)\n• كالمهل يغلي في البطون\n• الضريع: طعام لا يسمن ولا يغني من جوع\n\nشراب أهل النار:\n• الحميم: الماء الحار المغلي\n• \"وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ\" (سورة محمد: 15)\n• الغساق: صديد أهل النار\n• يشوي الوجوه\n\nالخلود في النار:\n• \"خَالِدِينَ فِيهَا أَبَدًا\" (سورة الجن: 23)\n• لا يموتون فيها ولا يحيون\n• \"لَا يُقْضَىٰ عَلَيْهِمْ فَيَمُوتُوا\" (سورة فاطر: 36)\n• عذاب دائم لا ينقطع"
      }
    },
    {
      "step": 2,
      "title_key": "jahannam_fazilat_2_levels_of_hellfire",
      "title": {
        "en": "Levels of Hellfire",
        "ur": "جہنم کے درجات",
        "hi": "जहन्नम के दर्जात",
        "ar": "دركات جهنم"
      },
      "icon": "circle",
      "color": "deepOrange",
      "details": {
        "en": "The Seven Levels of Hellfire\n\nJahannam is not a single uniform place of punishment, but rather consists of seven distinct levels or gates, each with varying degrees of torment. The deeper the level, the more severe the punishment.\n\nQURANIC FOUNDATION:\n• \"It has seven gates; for every gate is of them a portion designated.\" (Quran 15:43-44)\n• \"And indeed, Hell is the promised place for them all.\" (Quran 15:43)\n• The seven levels were mentioned in authentic Hadith and became widely accepted in Islamic teachings\n• Each level corresponds to one of the seven names of Hell mentioned in the Quran\n• Assignment to levels is based on the severity and type of sins committed\n\nTHE SEVEN LEVELS IN ORDER (FROM TOP TO BOTTOM):\n\n**1. JAHANNAM (جَهَنَّم) - The First Level:**\n• The uppermost and least severe level (though still extremely painful)\n• Primarily for sinful Muslims who died without repenting from major sins\n• Those who committed sins like abandoning prayer, consuming interest (riba), breaking family ties\n• NOT eternal for Muslims - they may eventually be cleansed and forgiven\n• The Prophet ﷺ said: \"People will come out of Hell after having been therein. They will be called the Jahannamiyyun (people of Hell).\" (Sahih Bukhari)\n• Punishment here includes: Burning flames, chains, and torment\n• Duration: Until their sins are purified, then Allah's mercy may save them\n• Those who had even an atom's weight of faith will eventually leave\n\n**2. LADHAA/LAZA (لَظَىٰ) - The Second Level:**\n• Mentioned in Quran 70:15: \"No! Indeed, it is the Flame [of Hell], A remover of exteriors\"\n• For those who denied Allah and His prophets but didn't commit shirk (polytheism)\n• Includes those who knew the truth but deliberately rejected it\n• Polytheists and those who associated partners with Allah\n• The fire here removes and burns external layers of skin repeatedly\n• Intense flames that peel away flesh layer by layer\n• Punishment includes: Continuous burning, renewal of skin for repeated torment\n• \"As often as their skins are roasted through, We will replace them with other skins so they may taste the punishment.\" (Quran 4:56)\n\n**3. SAQAR (سَقَر) - The Third Level:**\n• \"I will drive him into Saqar. And what can make you know what is Saqar? It lets nothing remain and leaves nothing [unburned], altering the skins.\" (Quran 74:26-29)\n• For those who neglected prayer (one of the greatest sins)\n• For those who didn't give charity and refused to help the poor\n• For those who denied the Day of Judgment\n• For the Magians (fire-worshippers) and Zoroastrians\n• This fire scorches the skin completely - \"It spares not, nor does it leave\"\n• Extreme heat that burns continuously without pause\n• The Prophet ﷺ said: \"A person neglecting his Salah shall remain in Jahannam for one Huqb (80 years, each day equivalent to 1000 years)\"\n\n**4. AL-HUTAMAH (ٱلْحُطَمَة) - The Fourth Level:**\n• \"No! He will surely be thrown into the Crusher. And what can make you know what is the Crusher? It is the fire of Allah, [eternally] fueled, which mounts directed at the hearts.\" (Quran 104:4-7)\n• The \"Crusher\" or \"Breaker\" - crushes and breaks everything\n• For those who consumed wealth in falsehood and hoarded money\n• For greedy tyrants, usurers, and those who withheld Zakat\n• For slanderers and those who caused division in communities\n• For the Jews who distorted their scriptures and rejected prophets\n• Fire that reaches the hearts and internal organs\n• Punishment: Being crushed repeatedly, fire burning from inside out\n• \"It mounts directed at the hearts\" - most painful internal burning\n\n**5. JAHEEM (جَحِيم) - The Fifth Level:**\n• \"And those who disbelieved will be driven to Hell in groups.\" (Quran 39:71)\n• For idol worshippers and those who worshipped false gods\n• For those who led others astray from the path of Allah\n• For major disbelievers who openly denied Allah\n• Extremely intense blazing fire\n• Name means \"blazing fire\" or \"fierce blaze\"\n• Continuous torture with no moment of rest\n• Inhabitants are driven in groups and thrown in\n• Fire so intense it can be heard roaring from far away\n\n**6. SA'EER (سَعِير) - The Sixth Level:**\n• \"Soon I will drive him into Hellfire. And what can make you know what is Hellfire?\" (Quran 74:26-27)\n• For satanic forces and devils (Shayateen)\n• For their human followers who obeyed Satan over Allah\n• For tyrants, dictators, and corrupt rulers who abused authority\n• For those who spread misguidance through media, influence, or policy\n• For religious hypocrites who used Islam for worldly gain\n• Extremely fierce blazing fire\n• Punishment includes: Being bound with devils, continuous torment\n• \"And when they are thrown into it at a narrow place therein bound in chains, they will cry out thereupon for destruction.\" (Quran 25:13)\n\n**7. AL-HAWIYAH (ٱلْهَاوِيَة) - The Seventh and Lowest Level:**\n• \"And what can make you know what that is? It is a Fire, intensely hot.\" (Quran 101:9-11)\n• The deepest, darkest, and most painful level of Hell\n• The \"Bottomless Pit\" or \"Abyss\" - no end to its depth\n• Primarily for HYPOCRITES (Munafiqun) - the worst of all people\n• \"Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper.\" (Quran 4:145)\n• For those who pretended to be Muslims but disbelieved inside\n• For backbiters and those who destroyed others' reputations\n• For non-believers who died in a state of disbelief\n• Heat so intense it cannot be imagined\n• Darkest level with no light, only burning torment\n• NO ESCAPE - eternal punishment with no relief\n• Distance to fall: The Prophet ﷺ said a stone would fall for 70 years to reach the bottom\n\nTHE INTENSITY INCREASES WITH DEPTH:\n• Each level is progressively hotter, darker, and more painful than the one above\n• The punishment becomes more severe as one descends\n• The distance between each level is tremendous\n• Heat multiplies as you go deeper\n• The lowest levels have unimaginable, indescribable torment\n• Some people will have fire only at their ankles (lightest), while others will be completely submerged (most severe)\n• The Prophet ﷺ said: \"The person who will have the least punishment among the people of Hell on the Day of Resurrection will be a man under whose arch of the feet will be placed two smoldering embers, and his brain will boil because of them.\" (Sahih Muslim)\n\nPRINCIPLES OF DIVINE JUSTICE:\n• \"For all there are degrees from what they have done, and [it is] so that He may fully compensate them for their deeds, and they will not be wronged.\" (Quran 6:132)\n• Each person receives punishment exactly matching their sins\n• No one is wronged - perfect justice from Allah\n• Greater sins = deeper levels = more severe punishment\n• The punishment fits the crime perfectly\n\nTEMPORARY vs ETERNAL PUNISHMENT:\n\n**For Sinful Muslims (Believers with Major Sins):**\n• May enter the first level (Jahannam) if they died without repentance\n• Punishment is temporary, not eternal\n• Duration depends on the severity of sins and Allah's wisdom\n• Intercession of Prophet Muhammad ﷺ may save them\n• Allah's mercy may forgive them at any time\n• \"Allah does not forgive association with Him, but He forgives what is less than that for whom He wills.\" (Quran 4:48)\n• Eventually will leave Hell and enter Paradise\n• Will be called \"Al-Jahannamiyyun\" (the people who were in Jahannam)\n\n**For Disbelievers, Polytheists, and Hypocrites:**\n• Eternal punishment with absolutely no escape\n• \"They will wish to get out of the Fire, but never are they to emerge from it, and for them is an enduring punishment.\" (Quran 5:37)\n• No intercession will benefit them\n• No reduction in punishment - only increase\n• \"Abiding therein eternally\" (Quran 98:6)\n• Will remain \"ages upon ages\" without end (Quran 78:23)\n\nSPECIAL PUNISHMENT FOR HYPOCRITES:\n• Hypocrites receive the worst punishment - lowest level\n• Worse than open disbelievers because they deceived Muslims\n• The Prophet ﷺ said: \"The hypocrite is more dangerous to the Ummah than open disbelievers\"\n• They will have no helpers, no supporters\n• Their punishment will be the most severe and humiliating\n• \"And never will you find for them any protector or helper\" (Quran 4:145)\n\nTHE VARIOUS DEGREES OF HEAT:\n• Each level has progressively more intense heat\n• Bottom levels (Hawiyah, Sa'eer, Jaheem) have heat beyond comprehension\n• Some will be punished with fire at ankles only\n• Some up to knees, some up to waist\n• Some completely immersed in fire\n• The Prophet ﷺ saw in a vision: \"Some up to their ankles, some up to their knees, some up to their waists, and some up to their necks\" (Sahih Muslim)\n\nWHO ASSIGNS PEOPLE TO LEVELS:\n• Allah Almighty in His perfect justice\n• Based on the complete record of deeds (Book of Deeds)\n• Nothing is hidden - every deed is accounted for\n• \"So whoever does an atom's weight of good shall see it, and whoever does an atom's weight of evil shall see it.\" (Quran 99:7-8)\n• Angels present the record, Allah judges with perfect fairness\n\nHOPE AND WARNING FOR BELIEVERS:\n• Avoid all major sins, especially: Shirk, murder, adultery, theft, lying, backbiting\n• Pray five times daily without fail\n• Give Zakat and charity regularly\n• Be kind to parents and maintain family ties\n• Seek Allah's forgiveness constantly through repentance\n• Perform good deeds to outweigh bad ones\n• Remember: \"Indeed, good deeds do away with misdeeds.\" (Quran 11:114)\n• The Prophet ﷺ warned: \"Paradise is surrounded by hardships, and Hell is surrounded by desires\"\n• Control desires, resist temptations, and fear Allah\n\nMay Allah protect us from all levels of Hellfire and grant us the highest levels of Paradise. Ameen.",
        "ur": "جہنم کے درجات\n\nجہنم کے مختلف درجات ہیں، ہر ایک میں گناہوں کی شدت کے مطابق مختلف سزائیں ہیں۔\n\nجہنم کے سات درجات:\n1. جہنم - پہلا درجہ گنہگار مسلمانوں کے لیے جو بالآخر معاف ہو جائیں گے\n2. لظیٰ - عیسائیوں کے لیے\n3. الحطمہ - یہودیوں کے لیے\n4. سعیر - صابیوں کے لیے\n5. سقر - آتش پرستوں کے لیے\n6. الجحیم - بت پرستوں کے لیے\n7. ہاویہ - منافقوں کے لیے سب سے گہرا درجہ\n\nسب سے نچلا درجہ - منافقوں کے لیے:\n• \"بیشک منافق جہنم کے سب سے نچلے درجے میں ہوں گے۔\" (قرآن 4:145)\n• ان لوگوں کے لیے سب سے بُری سزا جو مسلمان ہونے کا دکھاوا کرتے تھے\n• نبی کریم ﷺ نے فرمایا نفاق کھلے کفر سے بدتر ہے\n• اس درجے سے کوئی فرار نہیں\n\nگناہوں کی بنیاد پر درجات:\n• ہر شخص اپنے اعمال کے مطابق\n• \"سب کے لیے ان کے اعمال کے مطابق درجات ہیں۔\" (قرآن 6:132)\n• کبیرہ گناہ گہرے درجات کی طرف لے جاتے ہیں\n• ظالم اور جابر سخت سزا میں\n• جو فساد پھیلاتے ہیں انہیں شدید عذاب\n\nعارضی بمقابلہ مستقل:\n• گنہگار مسلمان: سزا کے بعد معاف ہو کر جنت میں جا سکتے ہیں\n• کافر اور منافق: ابدی سزا، کبھی نہیں نکلیں گے\n• \"وہ چاہیں گے کہ آگ سے نکل جائیں، لیکن وہ کبھی نہیں نکلیں گے۔\" (قرآن 5:37)\n\nدرجات کے درمیان حرکت:\n• اللہ اپنی حکمت سے سزا بڑھا یا کم کر سکتا ہے\n• نبی کریم ﷺ کی شفاعت کچھ مسلمانوں کو بچا سکتی ہے\n• کافروں کے لیے کوئی شفاعت نہیں\n• اللہ کی طرف سے حتمی انصاف\n\nگرمی کے درجات:\n• ہر درجہ اوپر والے سے زیادہ گرم\n• نچلے درجات میں ناقابل تصور گرمی\n• الہاویہ (اتھاہ گڑھا) میں سب سے شدید آگ\n• نبی کریم ﷺ نے فرمایا کچھ لوگوں کے ٹخنوں تک آگ ہوگی جبکہ دوسرے مکمل طور پر ڈوبے ہوں گے\n\nمومنوں کے لیے تنبیہ:\n• مومن بھی اپنے گناہوں کے لیے جہنم چکھ سکتے ہیں\n• مسلسل معافی مانگیں\n• خاص طور پر کبیرہ گناہوں سے بچیں\n• نبی کریم ﷺ نے خبردار کیا: \"جنت مشکلات سے گھری ہے اور جہنم خواہشات سے گھری ہے۔\"",
        "hi": "जहन्नम के दर्जात\n\nजहन्नम के मुख़्तलिफ़ दर्जात हैं, हर एक में गुनाहों की शिद्दत के मुताबिक़ मुख़्तलिफ़ सज़ाएं हैं।\n\nजहन्नम के सात दर्जात:\n1. जहन्नम - पहला दर्जा गुनहगार मुसलमानों के लिए जो बिलआख़िर माफ़ हो जाएंगे\n2. लज़ा - ईसाइयों के लिए\n3. अल-हुतमा - यहूदियों के लिए\n4. सईर - साबियों के लिए\n5. सक़र - आतिश परस्तों के लिए\n6. अल-जहीम - बुत परस्तों के लिए\n7. हाविया - मुनाफ़िक़ों के लिए सबसे गहरा दर्जा\n\nसबसे निचला दर्जा - मुनाफ़िक़ों के लिए:\n• \"बेशक मुनाफ़िक़ जहन्नम के सबसे निचले दर्जे में होंगे।\" (क़ुरआन 4:145)\n• उन लोगों के लिए सबसे बुरी सज़ा जो मुसलमान होने का दिखावा करते थे\n• नबी करीम ﷺ ने फ़रमाया निफ़ाक़ खुले कुफ़्र से बदतर है\n• इस दर्जे से कोई फ़रार नहीं\n\nगुनाहों की बुनियाद पर दर्जात:\n• हर शख़्स अपने आमाल के मुताबिक़\n• \"सबके लिए उनके आमाल के मुताबिक़ दर्जात हैं।\" (क़ुरआन 6:132)\n• कबीरा गुनाह गहरे दर्जात की तरफ़ ले जाते हैं\n• ज़ालिम और जाबिर सख़्त सज़ा में\n• जो फ़साद फैलाते हैं उन्हें शदीद अज़ाब\n\nअरज़ी बमुक़ाबला मुस्तक़िल:\n• गुनहगार मुसलमान: सज़ा के बाद माफ़ होकर जन्नत में जा सकते हैं\n• काफ़िर और मुनाफ़िक़: अबदी सज़ा, कभी नहीं निकलेंगे\n• \"वो चाहेंगे कि आग से निकल जाएं, लेकिन वो कभी नहीं निकलेंगे।\" (क़ुरआन 5:37)\n\nदर्जात के दरमियान हरकत:\n• अल्लाह अपनी हिकमत से सज़ा बढ़ा या कम कर सकता है\n• नबी करीम ﷺ की शफ़ाअत कुछ मुसलमानों को बचा सकती है\n• काफ़िरों के लिए कोई शफ़ाअत नहीं\n• अल्लाह की तरफ़ से हतमी इंसाफ़\n\nगर्मी के दर्जात:\n• हर दर्जा ऊपर वाले से ज़्यादा गरम\n• निचले दर्जात में नाक़ाबिले तसव्वुर गर्मी\n• अल-हाविया (अथाह गड्ढा) में सबसे शदीद आग\n• नबी करीम ﷺ ने फ़रमाया कुछ लोगों के टखनों तक आग होगी जबकि दूसरे मुकम्मल तौर पर डूबे होंगे\n\nमोमिनों के लिए तंबीह:\n• मोमिन भी अपने गुनाहों के लिए जहन्नम चख सकते हैं\n• मुसलसल माफ़ी मांगें\n• ख़ास तौर पर कबीरा गुनाहों से बचें\n• नबी करीम ﷺ ने ख़बरदार किया: \"जन्नत मुश्किलात से घिरी है और जहन्नम ख़्वाहिशात से घिरी है।\"",
        "ar": "دركات جهنم\n\nلجهنم دركات ومنازل متفاوتة في العذاب.\n\nالدركات السبع:\n• جهنم: أعلاها\n• لظى: دركة شديدة الحرارة\n• الحطمة: تحطم كل شيء\n• السعير: نار مستعرة\n• سقر: شديدة السواد\n• الجحيم: نار ملتهبة\n• الهاوية: أسفل دركات النار\n\nأهل كل دركة:\n• \"إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ\" (سورة النساء: 145)\n• المنافقون في الدرك الأسفل\n• الكفار في دركات حسب كفرهم\n• العصاة من المؤمنين في الدركات العليا\n\nشدة العذاب:\n• كلما نزل الدرك زاد العذاب\n• الدرك الأسفل أشد عذاباً\n• \"لَهُمْ مِن فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ وَمِن تَحْتِهِمْ ظُلَلٌ\" (سورة الزمر: 16)\n\nخزنة جهنم:\n• ملائكة غلاظ شداد\n• \"عَلَيْهَا تِسْعَةَ عَشَرَ\" (سورة المدثر: 30)\n• \"لَّا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ\" (سورة التحريم: 6)\n• يزيدون في عذاب أهل النار\n\nمالك خازن النار:\n• رئيس خزنة جهنم\n• \"وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ\" (سورة الزخرف: 77)\n• لا يجيبهم إلا بعد ألف عام\n• يقول لهم: إنكم ماكثون\n\nالتفاوت في العذاب:\n• \"لِكُلٍّ دَرَجَاتٌ مِّمَّا عَمِلُوا\" (سورة الأنعام: 132)\n• يتفاوت العذاب بحسب الذنوب\n• أخف أهل النار عذاباً من له نعلان من نار\n• أشدهم عذاباً المنافقون والمشركون"
      }
    },
    {
      "step": 3,
      "title_key": "jahannam_fazilat_3_people_of_hellfire",
      "title": {
        "en": "People of Hellfire",
        "ur": "جہنم کے لوگ",
        "hi": "जहन्नम के लोग",
        "ar": "أهل النار"
      },
      "icon": "groups",
      "color": "brown",
      "details": {
        "en": "People of Hellfire\n\nCertain categories of people are warned of severe punishment in Hellfire.\n\nDisbelievers and Polytheists:\n• \"Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills.\" (Quran 4:48)\n• Those who deny Allah and His messengers\n• Those who worship idols or associate partners with Allah\n• Those who reject the truth after it came to them\n• Eternal punishment with no escape\n\nHypocrites (Munafiqun):\n• Worst punishment in the lowest level of Hell\n• Those who pretend to be Muslims but disbelieve inside\n• \"Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper.\" (Quran 4:145)\n• They deceived the believers in this world\n\nMajor Sinners Among Muslims:\n• Those who persist in major sins without repentance\n• Murderers: \"Whoever kills a believer intentionally, his recompense is Hell.\" (Quran 4:93)\n• Those who consume riba (interest)\n• Those who consume orphans' wealth\n• Those who abandon prayer deliberately\n• Those who disobey parents severely\n• Those who break family ties\n\nOppressors and Tyrants:\n• Those who oppress and harm others\n• Unjust rulers and leaders\n• Those who spread corruption on earth\n• The Prophet ﷺ said: \"The oppressor and the one who helps him and the one who is pleased with it are all partners in sin.\"\n\nSpecific Categories Mentioned:\n• Those who are arrogant and prideful\n• Backbiters and slanderers\n• Liars and false witnesses\n• Those who consume alcohol\n• Adulterers and fornicators\n• Those who practice black magic\n• Fortune tellers and astrologers\n• Those who break trusts\n\nWomen Warned Specifically:\n• The Prophet ﷺ saw most inhabitants of Hell were women\n• Due to: being ungrateful to husbands, cursing frequently, and ingratitude to kindness\n• Not an eternal punishment for Muslim women who repent\n\nMen Warned Specifically:\n• Those who are unjust to their wives\n• Those who don't provide for their families\n• Those who don't lower their gaze\n• Those who are miserly and don't give charity\n\nThe Way to Avoid:\n• Sincere faith in Allah alone\n• Following the Prophet Muhammad ﷺ\n• Avoiding all major sins\n• Repenting sincerely from all sins\n• Seeking Allah's forgiveness constantly",
        "ur": "جہنم کے لوگ\n\nکچھ خاص قسم کے لوگوں کو جہنم میں سخت سزا کی تنبیہ ہے۔\n\nکافر اور مشرک:\n• \"بیشک اللہ شرک کو معاف نہیں کرتا، لیکن اس سے کم جو چاہے معاف کر دیتا ہے۔\" (قرآن 4:48)\n• جو اللہ اور اس کے رسولوں کا انکار کرتے ہیں\n• جو بتوں کی پوجا کرتے ہیں یا اللہ کے ساتھ شریک ٹھہراتے ہیں\n• جو حق آنے کے بعد اسے رد کرتے ہیں\n• ابدی سزا بغیر کسی فرار کے\n\nمنافق:\n• جہنم کے سب سے نچلے درجے میں سب سے بُری سزا\n• جو مسلمان ہونے کا دکھاوا کرتے ہیں لیکن اندر سے کافر ہیں\n• \"بیشک منافق جہنم کی سب سے نچلی تہہ میں ہوں گے - اور تم ان کے لیے کوئی مددگار نہیں پاؤ گے۔\" (قرآن 4:145)\n• انہوں نے اس دنیا میں مومنوں کو دھوکہ دیا\n\nمسلمانوں میں کبیرہ گنہگار:\n• جو توبہ کیے بغیر کبیرہ گناہوں پر اصرار کرتے ہیں\n• قاتل: \"جو کسی مومن کو جان بوجھ کر قتل کرے، اس کی سزا جہنم ہے۔\" (قرآن 4:93)\n• جو سود کھاتے ہیں\n• جو یتیموں کا مال کھاتے ہیں\n• جو جان بوجھ کر نماز چھوڑتے ہیں\n• جو والدین کی سخت نافرمانی کرتے ہیں\n• جو رشتے توڑتے ہیں\n\nظالم اور جابر:\n• جو دوسروں پر ظلم کرتے اور نقصان پہنچاتے ہیں\n• ناانصاف حکمران اور لیڈر\n• جو زمین پر فساد پھیلاتے ہیں\n• نبی کریم ﷺ نے فرمایا: \"ظالم اور جو اس کی مدد کرے اور جو اس سے خوش ہو سب گناہ میں شریک ��یں۔\"\n\nمخصوص زمرے:\n• جو مغرور اور متکبر ہیں\n• غیبت کرنے والے اور بہتان لگانے والے\n• جھوٹے اور جھوٹے گواہ\n• جو شراب پیتے ہیں\n• زنا کار\n• جو کالا جادو کرتے ہیں\n• نجومی اور فال گیر\n• جو امانت میں خیانت کرتے ہیں\n\nخواتین کو خاص تنبیہ:\n• نبی کریم ﷺ نے دیکھا جہنم کے زیادہ تر باشندے خواتین تھیں\n• وجوہات: شوہر کی ناشکری، کثرت سے لعنت کرنا، اور احسان کی ناشکری\n• توبہ کرنے والی مسلمان خواتین کے لیے ابدی سزا نہیں\n\nمردوں کو خاص تنبیہ:\n• جو اپنی بیویوں پر ظلم کرتے ہیں\n• جو اپنے خاندانوں کی کفالت نہیں کرتے\n• جو نظریں نیچی نہیں کرتے\n• جو بخیل ہیں اور صدقہ نہیں دیتے\n\nبچنے کا راستہ:\n• صرف اللہ پر مخلص ایمان\n• نبی محمد ﷺ کی پیروی\n• تمام کبیرہ گناہوں سے پرہیز\n• تمام گناہوں سے مخلصانہ توبہ\n• مسلسل اللہ سے معافی مانگنا",
        "hi": "जहन्नम के लोग\n\nकुछ ख़ास क़िस्म के लोगों को जहन्नम में सख़्त सज़ा की तंबीह है।\n\nकाफ़िर और मुशरिक:\n• \"बेशक अल्लाह शिर्क को माफ़ नहीं करता, लेकिन उससे कम जो चाहे माफ़ कर देता है।\" (क़ुरआन 4:48)\n• जो अल्लाह और उसके रसूलों का इंकार करते हैं\n• जो बुतों की पूजा करते हैं या अल्लाह के साथ शरीक ठहराते हैं\n• जो हक़ आने के बाद उसे रद करते हैं\n• अबदी सज़ा बग़ैर किसी फ़रार के\n\nमुनाफ़िक़:\n• जहन्नम के सबसे निचले दर्जे में सबसे बुरी सज़ा\n• जो मुसलमान होने का दिखावा करते हैं लेकिन अंदर से काफ़िर हैं\n• \"बेशक मुनाफ़िक़ जहन्नम की सबसे निचली तह में होंगे - और तुम उनके लिए कोई मददगार नहीं पाओगे।\" (क़ुरआन 4:145)\n• उन्होंने इस दुनिया में मोमिनों को धोका दिया\n\nमुसलमानों में कबीरा गुनहगार:\n• जो तौबा किए बग़ैर कबीरा गुनाहों पर इसरार करते हैं\n• क़ातिल: \"जो किसी मोमिन को जानबूझकर क़त्ल करे, उसकी सज़ा जहन्नम है।\" (क़ुरआन 4:93)\n• जो सूद खाते हैं\n• जो यतीमों का माल खाते हैं\n• जो जानबूझकर नमाज़ छोड़ते हैं\n• जो वालिदैन की सख़्त नाफ़रमानी करते हैं\n• जो रिश्ते तोड़ते हैं\n\nज़ालिम और जाबिर:\n• जो दूसरों पर ज़ुल्म करते और नुक़सान पहुंचाते हैं\n• नाइंसाफ़ हुक्मरान और लीडर\n• जो ज़मीन पर फ़साद फैलाते हैं\n• नबी करीम ﷺ ने फ़रमाया: \"ज़ालिम और जो उसकी मदद करे और जो उससे ख़ुश हो सब गुनाह में शरीक हैं।\"\n\nमख़सूस ज़ुमरे:\n• जो मग़रूर और मुतकब्बिर हैं\n• ग़ीबत करने वाले और बोहतान लगाने वाले\n• झूठे और झूठे गवाह\n• जो शराब पीते हैं\n• ज़िनाकार\n• जो काला जादू करते हैं\n• नजूमी और फ़ाल गीर\n• जो अमानत में ख़यानत करते हैं\n\nख़वातीन को ख़ास तंबीह:\n• नबी करीम ﷺ ने देखा जहन्नम के ज़्यादातर बाशिंदे ख़वातीन थीं\n• वजूहात: शौहर की नाशुक्री, कसरत से लानत करना, और एहसान की नाशुक्री\n• तौबा करने वाली मुसलमान ख़वातीन के लिए अबदी सज़ा नहीं\n\nमर्दों को ख़ास तंबीह:\n• जो अपनी बीवियों पर ज़ुल्म करते हैं\n• जो अपने ख़ानदानों की किफ़ालत नहीं करते\n• जो निगाहें नीची नहीं करते\n• जो बख़ील हैं और सदक़ा नहीं देते\n\nबचने का रास्ता:\n• सिर्फ़ अल्लाह पर मुख़्लिस ईमान\n• नबी मुहम्मद ﷺ की पैरवी\n• तमाम कबीरा गुनाहों से परहेज़\n• तमाम गुनाहों से मुख़्लिसाना तौबा\n• मुसलसल अल्लाह से माफ़ी मांगना",
        "ar": "أهل النار\n\nمن هم أهل النار وأعمالهم.\n\nالكفار والمشركون:\n• \"إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ\" (سورة النساء: 48)\n• الذين كفروا بالله ورسله\n• المشركون الذين عبدوا غير الله\n• \"إِنَّهُ مَن يُشْرِكْ بِاللَّهِ فَقَدْ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ\" (سورة المائدة: 72)\n• خالدون فيها أبداً\n\nالمنافقون:\n• \"إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ\" (سورة النساء: 145)\n• الذين يظهرون الإيمان ويبطنون الكفر\n• عذابهم أشد من الكفار\n• في الدرك الأسفل من النار\n\nأصحاب الكبائر:\n• من مات على كبيرة دون توبة\n• قد يدخل النار بذنوبه\n• ثم يخرج بالشفاعة أو فضل الله\n• \"مَن كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِّنْ إِيمَانٍ\" يخرج\n\nالظالمون:\n• \"أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ\" (سورة هود: 18)\n• الذين ظلموا أنفسهم بالمعاصي\n• ظلموا الناس في حقوقهم\n• منعوا الزكاة واغتصبوا الأموال\n\nقتلة الأنفس:\n• \"وَمَن يَقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ\" (سورة النساء: 93)\n• القاتل المتعمد في النار\n• خالداً فيها إلا أن يتوب\n\nآكلو الربا:\n• \"الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ\" (سورة البقرة: 275)\n• محاربون لله ورسوله\n• عذابهم شديد في النار\n\nالعاقون للوالدين:\n• من أكبر الكبائر\n• قال النبي ﷺ: \"ألا أنبئكم بأكبر الكبائر؟\" قالوا: بلى، قال: \"الإشراك بالله، وعقوق الوالدين\" (البخاري)"
      }
    },
    {
      "step": 4,
      "title_key": "jahannam_fazilat_4_punishments_in_hellfire",
      "title": {
        "en": "Punishments in Hellfire",
        "ur": "جہنم میں سزائیں",
        "hi": "जहन्नम में सज़ाएं",
        "ar": "عذاب النار"
      },
      "icon": "circle",
      "color": "green",
      "details": {
        "en": "Punishments in Hellfire\n\nThe punishments of Hell are severe and varied according to the sins committed.\n\nPhysical Torments:\n• Burning in eternal fire that never extinguishes\n• \"As often as their skins are roasted through, We will replace them with other skins so they may taste the punishment.\" (Quran 4:56)\n• Skin continuously renewed for endless torment\n• Boiling water poured over heads, melting internal organs\n• \"Over their heads will be poured boiling water, by which is melted that within their bellies and their skins.\" (Quran 22:19-20)\n\nFood and Drink:\n• Tree of Zaqqum with bitter, thorny fruit\n• \"Indeed, the tree of zaqqum is food for the sinful, like murky oil, it boils within bellies, like the boiling of scalding water.\" (Quran 44:43-46)\n• Boiling water and pus (ghislin) to drink\n• Food that neither nourishes nor satisfies hunger\n• Thorny plants that choke\n\nChains and Shackles:\n• Iron chains around necks and feet\n• \"When the shackles are around their necks and the chains; they will be dragged.\" (Quran 40:71)\n• Heavy iron collars that burn\n• Unable to escape or move freely\n• Dragged through fire\n\nGarments of Fire:\n• \"For them are cut out garments of fire.\" (Quran 22:19)\n• Clothing made of molten copper\n• Burns skin continuously\n• No relief or escape\n\nEmotional and Psychological Torment:\n• Eternal regret and remorse\n• \"And they will cry out therein, 'Our Lord, remove us; we will do righteousness.'\" (Quran 35:37)\n• Seeing Paradise and knowing they can never enter\n• Blamed by companions and family members\n• Despair and hopelessness\n\nDifferent Punishments for Different Sins:\n• Backbiters: Eating the flesh of their brothers\n• Liars: Lips and tongues cut with scissors of fire\n• Those who consumed riba: Standing like one beaten by Satan\n• Adulterers: In a furnace resembling an oven\n• Those who didn't pay Zakat: Wealth turned into snakes\n• Oppressors: Drinking boiling water\n• Arrogant: In the form of small ants being trampled\n\nSpecial Punishments:\n• Pharaoh and his followers in the worst punishment\n• Abu Lahab and his wife - specific torment mentioned in Quran\n• Hypocrites in the lowest level with severest punishment\n\nThe Angels of Hell (Zabaniyah):\n• 19 mighty angels guard Hell\n• Extremely stern and severe\n• Never disobey Allah's commands\n• \"O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are appointed angels, harsh and severe.\" (Quran 66:6)\n\nNo Relief or Escape:\n• \"They will wish to get out of the Fire, but never are they to emerge from it, and for them is an enduring punishment.\" (Quran 5:37)\n• Punishment never decreases for disbelievers\n• No death or sleep to provide relief\n• Eternal suffering",
        "ur": "جہنم میں سزائیں\n\nجہنم کی سزائیں سخت اور کیے گئے گناہوں کے مطابق مختلف ہیں۔\n\nجسمانی عذاب:\n• ابدی آگ میں جلنا جو کبھی نہیں بجھتی\n• \"جب ان کی کھالیں پک جائیں گی تو ہم انہیں دوسری کھالوں سے بدل دیں گے تاکہ وہ عذاب کا مزہ چکھیں۔\" (قرآن 4:56)\n• کھال مسلسل تجدید ہوتی رہتی ہے لامتناہی عذاب کے لیے\n• سروں پر کھولتا پانی ڈالا جاتا ہے، اندرونی اعضاء پگھل جاتے ہیں\n• \"ان کے سروں پر کھولتا پانی ڈالا جائے گا جس سے ان کے پیٹوں اور کھالوں کے اندر کی چیزیں پگھل جائیں گی۔\" (قرآن 22:19-20)\n\nکھانا اور پینا:\n• زقوم کا درخت تلخ، کانٹے دار پھل کے ساتھ\n• \"بیشک زقوم کا درخت گنہگاروں کا کھانا ہے، گدلے تیل کی طرح، پیٹوں میں کھولتا ہے، کھولتے پانی کی طرح۔\" (قرآن 44:43-46)\n• پینے کے لیے کھولتا پانی اور پیپ (غسلین)\n• کھانا جو نہ غذا دے نہ بھوک مٹائے\n• کانٹے دار پودے جو گلا گھونٹ دیں\n\nزنجیریں اور بیڑیاں:\n• گردنوں اور پیروں میں لوہے کی زنجیریں\n• \"جب ان کی گردنوں میں طوق اور زنجیریں ہوں گی؛ انہیں گھسیٹا جائے گا۔\" (قرآن 40:71)\n• بھاری لوہے کے طوق جو جلاتے ہیں\n• فرار یا آزادی سے حرکت نہیں کر سکتے\n• آگ میں گھسیٹے جاتے ہیں\n\nآگ کے لباس:\n• \"ان کے لیے آگ کے لباس کاٹے گئے ہیں۔\" (قرآن 22:19)\n• پگھلے ہوئے تانبے کے کپڑے\n• کھال مسلسل جلتی رہتی ہے\n• کوئی راحت یا فرار نہیں\n\nجذباتی اور نفسیاتی عذاب:\n• ابدی افسوس اور ندامت\n• \"اور وہ اس میں چیخیں گے، 'اے ہمارے رب، ہمیں نکال دے؛ ہم نیک عمل کریں گے۔'\" (قرآن 35:37)\n• جنت کو دیکھنا اور جاننا کہ وہ کبھی داخل نہیں ہو سکتے\n• ساتھیوں اور خاندان کے افراد کی طرف سے ملامت\n• مایوسی اور ناامیدی\n\nمختلف گناہوں کے لیے مختلف سزائیں:\n• غیبت کرنے والے: اپنے بھائیوں کا گوشت کھانا\n• جھوٹے: آگ کی قینچیوں سے ہونٹ اور زبان کاٹنا\n• سود کھانے والے: شیطان کی ماری ہوئی حالت میں کھڑے ہونا\n• زنا کار: تندور جیسی بھٹی میں\n• زکوٰۃ نہ دینے والے: دولت سانپوں میں بدل جاتی ہے\n• ظالم: کھولتا پانی پینا\n• متکبر: چھوٹی چیونٹیوں کی شکل میں روندے جانا\n\nخاص سزائیں:\n• فرعون اور اس کے پیروکار سب سے بُری سزا میں\n• ابو لہب اور اس کی بیوی - قرآن میں مخصوص عذاب کا ذکر\n• منافق سب سے نچلے درجے میں سخت ترین سزا کے ساتھ\n\nجہنم کے فرشتے (زبانیہ):\n• 19 طاقتور فرشتے جہنم کی حفاظت کرتے ہیں\n• انتہائی سخت اور شدید\n• کبھی اللہ کے حکموں کی نافرمانی نہیں کرتے\n• \"اے ایمان والو! اپنے آپ کو اور اپنے خاندانوں کو اس آگ سے بچاؤ جس کا ایندھن لوگ اور پتھر ہیں، جس پر سخت اور شدید فرشتے مقرر ہیں۔\" (قرآن 66:6)\n\nکوئی راحت یا فرار نہیں:\n• \"وہ چاہیں گے کہ آگ سے نکل جائیں، لیکن وہ کبھی نہیں نکلیں گے، اور ان کے لیے دائمی عذاب ہے۔\" (قرآن 5:37)\n• کافروں کے لیے سزا کبھی کم نہیں ہوتی\n• راحت کے لیے کوئی موت یا نیند نہیں\n• ابدی تکلیف",
        "hi": "जहन्नम में सज़ाएं\n\nजहन्नम की सज़ाएं सख़्त और किए गए गुनाहों के मुताबिक़ मुख़्तलिफ़ हैं।\n\nजिस्मानी अज़ाब:\n• अबदी आग में जलना जो कभी नहीं बुझती\n• \"जब उनकी खालें पक जाएंगी तो हम उन्हें दूसरी खालों से बदल देंगे ताकि वो अज़ाब का मज़ा चखें।\" (क़ुरआन 4:56)\n• खाल मुसलसल तजदीद होती रहती है लामुतनाही अज़ाब के लिए\n• सरों पर खौलता पानी डाला जाता है, अंदरूनी आज़ा पिघल जाते हैं\n• \"उनके सरों पर खौलता पानी डाला जाएगा जिससे उनके पेटों और खालों के अंदर की चीज़ें पिघल जाएंगी।\" (क़ुरआन 22:19-20)\n\nखाना और पीना:\n• ज़क़्क़ूम का दरख़्त तल्ख़, कांटेदार फल के साथ\n• \"बेशक ज़क़्क़ूम का दरख़्त गुनहगारों का खाना है, गदले तेल की तरह, पेटों में खौलता है, खौलते पानी की तरह।\" (क़ुरआन 44:43-46)\n• पीने के लिए खौलता पानी और पीप (ग़स्लीन)\n• खाना जो न ग़िज़ा दे न भूक मिटाए\n• कांटेदार पौधे जो गला घोंट दें\n\nज़ंजीरें और बेड़ियां:\n• गर्दनों और पैरों में लोहे की ज़ंजीरें\n• \"जब उनकी गर्दनों में तौक़ और ज़ंजीरें होंगी; उन्हें घसीटा जाएगा।\" (क़ुरआन 40:71)\n• भारी लोहे के तौक़ जो जलाते हैं\n• फ़रार या आज़ादी से हरकत नहीं कर सकते\n• आग में घसीटे जाते हैं\n\nआग के लिबास:\n• \"उनके लिए आग के लिबास काटे गए हैं।\" (क़ुरआन 22:19)\n• पिघले हुए तांबे के कपड़े\n• खाल मुसलसल जलती रहती है\n• कोई राहत या फ़रार नहीं\n\nजज़्बाती और नफ़सियाती अज़ाब:\n• अबदी अफ़सोस और नदामत\n• \"और वो उसमें चीखेंगे, 'ऐ हमारे रब, हमें निकाल दे; हम नेक अमल करेंगे।'\" (क़ुरआन 35:37)\n• जन्नत को देखना और जानना कि वो कभी दाख़िल नहीं हो सकते\n• साथियों और ख़ानदान के अफ़राद की तरफ़ से मलामत\n• मायूसी और नाउम्मीदी\n\nमुख़्तलिफ़ गुनाहों के लिए मुख़्तलिफ़ सज़ाएं:\n• ग़ीबत करने वाले: अपने भाइयों का गोश्त खाना\n• झूठे: आग की क़ैंचियों से होंठ और ज़बान काटना\n• सूद खाने वाले: शैतान की मारी हुई हालत में खड़े होना\n• ज़िनाकार: तंदूर जैसी भट्टी में\n• ज़कात न देने वाले: दौलत सांपों में बदल जाती है\n• ज़ालिम: खौलता पानी पीना\n• मुतकब्बिर: छोटी चींटियों की शक्ल में रौंदे जाना\n\nख़ास सज़ाएं:\n• फ़िरऔन और उसके पैरोकार सबसे बुरी सज़ा में\n• अबू लहब और उसकी बीवी - क़ुरआन में मख़सूस अज़ाब का ज़िक्र\n• मुनाफ़िक़ सबसे निचले दर्जे में सख़्त तरीन सज़ा के साथ\n\nजहन्नम के फ़रिश्ते (ज़बानिया):\n• 19 ताक़तवर फ़रिश्ते जहन्नम की हिफ़ाज़त करते हैं\n• इंतिहाई सख़्त और शदीद\n• कभी अल्लाह के हुक्मों की नाफ़रमानी नहीं करते\n• \"ऐ ईमान वालो! अपने आपको और अपने ख़ानदानों को उस आग से बचाओ जिसका ईंधन लोग और पत्थर हैं, जिस पर सख़्त और शदीद फ़रिश्ते मुक़र्रर हैं।\" (क़ुरआन 66:6)\n\nकोई राहत या फ़रार नहीं:\n• \"वो चाहेंगे कि आग से निकल जाएं, लेकिन वो कभी नहीं निकलेंगे, और उनके लिए दाइमी अज़ाब है।\" (क़ुरआन 5:37)\n• काफ़िरों के लिए सज़ा कभी कम नहीं होती\n• राहत के लिए कोई मौत या नींद नहीं\n• अबदी तकलीफ़",
        "ar": "عذاب النار\n\nأنواع العذاب في جهنم.\n\nالعذاب الجسدي:\n• \"كُلَّمَا نَضِجَتْ جُلُودُهُم بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا\" (سورة النساء: 56)\n• النار تحرق الجلود\n• تبديل الجلود لاستمرار العذاب\n• تأكل اللحم والعظام\n\nالسلاسل والأغلال:\n• \"إِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَ وَأَغْلَالًا وَسَعِيرًا\" (سورة الإنسان: 4)\n• يقيدون بالسلاسل والأغلال\n• سلسلة طولها سبعون ذراعاً\n• \"ثُمَّ فِي سِلْسِلَةٍ ذَرْعُهَا سَبْعُونَ ذِرَاعًا فَاسْلُكُوهُ\" (سورة الحاقة: 32)\n\nالحميم والغساق:\n• \"وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ\" (سورة محمد: 15)\n• الماء المغلي يقطع الأمعاء\n• الغساق: صديد أهل النار\n• يشوي الوجوه ويصهر البطون\n\nطعام الزقوم:\n• \"إِنَّ شَجَرَتَ الزَّقُّومِ * طَعَامُ الْأَثِيمِ\" (سورة الدخان: 43-44)\n• شجرة خبيثة في أصل الجحيم\n• طلعها كأنه رؤوس الشياطين\n• كالمهل يغلي في البطون\n\nالعذاب المعنوي:\n• الخزي والهوان\n• \"فَذُوقُوا فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا\" (سورة النبأ: 30)\n• الندم الشديد على ما فات\n• الحسرة واليأس\n• سماع الزفير والشهيق\n\nاستمرار العذاب:\n• \"وَالَّذِينَ كَفَرُوا لَهُمْ نَارُ جَهَنَّمَ\" (سورة فاطر: 36)\n• لا راحة ولا نوم\n• لا يموتون ولا يحيون\n• \"كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا\" (سورة الإسراء: 97)"
      }
    },
    {
      "step": 5,
      "title_key": "jahannam_fazilat_5_protection_from_hellfire",
      "title": {
        "en": "Protection from Hellfire",
        "ur": "جہنم سے حفاظت",
        "hi": "जहन्नम से हिफ़ाज़त",
        "ar": "الحماية من النار"
      },
      "icon": "circle",
      "color": "green",
      "details": {
        "en": "Protection from Hellfire\n\nAllah has provided numerous ways to protect ourselves from the punishment of Hell.\n\nFundamentals of Protection:\n• Sincere belief in Allah alone (Tawheed)\n• Belief in all prophets and the Last Prophet Muhammad ﷺ\n• Belief in the Day of Judgment\n• Following the teachings of Quran and Sunnah\n• The Prophet ﷺ said: \"Whoever says 'La ilaha illallah' sincerely from the heart will enter Paradise.\"\n\nThrough Prayer and Worship:\n• Establishing the five daily prayers on time\n• Praying with concentration (khushu)\n• Fasting in Ramadan properly\n• Giving Zakat and charity regularly\n• Performing Hajj when able\n• \"Indeed, good deeds do away with misdeeds.\" (Quran 11:114)\n\nThrough Dhikr and Duas:\n• Morning and evening adhkar for daily protection\n• Frequent seeking of forgiveness (Istighfar)\n• Saying \"SubhanAllah, Alhamdulillah, La ilaha illallah, Allahu Akbar\"\n• Dua: \"Allahumma ajirni min an-nar\" (O Allah, protect me from the Fire) - say 7 times after Fajr and Maghrib\n\nSpecific Protective Actions:\n• Praying Fajr and Asr in congregation - guarantee from Hellfire\n• Fasting on Day of Arafah - protection for two years\n• Fasting Mondays and Thursdays regularly\n• Reciting Ayat al-Kursi after every prayer\n• Last two verses of Surah Al-Baqarah at night\n• Teaching Quran to children\n\nThrough Good Character:\n• Being just and fair with everyone\n• Controlling anger and forgiving others\n• Being kind to parents - door to Paradise\n• Maintaining family ties\n• The Prophet ﷺ said: \"Good character is the heaviest thing on the scale.\"\n\nAvoiding Major Sins:\n• Stay away from shirk (associating partners with Allah)\n• Avoid interest/usury (riba)\n• Don't consume alcohol or drugs\n• Stay away from adultery and fornication\n• Don't oppress or harm others\n• Guard your tongue from backbiting and lying\n• Respect parents and maintain family ties\n\nSincere Repentance:\n• Repent immediately after any sin\n• Feel genuine remorse\n• Firm intention not to return to sin\n• Make amends if you wronged someone\n• Allah loves those who repent sincerely\n\nSeeking Knowledge:\n• Learn about Islam properly\n• Understand what pleases and displeases Allah\n• Know the major sins to avoid them\n• \"Whoever takes a path upon which to obtain knowledge, Allah makes the path to Paradise easy for him.\" (Muslim)\n\nProtection for Children:\n• Teach them Tawheed from young age\n• Make them love Allah and the Prophet ﷺ\n• Teach them to pray properly\n• Recite Quran to them and teach them\n• Make dua for their guidance\n• Be a good example\n\nThe Prophet's Guarantee:\n• The Prophet ﷺ said: \"Guarantee me six things and I will guarantee you Paradise: speak the truth, fulfill promises, return trusts, guard your chastity, lower your gaze, and restrain your hands from harm.\"\n\nConstant Dua:\n• \"Our Lord, give us in this world good and in the Hereafter good and protect us from the punishment of the Fire.\" (Quran 2:201)\n• Always ask Allah for protection from Hellfire in your daily duas",
        "ur": "جہنم سے حفاظت\n\nاللہ نے جہنم کی سزا سے اپنے آپ کو بچانے کے متعدد طریقے فراہم کیے ہیں۔\n\nحفاظت کی بنیادیں:\n• صرف اللہ پر مخلص عقیدہ (توحید)\n• تمام نبیوں اور آخری نبی محمد ﷺ پر ایمان\n• قیامت کے دن پر ایمان\n• قرآن اور سنت کی تعلیمات کی پیروی\n• نبی کریم ﷺ نے فرمایا: \"جو دل سے مخلصانہ 'لا الہ الا اللہ' کہے وہ جنت میں داخل ہوگا۔\"\n\nنماز اور عبادت کے ذریعے:\n• پانچ وقت کی نمازیں وقت پر قائم کرنا\n• خشوع کے ساتھ نماز پڑھنا\n• رمضان میں صحیح طریقے سے روزہ رکھنا\n• زکوٰۃ اور صدقہ باقاعدگی سے دینا\n• طاقت ہونے پر حج کرنا\n• \"بیشک نیکیاں برائیوں کو مٹا دیتی ہیں۔\" (قرآن 11:114)\n\nذکر اور دعاؤں کے ذریعے:\n• روزانہ حفاظت کے لیے صبح شام کے اذکار\n• کثرت سے استغفار\n• \"سبحان اللہ، الحمد للہ، لا الہ الا اللہ، اللہ اکبر\" کہنا\n• دعا: \"اللھم اجرنی من النار\" (اے اللہ، مجھے آگ سے بچا) - فجر اور مغرب کے بعد 7 بار کہیں\n\nمخصوص حفاظتی اعمال:\n• جماعت سے فجر اور عصر کی نماز - جہنم سے ضمانت\n• عرفہ کے دن روزہ - دو سال کی حفاظت\n• پیر اور جمعرات کو باقاعدگی سے روزہ\n• ہر نماز کے بعد آیت الکرسی پڑھنا\n• رات کو سورہ بقرہ کی آخری دو آیات\n• بچوں کو قرآن سکھانا\n\nاچھے اخلاق کے ذریعے:\n• سب کے ساتھ منصفانہ اور عادلانہ ہونا\n• غصے پر قابو اور دوسروں کو معاف کرنا\n• والدین کے ساتھ نیک سلوک - جنت کا دروازہ\n• رشتے برقرار رکھنا\n• نبی کریم ﷺ نے فرمایا: \"اچھا اخلاق میزان میں سب سے بھاری چیز ہے۔\"\n\nکبیرہ گناہوں سے بچنا:\n• شرک (اللہ کے ساتھ شریک ٹھہرانا) سے دور رہنا\n• سود سے بچنا\n• شراب یا منشیات استعمال نہ کرنا\n• زنا سے دور رہنا\n• دوسروں پر ظلم یا نقصان نہ پہنچانا\n• غیبت اور جھوٹ سے اپنی زبان کی حفاظت کرنا\n• والدین کا احترام اور رشتے برقرار رکھنا\n\nمخلصانہ توبہ:\n• کسی بھی گناہ کے بعد فوری توبہ کریں\n• حقیقی ندامت محسوس کریں\n• گناہ کی طرف نہ لوٹنے کا پختہ ارادہ\n• اگر کسی کا حق مارا ہو تو تلافی کریں\n• اللہ ان سے محبت کرتا ہے جو مخلصانہ توبہ کرتے ہیں\n\nعلم حاصل کرنا:\n• اسلام کو صحیح طریقے سے سیکھیں\n• جانیں کہ اللہ کو کیا پسند اور ناپسند ہے\n• کبیرہ گناہوں کو جانیں تاکہ ان سے بچ سکیں\n• \"جو علم حاصل کرنے کے لیے راستہ اختیار کرتا ہے، اللہ اس کے لیے جنت کا راستہ آسان کر دیتا ہے۔\" (مسلم)\n\nبچوں کی حفاظت:\n• انہیں چھوٹی عمر سے توحید سکھائیں\n• انہیں اللہ اور نبی ﷺ سے محبت کریں\n• انہیں صحیح طریقے سے نماز سکھائیں\n• انہیں قرآن سنائیں اور سکھائیں\n• ان کی ہدایت کے لیے دعا کریں\n• اچھی مثال بنیں\n\nنبی کریم ﷺ کی ضمانت:\n• نبی کریم ﷺ نے فرمایا: \"مجھے چھ چیزوں کی ضمانت دو اور میں تمہیں جنت کی ضمانت دوں گا: سچ بولو، وعدے پورے کرو، امانتیں لوٹاؤ، اپنی عفت کی حفاظت کرو، نظریں نیچی رکھو، اور اپنے ہاتھوں کو نقصان سے روکو۔\"\n\nمسلسل دعا:\n• \"اے ہمارے رب، ہمیں اس دنیا میں بھلائی دے اور آخرت میں بھلائی دے اور ہمیں آگ کے عذاب سے بچا۔\" (قرآن 2:201)\n• ہمیشہ اپنی روزانہ کی دعاؤں میں اللہ سے جہنم سے حفاظت مانگیں",
        "hi": "जहन्नम से हिफ़ाज़त\n\nअल्लाह ने जहन्नम की सज़ा से अपने आपको बचाने के मुतअद्दिद तरीक़े फ़राहम किए हैं।\n\nहिफ़ाज़त की बुनियादें:\n• सिर्फ़ अल्लाह पर मुख़्लिस अक़ीदा (तौहीद)\n• तमाम नबियों और आख़िरी नबी मुहम्मद ﷺ पर ईमान\n• क़यामत के दिन पर ईमान\n• क़ुरआन और सुन्नत की तालीमात की पैरवी\n• नबी करीम ﷺ ने फ़रमाया: \"जो दिल से मुख़्लिसाना 'ला इलाहा इल्लल्लाह' कहे वो जन्नत में दाख़िल होगा।\"\n\nनमाज़ और इबादत के ज़रिए:\n• पांच वक़्त की नमाज़ें वक़्त पर क़ायम करना\n• ख़ुशू के साथ नमाज़ पढ़ना\n• रमज़ान में सही तरीक़े से रोज़ा रखना\n• ज़कात और सदक़ा बाक़ायदगी से देना\n• ताक़त होने पर हज करना\n• \"बेशक नेकियां बुराइयों को मिटा देती हैं।\" (क़ुरआन 11:114)\n\nज़िक्र और दुआओं के ज़रिए:\n• रोज़ाना हिफ़ाज़त के लिए सुबह शाम के अज़कार\n• कसरत से इस्तिग़फ़ार\n• \"सुब्हानल्लाह, अलहम्दुलिल्लाह, ला इलाहा इल्लल्लाह, अल्लाहु अकबर\" कहना\n• दुआ: \"अल्लाहुम्म अजिरनी मिनन्नार\" (ऐ अल्लाह, मुझे आग से बचा) - फ़ज्र और मग़रिब के बाद 7 बार कहें\n\nमख़सूस हिफ़ाज़ती आमाल:\n• जमाअत से फ़ज्र और अस्र की नमाज़ - जहन्नम से ज़मानत\n• अरफ़ा के दिन रोज़ा - दो साल की हिफ़ाज़त\n• पीर और जुमेरात को बाक़ायदगी से रोज़ा\n• हर नमाज़ के बाद आयतुल कुर्सी पढ़ना\n• रात को सूरा बक़रा की आख़िरी दो आयतें\n• बच्चों को क़ुरआन सिखाना\n\nअच्छे अख़्लाक़ के ज़रिए:\n• सबके साथ मुंसिफ़ाना और आदिलाना होना\n• ग़ुस्से पर क़ाबू और दूसरों को माफ़ करना\n• वालिदैन के साथ नेक सुलूक - जन्नत का दरवाज़ा\n• रिश्ते बरक़रार रखना\n• नबी करीम ﷺ ने फ़रमाया: \"अच्छा अख़्लाक़ मीज़ान में सबसे भारी चीज़ है।\"\n\nकबीरा गुनाहों से बचना:\n• शिर्क (अल्लाह के साथ शरीक ठहराना) से दूर रहना\n• सूद से बचना\n• शराब या मुनश्शियात इस्तेमाल न करना\n• ज़िना से दूर रहना\n• दूसरों पर ज़ुल्म या नुक़सान न पहुंचाना\n• ग़ीबत और झूठ से अपनी ज़बान की हिफ़ाज़त करना\n• वालिदैन का एहतेराम और रिश्ते बरक़रार रखना\n\nमुख़्लिसाना तौबा:\n• किसी भी गुनाह के बाद फ़ौरन तौबा करें\n• हक़ीक़ी नदामत महसूस करें\n• गुनाह की तरफ़ न लौटने का पुख़्ता इरादा\n• अगर किसी का हक़ मारा हो तो तलाफ़ी करें\n• अल्लाह उनसे मोहब्बत करता है जो मुख़्लिसाना तौबा करते हैं\n\nइल्म हासिल करना:\n• इस्लाम को सही तरीक़े से सीखें\n• जानें कि अल्लाह को क्या पसंद और नापसंद है\n• कबीरा गुनाहों को जानें ताकि उनसे बच सकें\n• \"जो इल्म हासिल करने के लिए रास्ता इख़्तियार करता है, अल्लाह उसके लिए जन्नत का रास्ता आसान कर देता है।\" (मुस्लिम)\n\nबच्चों की हिफ़ाज़त:\n• उन्हें छोटी उम्र से तौहीद सिखाएं\n• उन्हें अल्लाह और नबी ﷺ से मोहब्बत करें\n• उन्हें सही तरीक़े से नमाज़ सिखाएं\n• उन्हें क़ुरआन सुनाएं और सिखाएं\n• उनकी हिदायत के लिए दुआ करें\n• अच्छी मिसाल बनें\n\nनबी करीम ﷺ की ज़मानत:\n• नबी करीम ﷺ ने फ़रमाया: \"मुझे छह चीज़ों की ज़मानत दो और मैं तुम्हें जन्नत की ज़मानत दूंगा: सच बोलो, वादे पूरे करो, अमानतें लौटाओ, अपनी इफ़्फ़त की हिफ़ाज़त करो, निगाहें नीची रखो, और अपने हाथों को नुक़सान से रोको।\"\n\nमुसलसल दुआ:\n• \"ऐ हमारे रब, हमें इस दुनिया में भलाई दे और आख़िरत में भलाई दे और हमें आग के अज़ाब से बचा।\" (क़ुरआन 2:201)\n• हमेशा अपनी रोज़ाना की दुआओं में अल्लाह से जहन्नम से हिफ़ाज़त मांगें",
        "ar": "الحماية من النار\n\nكيفية الوقاية من عذاب جهنم.\n\nالتوحيد والإيمان:\n• \"إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ\" (سورة النساء: 48)\n• الإيمان بالله ورسوله\n• إخلاص العبادة لله وحده\n• البعد عن الشرك بجميع أنواعه\n\nالتقوى:\n• \"يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنفُسَكُمْ وَأَهْلِيكُمْ نَارًا\" (سورة التحريم: 6)\n• اتقاء الله في السر والعلن\n• المحافظة على الصلوات\n• اجتناب الكبائر\n\nالأعمال الصالحة:\n• قال النبي ﷺ: \"اتقوا النار ولو بشق تمرة\" (البخاري)\n• الصدقة تطفئ الخطيئة\n• الصيام جنة من النار\n• قيام الليل والاستغفار بالأسحار\n\nالتوبة والاستغفار:\n• \"وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ\" (سورة النور: 31)\n• التوبة النصوح من الذنوب\n• كثرة الاستغفار\n• الندم على المعاصي والعزم على عدم العودة\n\nبر الوالدين:\n• من أعظم أسباب النجاة من النار\n• الإحسان إليهما في حياتهما\n• الدعاء لهما بعد موتهما\n• طاعتهما في المعروف\n\nصلة الرحم:\n• قال النبي ﷺ: \"من سره أن يبسط له في رزقه فليصل رحمه\" (البخاري)\n• زيارة الأقارب والإحسان إليهم\n• تجنب القطيعة والخصام\n\nالدعاء:\n• \"رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ\" (سورة الفرقان: 65)\n• اللهم أجرني من النار\n• اللهم إني أعوذ بك من النار\n• الإكثار من الدعاء والتضرع"
      }
    },
    {
      "step": 6,
      "title_key": "jahannam_fazilat_6_warnings_in_quran_hadith",
      "title": {
        "en": "Warnings in Quran & Hadith",
        "ur": "قرآن و حدیث میں تنبیہات",
        "hi": "क़ुरआन व हदीस में तंबीहात",
        "ar": "التحذيرات من النار"
      },
      "icon": "warning_amber",
      "color": "amber",
      "details": {
        "en": "Warnings in Quran & Hadith\n\nAllah and His Messenger ﷺ have given us clear warnings about Hellfire.\n\nDirect Quranic Warnings:\n• \"O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones.\" (Quran 66:6)\n• \"And fear the Fire, which has been prepared for the disbelievers.\" (Quran 3:131)\n• \"So fear the Fire, whose fuel is men and stones, prepared for the disbelievers.\" (Quran 2:24)\n• \"Indeed, those who disbelieve in Our verses - We will drive them into a Fire.\" (Quran 4:56)\n\nAbout Its Eternal Nature:\n• \"They will wish to get out of the Fire, but never are they to emerge from it, and for them is an enduring punishment.\" (Quran 5:37)\n• \"Abiding eternally therein. They will not find a protector or a helper.\" (Quran 33:65)\n• \"Indeed, whoever comes to his Lord as a criminal - indeed, for him is Hell; he will neither die therein nor live.\" (Quran 20:74)\n\nThe Prophet's Tears:\n• The Prophet ﷺ wept when thinking about Hellfire\n• He ﷺ said: \"If you knew what I know, you would laugh little and weep much.\" (Bukhari)\n• He used to seek refuge from Hellfire frequently\n• His concern for his Ummah to be saved from it\n\nWarning About Small Sins:\n• \"So whoever does an atom's weight of evil shall see it.\" (Quran 99:8)\n• The Prophet ﷺ said: \"Beware of the minor sins, for they will pile up until they destroy a person.\"\n• Small sins accumulate like drops filling a bucket\n\nWarning Against Arrogance:\n• \"Indeed, those who dispute concerning the signs of Allah without authority having come to them - there is not within their breasts except pride.\" (Quran 40:56)\n• The Prophet ﷺ said: \"No one who has an atom's worth of pride in his heart will enter Paradise.\" (Muslim)\n\nWarning About Wealth:\n• \"And let not those who withhold what Allah has given them think it is better for them. Rather, it is worse for them. Their necks will be encircled by what they withheld on the Day of Resurrection.\" (Quran 3:180)\n• Hoarding wealth and not giving rights leads to punishment\n\nWarning About the Tongue:\n• The Prophet ﷺ said: \"Indeed a servant might speak a word that he thinks is harmless, but he will fall into the Fire because of it as far as the Pleiades.\" (Bukhari)\n• Most people enter Hell because of their tongues\n\nWarning to Those Who Wrong Others:\n• The Prophet ﷺ said: \"Whoever has wronged his brother with regard to his honor or anything else, let him seek his forgiveness today, before there will be no dirham and no dinar.\" (Bukhari)\n• On Day of Judgment, good deeds will transfer to the wronged\n\nWarning About Hypocrisy:\n• \"Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper.\" (Quran 4:145)\n• Showing off in worship nullifies it\n• Pretending to be Muslim while disbelieving inside\n\nThe Prophet's Concern:\n• The Prophet ﷺ saw Hell and it terrified him\n• He saw the majority of its inhabitants were women (for specific sins)\n• He warned against specific sins that lead to Hell\n• He ﷺ said: \"I am to you like a father warning his son from fire.\"\n\nWarning About Following Desires:\n• \"Have you seen he who has taken as his god his own desire?\" (Quran 25:43)\n• Following desires without restraint leads to destruction\n• The Prophet ﷺ said: \"Paradise is surrounded by hardships and Hell is surrounded by desires.\"\n\nFinal Warnings:\n• \"So today We will forget them just as they forgot the meeting of this Day of theirs and for having rejected Our verses.\" (Quran 7:51)\n• No excuse will be accepted on the Day of Judgment\n• Every soul is responsible for its own deeds\n• Death can come suddenly - repent now\n\nThe Wise Take Heed:\n• These warnings are out of Allah's mercy\n• They give us opportunity to change and repent\n• \"Indeed, in that is a reminder for whoever has a heart.\" (Quran 50:37)\n• Take action today before it's too late",
        "ur": "قرآن و حدیث میں تنبیہات\n\nاللہ اور اس کے رسول ﷺ نے ہمیں جہنم کے بارے میں واضح تنبیہات دی ہیں۔\n\nبراہ راست قرآنی تنبیہات:\n• \"اے ایمان والو! اپنے آپ کو اور اپنے خاندانوں کو اس آگ سے بچاؤ جس کا ایندھن لوگ اور پتھر ہیں۔\" (قرآن 66:6)\n• \"اور اس آگ سے ڈرو جو کافروں کے لیے تیار کی گئی ہے۔\" (قرآن 3:131)\n• \"تو اس آگ سے ڈرو جس کا ایندھن آدمی اور پتھر ہیں، کافروں کے لیے تیار کی گئی ہے۔\" (قرآن 2:24)\n• \"بیشک جو ہماری آیات کا انکار کرتے ہیں - ہم انہیں آگ میں داخل کریں گے۔\" (قرآن 4:56)\n\nاس کی ابدی نوعیت کے بارے میں:\n• \"وہ چاہیں گے کہ آگ سے نکل جائیں، لیکن وہ کبھی نہیں نکلیں گے، اور ان کے لیے دائمی عذاب ہے۔\" (قرآن 5:37)\n• \"اس میں ہمیشہ رہنے والے۔ وہ نہ کوئی مح��فظ پائیں گے نہ کوئی مددگار۔\" (قرآن 33:65)\n• \"بیشک جو اپنے رب کے پاس مجرم ہو کر آئے گا - اس کے لیے جہنم ہے؛ وہ اس میں نہ مرے گا نہ جیے گا۔\" (قرآن 20:74)\n\nنبی کریم ﷺ کے آنسو:\n• نبی کریم ﷺ جہنم کے بارے میں سوچتے ہوئے روتے تھے\n• آپ ﷺ نے فرمایا: \"اگر تم جانتے ہو جو میں جانتا ہوں، تو تم کم ہنستے اور زیادہ روتے۔\" (بخاری)\n• آپ کثرت سے جہنم سے پناہ مانگتے تھے\n• اپنی امت کو اس سے بچانے کی فکر\n\nچھوٹے گناہوں کی تنبیہ:\n• \"تو جو ذرہ برابر برائی کرے گا وہ دیکھے گا۔\" (قرآن 99:8)\n• نبی کریم ﷺ نے فرمایا: \"چھوٹے گناہوں سے بچو، کیونکہ وہ جمع ہو کر انسان کو تباہ کر دیتے ہیں۔\"\n• چھوٹے گناہ جمع ہوتے ہیں جیسے قطرے بالٹی بھرتے ہیں\n\nتکبر کے خلاف تنبیہ:\n• \"بیشک جو اللہ کی آیات کے بارے میں بغیر کسی دلیل کے جھگڑتے ہیں - ان کے سینوں میں تکبر کے سوا کچھ نہیں۔\" (قرآن 40:56)\n• نبی کریم ﷺ نے فرمایا: \"جس کے دل میں ذرہ برابر تکبر ہو وہ جنت میں داخل نہیں ہوگا۔\" (مسلم)\n\nدولت کے بارے میں تنبیہ:\n• \"اور جو لوگ اللہ نے انہیں دیا ہے اس میں بخل کرتے ہیں یہ نہ سمجھیں کہ یہ ان کے لیے بہتر ہے۔ بلکہ یہ ان کے لیے بُرا ہے۔ قیامت کے دن جس میں انہوں نے بخل کیا وہ ان کی گردنوں میں طوق بن جائے گا۔\" (قرآن 3:180)\n• دولت جمع کرنا اور حقوق نہ دینا سزا کا باعث ہے\n\nزبان کے بارے میں تنبیہ:\n• نبی کریم ﷺ نے فرمایا: \"بیشک ایک بندہ ایک لفظ بولتا ہے جسے وہ بے ضرر سمجھتا ہے، لیکن اس کی وجہ سے وہ آگ میں ثریا جتنا گرے گا۔\" (بخاری)\n• زیادہ تر لوگ اپنی زبانوں کی وجہ سے جہنم میں جاتے ہیں\n\nدوسروں پر ظلم کرنے والوں کو تنبیہ:\n• نبی کریم ﷺ نے فرمایا: \"جس نے اپنے بھائی پر اس کی عزت یا کسی اور چیز میں ظلم کیا ہو، وہ آج اس سے معافی مانگ لے، اس سے پہلے کہ کوئی درہم یا دینار نہ ہو۔\" (بخاری)\n• قیامت کے دن نیکیاں مظلوم کو منتقل ہو جائیں گی\n\nنفاق کے بارے میں تنبیہ:\n• \"بیشک منافق جہنم کی سب سے نچلی تہہ میں ہوں گے - اور تم ان کے لیے کوئی مددگار نہیں پاؤ گے۔\" (قرآن 4:145)\n• عبادت میں دکھاوا اسے ختم کر دیتا ہے\n• اندر سے کافر ہوتے ہوئے مسلمان ہونے کا دکھاوا کرنا\n\nنبی کریم ﷺ کی فکر:\n• نبی کریم ﷺ نے جہنم دیکھی اور یہ آپ کو خوفزدہ کر گئی\n• آپ نے دیکھا اس کے زیادہ تر باشندے خواتین تھیں (مخصوص گناہوں کے لیے)\n• آپ نے ان مخصوص گناہوں سے خبردار کیا جو جہنم کی طرف لے جاتے ہیں\n• آپ ﷺ نے فرمایا: \"میں تمہارے لیے ایسے باپ کی طرح ہوں جو اپنے بیٹے کو آگ سے خبردار کرتا ہے۔\"\n\nخواہشات کی پیروی کے بارے میں تنبیہ:\n• \"کیا تم نے اسے دیکھا جس نے اپنی خواہش کو اپنا معبود بنا لیا؟\" (قرآن 25:43)\n• بغیر روک ٹوک خواہشات کی پیروی تباہی کی طرف لے جاتی ہے\n• نبی کریم ﷺ نے فرمایا: \"جنت مشکلات سے گھری ہے اور جہنم خواہشات سے گھری ہے۔\"\n\nآخری تنبیہات:\n• \"تو آج ہم انہیں بھول جائیں گے جیسے انہوں نے اپنے اس دن کی ملاقات کو بھلا دیا تھا اور ہماری آیات کو جھٹلایا تھا۔\" (قرآن 7:51)\n• قیامت کے دن کوئی عذر قبول نہیں ہوگا\n• ہر جان اپنے اعمال کی ذمہ دار ہے\n• موت اچانک آ سکتی ہے - ابھی توبہ کریں\n\nعقلمند نصیحت لیتے ہیں:\n• یہ تنبیہات اللہ کی رحمت سے ہیں\n• یہ ہمیں بدلنے اور توبہ کرنے کا موقع دیتی ہیں\n• \"بیشک اس میں یاد دہانی ہے ہر اس شخص کے لیے جس کے پاس دل ہو۔\" (قرآن 50:37)\n• بہت دیر ہونے سے پہلے آج عمل کریں",
        "hi": "क़ुरआन व हदीस में तंबीहात\n\nअल्लाह और उसके रसूल ﷺ ने हमें जहन्नम के बारे में वाज़ेह तंबीहात दी हैं।\n\nबराहे रास्त क़ुरआनी तंबीहात:\n• \"ऐ ईमान वालो! अपने आपको और अपने ख़ानदानों को उस आग से बचाओ जिसका ईंधन लोग और पत्थर हैं।\" (क़ुरआन 66:6)\n• \"और उस आग से डरो जो काफ़िरों के लिए तैयार की गई है।\" (क़ुरआन 3:131)\n• \"तो उस आग से डरो जिसका ईंधन आदमी और पत्थर हैं, काफ़िरों के लिए तैयार की गई है।\" (क़ुरआन 2:24)\n• \"बेशक जो हमारी आयात का इंकार करते हैं - हम उन्हें आग में दाख़िल करेंगे।\" (क़ुरआन 4:56)\n\nइसकी अबदी नौइयत के बारे में:\n• \"वो चाहेंगे कि आग से निकल जाएं, लेकिन वो कभी नहीं निकलेंगे, और उनके लिए दाइमी अज़ाब है।\" (क़ुरआन 5:37)\n• \"उसमें हमेशा रहने वाले। वो न कोई मुहाफ़िज़ पाएंगे न कोई मददगार।\" (क़ुरआन 33:65)\n• \"बेशक जो अपने रब के पास मुजरिम होकर आएगा - उसके लिए जहन्नम है; वो उसमें न मरेगा न जिएगा।\" (क़ुरआन 20:74)\n\nनबी करीम ﷺ के आंसू:\n• नबी करीम ﷺ जहन्नम के बारे में सोचते हुए रोते थे\n• आप ﷺ ने फ़रमाया: \"अगर तुम जानते हो जो मैं जानता हूं, तो तुम कम हंसते और ज़्यादा रोते।\" (बुख़ारी)\n• आप कसरत से जहन्नम से पनाह मांगते थे\n• अपनी उम्मत को इससे बचाने की फ़िक्र\n\nछोटे गुनाहों की तंबीह:\n• \"तो जो ज़र्रा बराबर बुराई करेगा वो देखेगा।\" (क़ुरआन 99:8)\n• नबी करीम ﷺ ने फ़रमाया: \"छोटे गुनाहों से बचो, क्योंकि वो जमा होकर इंसान को तबाह कर देते हैं।\"\n• छोटे गुनाह जमा होते हैं जैसे क़तरे बाल्टी भर���े हैं\n\nतकब्बुर के ख़िलाफ़ तंबीह:\n• \"बेशक जो अल्लाह की आयात के बारे में बग़ैर किसी दलील के झगड़ते हैं - उनके सीनों में तकब्बुर के सिवा कुछ नहीं।\" (क़ुरआन 40:56)\n• नबी करीम ﷺ ने फ़रमाया: \"जिसके दिल में ज़र्रा बराबर तकब्बुर हो वो जन्नत में दाख़िल नहीं होगा।\" (मुस्लिम)\n\nदौलत के बारे में तंबीह:\n• \"और जो लोग अल्लाह ने उन्हें दिया है उसमें बुख़्ल करते हैं यह न समझें कि यह उनके लिए बेहतर है। बल्कि यह उनके लिए बुरा है। क़यामत के दिन जिसमें उन्होंने बुख़्ल किया वो उनकी गर्दनों में तौक़ बन जाएगा।\" (क़ुरआन 3:180)\n• दौलत जमा करना और हुक़ूक़ न देना सज़ा का बाइस है\n\nज़बान के बारे में तंबीह:\n• नबी करीम ﷺ ने फ़रमाया: \"बेशक एक बंदा एक लफ़्ज़ बोलता है जिसे वो बेज़रर समझता है, लेकिन उसकी वजह से वो आग में सुरय्या जितना गिरेगा।\" (बुख़ारी)\n• ज़्यादातर लोग अपनी ज़बानों की वजह से जहन्नम में जाते हैं\n\nदूसरों पर ज़ुल्म करने वालों को तंबीह:\n• नबी करीम ﷺ ने फ़रमाया: \"जिसने अपने भाई पर उसकी इज़्ज़त या किसी और चीज़ में ज़ुल्म किया हो, वो आज उससे माफ़ी मांग ले, इससे पहले कि कोई दिरहम या दीनार न हो।\" (बुख़ारी)\n• क़यामत के दिन नेकियां मज़लूम को मुंतक़िल हो जाएंगी\n\nनिफ़ाक़ के बारे में तंबीह:\n• \"बेशक मुनाफ़िक़ जहन्नम की सबसे निचली तह में होंगे - और तुम उनके लिए कोई मददगार नहीं पाओगे।\" (क़ुरआन 4:145)\n• इबादत में दिखावा उसे ख़त्म कर देता है\n• अंदर से काफ़िर होते हुए मुसलमान होने का दिखावा करना\n\nनबी करीम ﷺ की फ़िक्र:\n• नबी करीम ﷺ ने जहन्नम देखी और यह आपको ख़ौफ़ज़दा कर गई\n• आपने देखा इसके ज़्यादातर बाशिंदे ख़वातीन थीं (मख़सूस गुनाहों के लिए)\n• आपने उन मख़सूस गुनाहों से ख़बरदार किया जो जहन्नम की तरफ़ ले जाते हैं\n• आप ﷺ ने फ़रमाया: \"मैं तुम्हारे लिए ऐसे बाप की तरह हूं जो अपने बेटे को आग से ख़बरदार करता है।\"\n\nख़्वाहिशात की पैरवी के बारे में तंबीह:\n• \"क्या तुमने उसे देखा जिसने अपनी ख़्वाहिश को अपना माबूद बना लिया?\" (क़ुरआन 25:43)\n• बग़ैर रोक टोक ख़्वाहिशात की पैरवी तबाही की तरफ़ ले जाती है\n• नबी करीम ﷺ ने फ़रमाया: \"जन्नत मुश्किलात से घिरी है और जहन्नम ख़्वाहिशात से घिरी है।\"\n\nआख़िरी तंबीहात:\n• \"तो आज हम उन्हें भूल जाएंगे जैसे उन्होंने अपने इस दिन की मुलाक़ात को भुला दिया था और हमारी आयात को झुठलाया था।\" (क़ुरआन 7:51)\n• क़यामत के दिन कोई उज़्र क़बूल नहीं होगा\n• हर जान अपने आमाल की ज़िम्मेदार है\n• मौत अचानक आ सकती है - अभी तौबा करें\n\nअक़्लमंद नसीहत लेते हैं:\n• यह तंबीहात अल्लाह की रहमत से हैं\n• यह हमें बदलने और तौबा करने का मौक़ा देती हैं\n• \"बेशक इसमें याददिहानी है हर उस शख़्स के लिए जिसके पास दिल हो।\" (क़ुरआन 50:37)\n• बहुत देर होने से पहले आज अमल करें",
        "ar": "التحذيرات من النار\n\nتحذيرات القرآن والسنة من جهنم.\n\nتحذيرات القرآن:\n• \"فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ\" (سورة البقرة: 24)\n• \"إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا\" (سورة النبأ: 21)\n• \"وَإِن مِّنكُمْ إِلَّا وَارِدُهَا\" (سورة مريم: 71)\n• \"كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ\" (سورة آل عمران: 185)\n\nتحذير النبي ﷺ:\n• قال ﷺ: \"اتقوا النار ولو بشق تمرة\" (البخاري)\n• \"بعثت أنا والساعة كهاتين\" (البخاري)\n• \"النار النار\" خطب بها النبي وأحمرت وجنتاه\n• حذر من الذنوب الموبقات\n\nوصف عذاب القبر:\n• القبر أول منازل الآخرة\n• \"إِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَا أَصْحَابَ الْجَنَّةِ\" (سورة القلم: 17)\n• فتنة القبر وعذابه\n• ضمة القبر للمؤمن والكافر\n\nأهوال يوم القيامة:\n• \"يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ\" (سورة الحج: 2)\n• الحساب والميزان\n• الصراط فوق جهنم\n• \"وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُّقَرَّنِينَ فِي الْأَصْفَادِ\" (سورة إبراهيم: 49)\n\nالاعتبار بحال الأمم:\n• \"أَلَمْ يَأْتِهِمْ نَبَأُ الَّذِينَ مِن قَبْلِهِمْ\" (سورة التوبة: 70)\n• قوم نوح وعاد وثمود\n• قوم لوط وأصحاب الأيكة\n• فرعون وقارون\n\nالندم يوم القيامة:\n• \"وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَىٰ يَدَيْهِ\" (سورة الفرقان: 27)\n• \"يَا وَيْلَتَىٰ لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا\" (سورة الفرقان: 28)\n• لا ينفع الندم حينئذ\n• الحسرة على ما فات\n\nالعمل قبل الموت:\n• \"مِن قَبْلِ أَن يَأْتِيَ أَحَدَكُمُ الْمَوْتُ\" (سورة المنافقون: 10)\n• المبادرة إلى التوبة\n• الإكثار من الأعمال الصالحة\n• تذكر الموت والآخرة"
      }
    }
  ]
}