{
  "title": {
    "en": "Rights of Relatives",
    "ur": "رشتہ داروں کے حقوق",
    "hi": "रिश्तेदारों के हुक़ूक़",
    "ar": "حقوق الأقارب"
  },
  "icon": "people",
  "steps": [
    {
      "step": 1,
      "title_key": "relative_fazilat_1_importance_of_silat_arrahm",
      "title": {
        "en": "Importance of Silat ar-Rahm",
        "ur": "صلہ رحمی کی اہمیت",
        "hi": "सिला रहमी की अहमियत",
        "ar": "أهمية صلة الرحم"
      },
      "icon": "connect_without_contact",
      "color": "green",
      "details": {
        "en": "Importance of Silat ar-Rahm (Maintaining Family Ties)\n\nSilat ar-Rahm (maintaining family ties) is one of the most emphasized and rewarded acts of worship in Islam. It is so fundamental that Allah has joined it with His own name and made it obligatory upon every Muslim. The Arabic term \"ar-Rahm\" literally means \"the womb,\" signifying the blood ties that connect family members, and \"Silat\" means connection or joining.\n\nThe Supreme Command of Allah:\n\nAllah commands in the Quran: \"And fear Allah through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer.\" (Quran 4:1)\n\nThis verse establishes that maintaining family ties is not merely a social custom but a religious obligation. Allah watches how we treat our relatives and will hold us accountable.\n\n\"Worship Allah and associate nothing with Him, and to parents do good, and to relatives, orphans, the needy, the near neighbor, the neighbor farther away...\" (Quran 4:36)\n\nAllah places kindness to relatives immediately after the command to worship Him alone, showing its supreme importance.\n\nWhat Exactly is Silat ar-Rahm?\n\nSilat ar-Rahm encompasses:\n\n1. Emotional Connection:\n• Showing genuine love and affection to relatives\n• Caring about their wellbeing\n• Feeling joy at their happiness and sadness at their pain\n• Maintaining warm relationships\n\n2. Physical Presence:\n• Regular visits and face-to-face interaction\n• Attending family gatherings and celebrations\n• Being present during times of need\n• Not abandoning them despite distance\n\n3. Financial Support:\n• Helping poor relatives with money and resources\n• Sharing wealth during difficult times\n• Giving priority to needy relatives over strangers\n• The Prophet ﷺ said: \"Charity to the poor is charity, and charity to a relative is two things: charity and upholding the ties of kinship.\" (Tirmidhi)\n\n4. Communication:\n• Calling, messaging, and staying in touch\n• Checking on their health and circumstances\n• Sharing news and important events\n• Using modern technology to bridge distances\n\n5. Emotional and Practical Support:\n• Helping during illness or hardship\n• Providing advice and guidance\n• Mediating in conflicts\n• Standing up for them when needed\n\n6. Respect and Honor:\n• Speaking well of them\n• Defending their reputation\n• Showing respect, especially to elders\n• Avoiding gossip or backbiting about family\n\nWho Are Considered Your Relatives (Rahim)?\n\nIslam defines relatives broadly:\n\n1. Close Relatives (Mahram):\n• Parents, grandparents, great-grandparents\n• Children, grandchildren, great-grandchildren\n• Siblings (full, half, and foster)\n• Uncles and aunts (both paternal and maternal)\n• Nephews and nieces\n\n2. Extended Relatives:\n• Cousins (all degrees)\n• Great uncles and great aunts\n• Second cousins and beyond\n• All those connected by blood\n• In-laws also deserve kindness and respect\n\nThe Prophet ﷺ was asked: \"Who are most entitled to my good companionship?\" He said: \"Your mother.\" The man asked: \"Then who?\" He said: \"Your mother.\" The man asked: \"Then who?\" He said: \"Your mother.\" The man asked: \"Then who?\" He said: \"Your father, then your nearest relatives according to the order of closeness.\" (Bukhari & Muslim)\n\nImmense Rewards of Maintaining Family Ties:\n\n1. Increased Lifespan:\nThe Prophet ﷺ said: \"Whoever would like his provision to be increased and his lifespan to be extended should maintain family ties.\" (Bukhari & Muslim)\n\nThis doesn't necessarily mean living more years, but also means:\n• Barakah (blessing) in time\n• Productive and meaningful life\n• Remembrance after death\n• Legacy through righteous children\n\n2. Increased Provision (Rizq):\n• Allah blesses the wealth of those who maintain ties\n• Business prospers\n• Income increases\n• Resources are sufficient\n• Money is spent in beneficial ways\n\n3. Entry to Paradise:\nThe Prophet ﷺ said: \"The one who perfectly maintains the ties of kinship is not the one who does it because he gets reciprocated by his relatives, but the one who truly maintains the bonds is the one who, when his relatives cut him off, he keeps on maintaining the ties of kinship with them.\" (Bukhari)\n\nMaintaining ties even when relatives are difficult earns the highest reward and entry to Jannah.\n\n4. Protection from Calamities:\n• Protects from sudden death\n• Shields from misfortunes\n• Brings Allah's mercy upon the person\n• Easier death and good end\n\n5. Quick Acceptance of Prayers:\n• Duas are answered faster\n• Supplications are not rejected\n• Allah's mercy descends\n• The Prophet ﷺ said: \"Ar-Rahm (the womb/family ties) is suspended from the Throne and says: 'Whoever keeps me, Allah will keep him, and whoever severs me, Allah will sever him.'\" (Bukhari & Muslim)\n\n6. Love and Mercy from Allah:\n\"The merciful will be shown mercy by the Most Merciful. Be merciful to those on earth and the One above the heavens will have mercy upon you.\" (Tirmidhi)\n\n7. Removal of Sins:\nMaintaining ties despite difficulties expiates sins and raises one's status in Paradise.\n\nSevere Punishment for Breaking Family Ties:\n\nBreaking family ties (Qat ar-Rahm) is among the major sins in Islam:\n\n1. Barrier to Paradise:\nThe Prophet ﷺ said: \"The one who severs the ties of kinship will not enter Paradise.\" (Bukhari & Muslim)\n\nThis means entry will be delayed until purification or may be denied entirely without sincere repentance.\n\n2. Quick Punishment in This World:\nThe Prophet ﷺ said: \"There is no sin more deserving of having the punishment hastened in this world, in addition to what is stored up for the perpetrator in the Hereafter, than oppression and severing the ties of kinship.\" (Abu Dawud & Tirmidhi)\n\nThis includes:\n• Loss of barakah in wealth and time\n• Family problems and conflicts\n• Difficulty in life affairs\n• Children who disobey\n• Hardship and stress\n\n3. Prayers Not Accepted:\nWhen family ties are severed, prayers and duas are not answered. Allah's mercy is withheld from those who show no mercy to relatives.\n\n4. Allah Severs His Connection:\nJust as one severs ties with family, Allah severs His mercy and blessings from that person.\n\n5. Curse and Deafness:\n\"Would you then, if you were given authority, cause corruption on earth and sever your ties of kinship? Those are the ones that Allah has cursed, so He deafened them and blinded their vision.\" (Quran 47:22-23)\n\n10 Practical Ways to Maintain Family Ties:\n\n1. Regular Visits:\n• Visit relatives frequently, not just on special occasions\n• Don't wait for them to visit first\n• Make time despite busy schedules\n• Visit especially during illness or hardship\n• The Prophet ﷺ would visit his relatives regularly\n\n2. Phone Calls and Messages:\n• Call to check on their wellbeing\n• Message on special occasions\n• Use video calls if living far\n• Share good news and important updates\n• Modern technology makes it easy - no excuses!\n\n3. Gifts and Presents:\n• The Prophet ﷺ said: \"Give gifts and you will love one another.\" (Bukhari)\n• Remember birthdays, Eid, weddings\n• Give without expecting anything in return\n• Gifts strengthen bonds and remove resentment\n\n4. Financial Help:\n• Support poor relatives before helping strangers\n• Give charity to family members in need\n• Help with education, medical expenses, etc.\n• Do it with dignity and respect\n\n5. Attend Family Gatherings:\n• Weddings, funerals, celebrations\n• Be present during important events\n• Organize family reunions\n• Create opportunities for family bonding\n\n6. Make Dua for Them:\n• Pray for their health, wealth, and guidance\n• Make dua by name for each relative\n• Supplication for family is always answered\n• The Prophet ﷺ would make dua for his family\n\n7. Forgive and Overlook:\n• Don't hold grudges\n• Forgive mistakes and shortcomings\n• Overlook minor issues\n• Be the bigger person\n• \"And let them pardon and overlook. Would you not like that Allah should forgive you?\" (Quran 24:22)\n\n8. Help in Times of Need:\n• Be there during illness, death, financial crisis\n• Provide practical support\n• Emotional comfort and encouragement\n• Stand up for them when wronged\n\n9. Mediate in Conflicts:\n• Bring feuding relatives together\n• Act as peacemaker\n• Don't fuel disputes\n• Seek reconciliation\n• Making peace between relatives is a great act of worship\n\n10. Speak Well of Them:\n• Mention their good qualities\n• Defend their honor in their absence\n• Don't gossip or backbite\n• Protect family reputation\n\nSpecial Cases: What If Relatives Are Difficult?\n\n1. If They Wrong You:\n• Still maintain ties from your side\n• The Prophet ﷺ said: \"The one who perfectly maintains the ties of kinship is not the one who does it because he gets reciprocated by his relatives, but the one who truly maintains the bonds is the one who, when his relatives cut him off, he keeps on maintaining the ties of kinship with them.\" (Bukhari)\n• Don't cut ties in response to their cutting\n• Be the better person\n• Your reward is with Allah\n\n2. If They Are Rude or Disrespectful:\n• Respond with kindness and patience\n• \"Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.\" (Quran 41:34)\n• Don't match their bad behavior\n• Maintain your good character\n\n3. If They Are Sinful:\n• Maintain ties while disapproving of sin\n• Advise them with wisdom and kindness\n• Don't support their wrongdoing\n• Make dua for their guidance\n• Never sever ties due to their sins\n\n4. If Distance Separates You:\n• Use phone, video calls, messages\n• Visit when possible\n• Send gifts and financial support\n• Distance is not an excuse to cut ties\n• Technology has made it easier than ever\n\nThe Prophetic Example:\n\nThe Prophet Muhammad ﷺ was the perfect example of maintaining family ties:\n\n• He maintained close ties with his uncle Abu Talib despite his disbelief\n• He honored his aunt Safiyyah and other relatives\n• He visited sick relatives and attended their funerals\n• He gave priority to family in charity\n• He reconciled feuding relatives\n• He taught his companions to maintain ties even with difficult relatives\n• He made maintaining family ties a condition for entering Paradise\n\nAction Plan for Strengthening Family Ties:\n\n1. Make a list of all your relatives\n2. Identify those you haven't contacted recently\n3. Start with closest relatives (parents, siblings, grandparents)\n4. Reach out this week - call, visit, or message\n5. Set regular reminders to stay in touch\n6. Plan family gatherings or reunions\n7. Help relatives in need\n8. Forgive past grievances\n9. Make daily dua for all your family\n10. Make sincere intention to please Allah through maintaining ties\n\nRemember: Every act of kindness toward relatives is rewarded abundantly. Every phone call, every visit, every kind word is recorded with Allah and will benefit you in this life and the Hereafter. Silat ar-Rahm is not just about fulfilling obligations - it's about building a strong, loving family that supports each other and pleases Allah.\n\nMay Allah help us all maintain strong bonds with our families and grant us the reward of Jannah through upholding Silat ar-Rahm. Ameen.",
        "ur": "صلہ رحمی کی اہمیت\n\nصلہ رحمی اسلام میں سب سے زیادہ زور دیے گئے اعمال میں سے ایک ہے۔\n\nصلہ رحمی کیا ہے:\n• لفظی معنی \"رحم کو جوڑنا\" - خونی رشتوں کو برقرار رکھنا\n• رشتہ داروں سے مہربانی، ملاقات، مدد اور محبت شامل ہے\n• تمام خاندانی اراکین - قریبی اور دور کے\n• صرف ان تک محدود نہیں جو آپ کے ساتھ اچھے ہیں\n\nبڑے ثواب:\n• \"اور اللہ سے ڈرو جس کے نام پر تم ایک دوسرے سے مانگتے ہو، اور رحموں سے۔ بیشک اللہ تم پر نگران ہے۔\" (قرآن 4:1)\n• عمر اور رزق میں اضافہ\n• نبی کریم ﷺ نے فرمایا: \"جو چاہے کہ اس کا رزق بڑھے اور عمر دراز ہو، وہ صلہ رحمی کرے۔\" (بخاری و مسلم)\n• مال اور اولاد میں برکت\n• اچانک موت سے حفاظت\n\nجنت میں داخلہ:\n• صلہ رحمی جنت کا راستہ ہے\n• نبی کریم ﷺ نے فرمایا: \"تم جنت میں داخل نہیں ہو سکتے جب تک ایمان نہ لاؤ، اور ایمان نہیں لا سکتے جب تک ایک دوسرے سے محبت نہ کرو۔\" (مسلم)\n• رحم کرنے والوں پر رحمان رحم کرتا ہے\n• صلہ رحمی شفاعت کا ذریعہ ہے\n\nرشتے توڑنے کی سزا:\n• سب سے جلد سزا دیے جانے والے گناہوں میں سے\n• \"کیا تم نے اگر منہ پھیر لیا تو زمین میں فساد کرو گے اور اپنے رشتے توڑو گے؟\" (قرآن 47:22)\n• دعائیں قبول نہیں ہوتیں\n• نبی کریم ﷺ نے فرمایا: \"رشتے توڑنے والا جنت میں داخل نہیں ہوگا۔\" (بخاری و مسلم)\n• اللہ کی رحمت سے محروم\n\nآپ کے رشتہ دار کون ہیں:\n• والدین اور دادا دادی، نانا نانی\n• بچے اور پوتے پوتیاں\n• بہن بھائی اور ان کے بچے\n• چچا، خالہ، پھوپھی، ماموں اور ان کے بچے\n• تمام خونی رشتہ دار\n• وسیع خاندانی اراکین\n\nرشتے کیسے برقرار رکھیں:\n• باقاعدگی سے ملاقات کریں\n• فون یا پیغام سے خبر گیری کریں\n• خاص مواقع پر تحائف دیں\n• ضرورت کے وقت مدد کریں\n• کھانے پر بلائیں\n• خاندانی اجتماعات میں شرکت کریں\n• ان کے لیے دعا کریں\n• ان کی غلطیوں کو معاف کریں",
        "hi": "सिला रहमी की अहमियत\n\nसिला रहमी इस्लाम में सबसे ज़्यादा ज़ोर दिए गए आमाल में से एक है।\n\nसिला रहमी क्या है:\n• लफ़्ज़ी मअना \"रहम को जोड़ना\" - ख़ूनी रिश्तों को बरक़रार रखना\n• रिश्तेदारों से मेहरबानी, मुलाक़ात, मदद और मोहब्बत शामिल है\n• तमाम ख़ानदानी अराकीन - क़रीबी और दूर के\n• सिर्फ़ उन तक महदूद नहीं जो आपके साथ अच्छे हैं\n\nबड़े सवाब:\n• \"और अल्लाह से डरो जिसके नाम पर तुम एक दूसरे से मांगते हो, और रहमों से। बेशक अल्लाह तुम पर निगरान है।\" (क़ुरआन 4:1)\n• उम्र और रिज़्क़ में इज़ाफ़ा\n• नबी करीम ﷺ ने फ़रमाया: \"जो चाहे कि उसका रिज़्क़ बढ़े और उम्र दराज़ हो, वो सिला रहमी करे।\" (बुख़ारी व मुस्लिम)\n• माल और औलाद में बरकत\n• अचानक मौत से हिफ़ाज़त\n\nजन्नत में दाख़िला:\n• सिला रहमी जन्नत का रास्ता है\n• नबी करीम ﷺ ने फ़रमाया: \"तुम जन्नत में दाख़िल नहीं हो सकते जब तक ईमान न लाओ, और ईमान नहीं ला सकते जब तक एक दूसरे से मोहब्बत न करो।\" (मुस्लिम)\n• रहम करने वालों पर रहमान रहम करता है\n• सिला रहमी शफ़ाअत का ज़रीआ है\n\nरिश्ते तोड़ने की सज़ा:\n• सबसे जल्द सज़ा दिए जाने वाले गुनाहों में से\n• \"क्या तुमने अगर मुंह फेर लिया तो ज़मीन में फ़साद करोगे और अपने रिश्ते तोड़ोगे?\" (क़ुरआन 47:22)\n• दुआएं क़बूल नहीं होतीं\n• नबी करीम ﷺ ने फ़रमाया: \"रिश्ते तोड़ने वाला जन्नत में दाख़िल नहीं होगा।\" (बुख़ारी व मुस्लिम)\n• अल्लाह की रहमत से महरूम\n\nआपके रिश्तेदार कौन हैं:\n• वालिदैन और दादा दादी, नाना नानी\n• बच्चे और पोते पोतियां\n• बहन भाई और उनके बच्चे\n• चाचा, ख़ाला, फूफी, मामूं और उनके बच्चे\n• तमाम ख़ूनी रिश्तेदार\n• वसी ख़ानदानी अराकीन\n\nरिश्ते कैसे बरक़रार रखें:\n• बाक़ायदगी से मुलाक़ात करें\n• फ़ोन या पैग़ाम से ख़बरगीरी करें\n• ख़ास मवाक़े पर तोहफ़े दें\n• ज़रूरत के वक़्त मदद करें\n• खाने पर बुलाएं\n• ख़ानदानी इजतिमाआत में शिरकत करें\n• उनके लिए दुआ करें\n• उनकी ग़लतियों को माफ़ करें",
        "ar": "أهمية صلة الرحم\n\nصلة الرحم من أعظم القربات إلى الله.\n\nفضل صلة الرحم:\n• \"وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ\" (سورة النساء: 1)\n• قال النبي ﷺ: \"من سره أن يبسط له في رزقه، وينسأ له في أثره، فليصل رحمه\" (البخاري)\n• سبب في زيادة الرزق والعمر\n• سبب في دخول الجنة\n\nأجر صلة الرحم:\n• البركة في المال والعمر\n• محبة الله ورضاه\n• القرب من الله يوم القيامة\n• دخول الجنة بسلام\n• \"فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا فِي الْأَرْضِ\" (سورة محمد: 22)\n\nكيفية صلة الرحم:\n• الزيارة والتواصل\n• السؤال عن الأحوال\n• المساعدة المالية والمعنوية\n• الهدايا والصدقات\n• الدعاء للأقارب\n\nالواصل الحقيقي:\n• قال النبي ﷺ: \"ليس الواصل بالمكافئ، ولكن الواصل الذي إذا قطعت رحمه وصلها\" (البخاري)\n• يصل من قطعه\n• يعفو عمن أساء إليه\n• يحسن إلى من أساء\n\nدرجات صلة الرحم:\n• الواجب: عدم القطيعة\n• المستحب: الزيارة والتواصل\n• الأكمل: الإحسان والمساعدة\n• الأفضل: الصلة مع القطيعة"
      }
    },
    {
      "step": 2,
      "title_key": "relative_fazilat_2_dealing_with_difficult_relatives",
      "title": {
        "en": "Dealing with Difficult Relatives",
        "ur": "مشکل رشتہ داروں سے نمٹنا",
        "hi": "मुश्किल रिश्तेदारों से निपटना",
        "ar": "التعامل مع الأقارب الصعبين"
      },
      "icon": "handshake",
      "color": "orange",
      "details": {
        "en": "Dealing with Difficult Relatives\n\nThe true test of maintaining family ties is not when everyone is kind and loving, but when relatives are difficult, unappreciative, or even hostile. Islam teaches us to maintain these ties regardless of how others behave, as this is where the greatest reward lies.\n\nThe Prophet's Comprehensive Teaching:\n\nA profound Hadith illustrates this beautifully: A man came to the Prophet ﷺ and said: \"O Messenger of Allah, I have relatives with whom I try to maintain ties, but they cut me off. I treat them well, but they treat me badly. I am forbearing with them, but they are harsh and rude to me.\"\n\nThe Prophet ﷺ replied: \"If you are as you say, it is as if you are putting hot ashes in their mouths. You will continue to have support from Allah against them as long as you continue to do that.\" (Muslim)\n\nThis powerful metaphor means that your good treatment, despite their bad behavior, burns them with regret and shame, and Allah will continuously support you. The reward is not just in the Hereafter, but immediate divine assistance in this life.\n\nAnother companion asked: \"O Messenger of Allah, I have relatives with whom I try to uphold the ties of kinship but they cut me off, I treat them kindly but they treat me badly, I am good to them but they are bad to me.\" The Prophet ﷺ said: \"If you are as you say, it is as if you are feeding them hot ashes, and you will have a supporter against them from Allah as long as you continue to do that.\" (Muslim)\n\nQuranic Guidance on Patience and Forbearance:\n\nAllah commands in the Quran: \"Repel evil with that which is better. Then you will see that the one with whom you had enmity has become like a devoted friend.\" (Quran 41:34)\n\nThis verse promises that persistent good behavior can transform enemies into friends. It may not happen immediately, but patience and consistency work miracles on human hearts.\n\n\"And not equal are the good deed and the bad. Repel evil by that which is best, and thereupon the one whom between you and him is enmity will become as though he was a devoted friend.\" (Quran 41:34)\n\n\"And whoever is patient and forgives - indeed, that is of the matters requiring determination.\" (Quran 42:43)\n\nAllah acknowledges that this requires tremendous strength and determination. It's not easy, but it's among the most noble of deeds.\n\n\"The servants of the Most Merciful are those who walk upon the earth easily, and when the ignorant address them harshly, they say words of peace.\" (Quran 25:63)\n\nTypes of Difficult Relatives and Strategies for Each:\n\n1. The Critical Relative Who Constantly Finds Fault:\nStrategy: Don't take criticism personally. Respond with kindness and compliments. \"May Allah reward you for your concern.\" Visit them regularly despite criticism. Make dua for them to see your good intentions.\n\n2. The Jealous Relative Who Can't Celebrate Your Success:\nStrategy: Don't boast about achievements in their presence. Include them in your happiness by sharing gifts. Make them feel valued. \"Your prayers have helped me succeed.\" Downplay worldly gains and emphasize spiritual growth.\n\n3. The Toxic Relative Who Spreads Gossip:\nStrategy: Never engage in gossip about them in return. \"I heard you said something about me. I wanted to clarify directly with you.\" Kill rumors with kindness. The Prophet ﷺ said: \"Whoever believes in Allah and the Last Day should speak good or remain silent.\" (Bukhari & Muslim)\n\n4. The Demanding Relative With Endless Requests:\nStrategy: Help within your capacity. Be honest about your limitations. \"I'd love to help, but I can't right now. Here's what I can do instead.\" Give what you can without resentment. Set clear, kind boundaries.\n\n5. The Abusive Relative Who Causes Real Harm:\nStrategy: Maintain the tie from a safe distance. Send gifts and greetings through others. Make dua for them. Seek help from family elders. The Prophet ﷺ said: \"Maintaining kinship ties does not mean reciprocating. Rather, it means that if they cut you off, you keep trying to reconnect.\" (Bukhari)\n\n6. The Ungrateful Relative Who Never Appreciates:\nStrategy: Shift your intention from seeking their appreciation to seeking Allah's pleasure. \"I'm not doing this for thanks but for Allah.\" Remember the hadith of hot ashes - their ingratitude harms them, not you.\n\n7. The Competitive Relative Who Sees Everything as a Contest:\nStrategy: Refuse to compete. Compliment them genuinely. \"MashaAllah, you've done so well!\" Make them feel they've won. The real victory is in your noble character.\n\nProphetic Examples of Dealing with Difficult Relatives:\n\n1. The Prophet's Uncle Abu Lahab:\nDespite Abu Lahab's extreme hostility and mockery, the Prophet ﷺ continued attempting reconciliation and inviting him to Islam until his death. He never cursed him or sought revenge.\n\n2. The Prophet's Treatment of Abu Sufyan:\nBefore Abu Sufyan accepted Islam, he was a chief enemy who organized armies against Muslims. Yet the Prophet ﷺ showed him extraordinary mercy when he finally came to Makkah, honoring his household and forgiving past crimes.\n\n3. Prophet Yusuf (AS) and His Brothers:\nAfter years of separation caused by his brothers' betrayal (throwing him in a well and selling him into slavery), Prophet Yusuf said to them: \"No blame will there be upon you today. Allah will forgive you, and He is the Most Merciful of the merciful.\" (Quran 12:92)\n\nSetting Healthy Boundaries While Maintaining Ties:\n\nMaintaining family ties doesn't mean accepting abuse or enabling destructive behavior. Islam teaches balance:\n\n• You can maintain ties through occasional calls, messages, and gifts without constant physical presence if they're harmful\n• The Prophet ﷺ said: \"One of you should not wish to be like anyone else except in two cases: a man whom Allah has given wealth and he spends it in the right way, and a man whom Allah has given wisdom and he acts upon it and teaches it to others.\" (Bukhari)\n• Protect your mental health while fulfilling your religious duty\n• Involve trusted family mediators when direct contact is too painful\n• Send Eid greetings, attend major family events (weddings, funerals) even if you limit regular contact\n• Your children have rights too - don't expose them to toxic family members unnecessarily\n\nWhen They Wrong You - Practical Steps:\n\n1. Process Your Emotions Privately: Feel hurt, but don't react immediately. \"When one of you becomes angry while standing, he should sit down. If the anger leaves him, well and good; otherwise he should lie down.\" (Abu Dawud)\n\n2. Make Dua for Them: \"O Allah, guide my family and forgive their mistakes as they don't know the weight of their actions.\"\n\n3. Respond with Unexpected Kindness: Send them a gift after they've wronged you. This often melts hearts faster than arguments.\n\n4. Seek Understanding: Perhaps they're going through difficulties you don't know about. \"Make 70 excuses for your brother.\" (Bayhaqi)\n\n5. Forgive Quickly: \"Those who restrain anger and who pardon people - Allah loves the doers of good.\" (Quran 3:134)\n\n6. Don't Broadcast Their Faults: Protect their dignity as you wish Allah to protect yours.\n\nPsychological Aspects and Emotional Intelligence:\n\nUnderstanding human psychology helps in dealing with difficult relatives:\n\n• Hurt people hurt people: Often, difficult behavior stems from their own pain, insecurity, or past trauma\n• Projection: They may criticize in you what they dislike in themselves\n• Attention-seeking: Negative attention is still attention for those who feel neglected\n• Cultural conditioning: They may not know better based on how they were raised\n• Mental health issues: Undiagnosed depression, anxiety, or personality disorders can manifest as difficult behavior\n\nEmotional Intelligence in Family Dealings:\n\n1. Self-awareness: Recognize your own triggers and emotional patterns\n2. Self-regulation: Control your reactions even when provoked\n3. Empathy: Try to understand their perspective and pain\n4. Social skills: Communicate assertively but kindly\n5. Motivation: Remember your higher purpose - Allah's pleasure\n\nThe Unique Reward for Patience with Difficult Relatives:\n\nThe Prophet ﷺ said: \"The one who maintains family ties is not the one who reciprocates good treatment. Rather, the one who maintains family ties is the one who, when his relatives cut him off, maintains ties with them.\" (Bukhari)\n\nThis Hadith revolutionizes our understanding. True silat ar-rahm is demonstrated when it's difficult, not when it's easy.\n\n\"Indeed, the patient will be given their reward without account.\" (Quran 39:10) - unlimited reward for unlimited patience.\n\nModern Application - Technology and Distance:\n\nToday's world offers new ways to maintain ties despite difficult dynamics:\n\n• Video calls reduce the need for extended stressful visits while maintaining visual connection\n• Messages allow you to reach out without immediate confrontation\n• Social media lets you acknowledge their life events with a simple like or comment\n• Digital gift cards make gift-giving easy across distances\n• Group family chats let you participate without one-on-one pressure\n\nFinancial Wisdom When Money Creates Conflict:\n\n\"And if someone is in hardship, then let there be postponement until a time of ease. But if you give from your right as charity, it is better for you, if you only knew.\" (Quran 2:280)\n\n• Never lend money you can't afford to lose to family\n• If they owe you money and are struggling, consider forgiving it entirely\n• Don't let them know if you're forgiving the debt to avoid hurting their pride\n• The Prophet ﷺ said: \"Whoever would like Allah to save him from the hardships of the Day of Resurrection, let him give more time to his debtor who is in difficulty, or let him write off the debt.\" (Muslim)\n• Don't use money as leverage or to manipulate family members\n\nThe Ultimate Perspective - Why Continue Despite Difficulty:\n\n1. Allah's Command: It's not about whether they deserve it, but about obeying Allah\n\n2. Your Own Soul's Purity: Maintaining good character despite mistreatment purifies your heart from resentment\n\n3. Setting an Example: Your children learn from your behavior toward extended family\n\n4. Unknown Future: The difficult relative today might be your greatest supporter tomorrow\n\n5. Day of Judgment: You'll be asked about your duties, not about whether they reciprocated\n\n6. Blessings in Life: \"Whoever would like his provision to be increased and his lifespan to be extended, let him maintain the ties of kinship.\" (Bukhari & Muslim)\n\nA Final Word of Encouragement:\n\nThe scholars say: \"If they are harsh to you, be gentle with them. If they cut you off, connect with them. If they wrong you, forgive them. If they're ungrateful, be patient. Soon, either their hearts will soften, or yours will be elevated in Paradise, or both.\"\n\nRemember: Your good character is YOUR jannah being built brick by brick, regardless of anyone else's behavior. Every time you choose kindness over retaliation, you're making an investment in eternal success.\n\n\"So be patient. Indeed, the promise of Allah is truth. And ask forgiveness for your sin and exalt Allah with praise of your Lord in the evening and the morning.\" (Quran 40:55)",
        "ur": "مشکل رشتہ داروں سے نمٹنا\n\nرشتے برقرار رکھنے کا اصل امتحان اس وقت ہوتا ہے جب رشتہ دار مشکل ہوں۔\n\nنبی کریم ﷺ کی تعلیم:\n• ایک آدمی نبی کریم ﷺ کے پاس آیا اور کہا: \"میرے رشتہ دار ہیں جن سے میں رشتہ برقرار رکھنے کی کوشش کرتا ہوں، لیکن وہ مجھے کاٹ دیتے ہیں۔ میں ان کے ساتھ اچھا سلوک کرتا ہوں، لیکن وہ میرے ساتھ برا سلوک کرتے ہیں۔ میں ان کے ساتھ نرم ہوں، لیکن وہ مجھ پر سخت ہیں۔\"\n• نبی کریم ﷺ نے فرمایا: \"اگر تم جیسا کہتے ہو ویسے ہو، تو یہ ایسے ہے جیسے تم ان کے منہ میں گرم راکھ ڈال رہے ہو۔ اللہ تمہاری مدد جاری رکھے گا جب تک تم یہ کرتے رہو۔\" (مسلم)\n\nصبر کلیدی ہے:\n• برائی کا جواب برائی سے نہ دیں\n• \"برائی کو اس چیز سے دور کرو جو بہتر ہے۔\" (قرآن 41:34)\n• بدسلوکی کے باوجود مہربانی جاری رکھیں\n• یاد رکھیں ثواب اللہ کے پاس ہے\n• آپ کا اچھا کردار آخرکار دل جیت لے گا\n\nجب وہ آپ پر ظلم کریں:\n• ان کی غلطیوں کو معاف کریں\n• بدلہ نہ لیں\n• ان کی ہدایت کے لیے دعا کریں\n• رابطہ کھلا رکھیں\n• ضرورت ہو تو حدود مقرر کریں\n• دوسروں سے ان کی غیبت نہ کریں\n\nجب وہ آپ کو کاٹ دیں:\n• بدلے میں انہیں نہ کاٹیں\n• وقتاً فوقتاً رابطہ کرتے رہیں\n• دوسروں کے ذریعے سلام بھیجیں\n• ان کے لیے دعا کریں\n• مناسب ہو تو تحائف دیں\n• صلح کے لیے پہل کریں\n\nمالی مسائل:\n• اگر وہ آپ کے مقروض ہیں تو صبر کریں\n• سختی سے مطالبہ نہ کریں\n• اگر وہ مشکل میں ہیں تو قرض معاف کرنے پر غور کریں\n• پیسے کو رشتوں کو تباہ نہ کرنے دیں\n• \"اور اگر کوئی تنگ دست ہے تو آسانی تک مہلت دی جائے۔\" (قرآن 2:280)\n\nاپنے حقوق کی حفاظت:\n• رشتے برقرار رکھتے ہوئے اپنی حفاظت کر سکتے ہیں\n• صحت مند حدود مقرر کریں\n• بری عادتوں کو فروغ نہ دیں\n• دانشمند لوگوں سے مشورہ لیں\n• ضرورت ہو تو بزرگوں کو بیچ میں لائیں\n• اگر وہ آپ کے ایمان کے لیے نقصان دہ ہیں تو فاصلہ بنائیں\n\nیاد رکھیں:\n• آپ کا ثواب آپ کی کوشش کے لیے ہے، ان کے جواب کے لیے نہیں\n• اللہ آپ کی خلوص دیکھتا ہے\n• ناقص انسانوں سے کمال کی توقع نہ رکھیں\n• اللہ کو خوش کرنے پر توجہ دیں، انہیں نہیں\n• جتنا مشکل ہوگا، ثواب اتنا زیادہ ہوگا",
        "hi": "मुश्किल रिश्तेदारों से निपटना\n\nरिश्ते बरक़रार रखने का असल इम्तिहान उस वक़्त होता है ���ब रिश्तेदार मुश्किल हों।\n\nनबी करीम ﷺ की तालीम:\n• एक आदमी नबी करीम ﷺ के पास आया और कहा: \"मेरे रिश्तेदार हैं जिनसे मैं रिश्ता बरक़रार रखने की कोशिश करता हूं, लेकिन वो मुझे काट देते हैं। मैं उनके साथ अच्छा सुलूक करता हूं, लेकिन वो मेरे साथ बुरा सुलूक करते हैं। मैं उनके साथ नरम हूं, लेकिन वो मुझ पर सख़्त हैं।\"\n• नबी करीम ﷺ ने फ़रमाया: \"अगर तुम जैसा कहते हो वैसे हो, तो यह ऐसे है जैसे तुम उनके मुंह में गरम राख डाल रहे हो। अल्लाह तुम्हारी मदद जारी रखेगा जब तक तुम यह करते रहो।\" (मुस्लिम)\n\nसब्र कुंजी है:\n• बुराई का जवाब बुराई से न दें\n• \"बुराई को उस चीज़ से दूर करो जो बेहतर है।\" (क़ुरआन 41:34)\n• बदसुलूकी के बावजूद मेहरबानी जारी रखें\n• याद रखें सवाब अल्लाह के पास है\n• आपका अच्छा किरदार आख़िरकार दिल जीत लेगा\n\nजब वो आप पर ज़ुल्म करें:\n• उनकी ग़लतियों को माफ़ करें\n• बदला न लें\n• उनकी हिदायत के लिए दुआ करें\n• राबिता खुला रखें\n• ज़रूरत हो तो हुदूद मुक़र्रर करें\n• दूसरों से उनकी ग़ीबत न करें\n\nजब वो आपको काट दें:\n• बदले में उन्हें न काटें\n• वक़्तन फ़ौक़्तन राबिता करते रहें\n• दूसरों के ज़रीए सलाम भेजें\n• उनके लिए दुआ करें\n• मुनासिब हो तो तोहफ़े दें\n• सुलह के लिए पहल करें\n\nमाली मसाइल:\n• अगर वो आपके मक़रूज़ हैं तो सब्र करें\n• सख़्ती से मुतालबा न करें\n• अगर वो मुश्किल में हैं तो क़र्ज़ माफ़ करने पर ग़ौर करें\n• पैसे को रिश्तों को तबाह न करने दें\n• \"और अगर कोई तंगदस्त है तो आसानी तक मोहलत दी जाए।\" (क़ुरआन 2:280)\n\nअपने हुक़ूक़ की हिफ़ाज़त:\n• रिश्ते बरक़रार रखते हुए अपनी हिफ़ाज़त कर सकते हैं\n• सेहतमंद हुदूद मुक़र्रर करें\n• बुरी आदतों को फ़रोग़ न दें\n• दानिशमंद लोगों से मशवरा लें\n• ज़रूरत हो तो बुज़ुर्गों को बीच में लाएं\n• अगर वो आपके ईमान के लिए नुक़सानदेह हैं तो फ़ासला बनाएं\n\nयाद रखें:\n• आपका सवाब आपकी कोशिश के लिए है, उनके जवाब के लिए नहीं\n• अल्लाह आपकी ख़ुलूस देखता है\n• नाक़िस इंसानों से कमाल की तवक़्क़ो न रखें\n• अल्लाह को ख़ुश करने पर तवज्जोह दें, उन्हें नहीं\n• जितना मुश्किल होगा, सवाब उतना ज़्यादा होगा",
        "ar": "التعامل مع الأقارب الصعبين\n\nكيفية الصبر على أذى الأقارب.\n\nالصبر على الأذى:\n• قال النبي ﷺ: \"ليس الواصل بالمكافئ\" (البخاري)\n• الصبر على أذى الأقارب عبادة\n• العفو والصفح من علامات الإيمان\n• \"وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ\" (سورة آل عمران: 134)\n\nالمبادرة بالإحسان:\n• مقابلة الإساءة بالإحسان\n• \"ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ\" (سورة المؤمنون: 96)\n• الهدية تذهب السخيمة\n• الكلمة الطيبة صدقة\n\nتجنب المشاكل:\n• عدم الرد على الإساءة\n• التماس الأعذار\n• \"وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا\" (سورة الفرقان: 63)\n• طلب الوساطة من الحكماء\n\nالدعاء لهم:\n• الدعاء بالهداية\n• طلب الخير لهم\n• الاستغفار عن زلاتهم\n• \"رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا\" (سورة الحشر: 10)\n\nالحكمة في التعامل:\n• اختيار الوقت المناسب\n• استخدام الأسلوب الحسن\n• الحلم والأناة\n• عدم الاستعجال في الحكم"
      }
    },
    {
      "step": 3,
      "title_key": "relative_fazilat_3_neighbors_as_extended_family",
      "title": {
        "en": "Neighbors as Extended Family",
        "ur": "پڑوسی - وسیع خاندان کی طرح",
        "hi": "पड़ोसी - वसी ख़ानदान की तरह",
        "ar": "الجيران كالعائلة"
      },
      "icon": "circle",
      "color": "blue",
      "details": {
        "en": "Neighbors as Extended Family - Complete Rights and Responsibilities\n\nIn Islam, neighbors hold such a special status that they are considered nearly as important as blood relatives. The emphasis on neighborly rights is so profound that it forms a cornerstone of Islamic social ethics and community building.\n\nThe Supreme Status of Neighbors in Islam:\n\nAllah places the rights of neighbors immediately after the rights of parents and relatives in the Quran:\n\n\"Worship Allah and associate nothing with Him, and to parents do good, and to relatives, orphans, the needy, the near neighbor, the neighbor farther away, the companion at your side, the traveler, and those whom your right hands possess. Indeed, Allah does not like those who are self-deluding and boastful.\" (Quran 4:36)\n\nNotice how Allah categorizes neighbors into two types:\n1. \"The near neighbor\" (Al-Jar dhal-Qurba) - the close neighbor\n2. \"The neighbor farther away\" (Al-Jar al-Junub) - the distant neighbor\n\nBoth have rights upon you, with the closer neighbor having greater rights.\n\nThe Prophet's Unprecedented Emphasis:\n\nThe Prophet Muhammad ﷺ said: \"Jibreel kept advising me about the neighbor until I thought he would make him an heir.\" (Bukhari & Muslim)\n\nThis powerful statement shows that the angel Jibreel repeatedly emphasized the rights of neighbors to the Prophet ﷺ, to the point where the Prophet thought neighbors might be given inheritance rights like family members!\n\nAnother Hadith states: \"By Allah, he does not believe! By Allah, he does not believe! By Allah, he does not believe!\" It was said, \"Who, O Messenger of Allah?\" He said: \"The one whose neighbor is not safe from his harm.\" (Bukhari)\n\nThe repetition three times shows the gravity of harming neighbors and that such a person's faith is deficient.\n\nThe Complete Levels of Neighbors and Their Rights:\n\nIslamic scholars have identified three distinct levels of neighbors, each with cumulative rights:\n\nLevel 1: The Muslim Neighbor Who is Also a Relative\nThis neighbor has three rights:\n• The right of Islam (being a fellow Muslim)\n• The right of kinship (being a blood relative)\n• The right of being a neighbor (living nearby)\nThis is the neighbor with the most rights, deserving the highest priority in kindness, help, and consideration.\n\nLevel 2: The Muslim Neighbor\nThis neighbor has two rights:\n• The right of Islam\n• The right of being a neighbor\nAll Muslim neighbors deserve good treatment, visiting when sick, congratulations in joy, and help in times of need.\n\nLevel 3: The Non-Muslim Neighbor\nThis neighbor has:\n• The right of being a neighbor\nIslam commands kindness to all neighbors regardless of their religion. The Prophet ﷺ had Jewish neighbors in Madinah whom he treated with respect and kindness. This is a beautiful example of Islam's universal values of compassion and coexistence.\n\nWho Exactly is Considered Your Neighbor?\n\nThe scholars have differed on the precise definition:\n• Some say: 40 houses in each direction (front, back, left, right)\n• Some say: Everyone within hearing distance if you called for help\n• Some say: Everyone on your street or in your building\n• The most practical definition: Anyone whose proximity to you gives you regular contact or influence over their wellbeing\n\nThe Comprehensive Rights of Neighbors - 15+ Authentic Hadith:\n\n1. Protection from All Forms of Harm:\n\nThe Prophet ﷺ said: \"Whoever believes in Allah and the Last Day, let him not harm his neighbor.\" (Bukhari & Muslim)\n\nThis includes:\n• Physical harm: No violence, aggression, or physical intimidation\n• Verbal harm: No insults, gossip, backbiting, or harsh words\n• Visual harm: No looking into their windows or invading their privacy\n• Auditory harm: No excessive noise, loud music, or disturbances\n• Olfactory harm: No bad smells from garbage or cooking that disturb them\n• Property harm: No encroachment on their property, blocking their driveway, or damaging their belongings\n• Environmental harm: No polluting shared spaces or creating unsightly conditions\n\n2. Patience with Their Harm:\n\nThe Prophet ﷺ said: \"The best companion in the sight of Allah is the one who is best to his companion, and the best neighbor in the sight of Allah is the one who is best to his neighbor.\" (Tirmidhi - Sahih)\n\nEven when neighbors are difficult, Islam teaches patience and continued good treatment. Don't respond to harm with harm.\n\n3. Sharing Food and Provisions:\n\nThe Prophet ﷺ said: \"He is not a believer whose stomach is filled while his neighbor goes hungry.\" (Bayhaqi - Authenticated by Al-Albani)\n\nThe Prophet ﷺ also said: \"O Abu Dharr, when you make broth, add extra water to it and give some to your neighbors.\" (Muslim)\n\nAbdullah ibn Amr reported: The Messenger of Allah ﷺ said: \"The best companion with Allah is the best to his companions, and the best neighbor with Allah is the best to his neighbors.\" (Tirmidhi - Sahih)\n\nThe Prophet ﷺ said: \"He is not a true believer who fills his stomach while his neighbor is hungry.\" (Bayhaqi - Authenticated)\n\n4. Visiting When Sick:\n\nThe Prophet ﷺ said: \"Whoever visits a sick person is plunging into mercy until he sits down, and when he sits down he becomes submerged in it.\" (Ahmad - Sahih)\n\n5. Congratulating in Times of Joy:\n\nThe Prophet ﷺ said: \"Give gifts to one another and you will love one another.\" (Al-Adab Al-Mufrad - Sahih)\n\n6. Offering Condolences in Times of Grief:\n\nThe Prophet ﷺ said: \"Whoever consoles a person afflicted with a calamity will have a reward similar to his.\" (Tirmidhi - Hasan)\n\n7. Concealing Their Faults and Protecting Their Honor:\n\nThe Prophet ﷺ said: \"Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the Hereafter.\" (Muslim)\n\n8. Helping in Times of Need:\n\nThe Prophet ﷺ said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens on the Day of Resurrection.\" (Muslim)\n\nThe Severe Warning About Bad Neighbors:\n\nA woman asked the Prophet ﷺ: \"O Messenger of Allah, so-and-so prays at night, fasts during the day, performs obligatory acts of worship, and gives charity, but she harms her neighbors with her tongue.\" The Prophet ﷺ said: \"There is no good in her; she is from the people of Hell.\" (Ahmad - Authenticated)\n\nThen she mentioned another woman: \"O Messenger of Allah, so-and-so prays the prescribed prayers and gives charity of leftover yogurt, but she does not harm anyone.\" He said: \"She is from the people of Paradise.\" (Ahmad - Authenticated)\n\nThe Prophet ﷺ said: \"Do you know what the rights of a neighbor are? If he asks for your help, you help him. If he asks you for a loan, you give him a loan. If he becomes poor, you provide for him. If he becomes ill, you visit him. If something good happens to him, you congratulate him. If a calamity befalls him, you console him. If he dies, you follow his funeral.\" (Al-Adab Al-Mufrad by Bukhari - Sahih)\n\nThe Prophet ﷺ said: \"Jibreel continued to advise me concerning the neighbor to such an extent that I thought he would order me to make him an heir.\" (Bukhari & Muslim)\n\nThe Prophet ﷺ said: \"He will not enter Paradise whose neighbor is not secure from his wrongful conduct.\" (Muslim)\n\nThe Prophet ﷺ said: \"A man may perform the prayer, observe the fast, give charity, and perform Hajj and Umrah, yet he will not receive a reward for it. It was said: Why, O Messenger of Allah? He said: Because he treats people with bad character.\" (Tabarani - Hasan)\n\nThe Prophet ﷺ said: \"The neighbor has the most right to being treated well.\" (Bukhari)\n\nQualities of a Good Neighbor:\n\n1. Greeting with Peace:\nThe Prophet ﷺ said: \"You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I tell you something that, if you do it, you will love one another? Spread peace (salaam) among yourselves.\" (Muslim)\n\n2. Respecting Privacy:\n\"O you who believe! Do not enter houses other than your own until you ascertain welcome and greet their inhabitants.\" (Quran 24:27)\n\n3. Lending and Sharing:\nThe Prophet ﷺ said: \"Whoever lends something twice, it is as if he has given it in charity once.\" (Ibn Majah - Sahih)\n\nProphetic Examples of Neighborly Love:\n\n1. The Prophet's Jewish Neighbor:\nThe Prophet ﷺ had a Jewish neighbor in Madinah who used to throw garbage at his door daily. The Prophet never complained. One day, when the garbage wasn't there, the Prophet inquired and learned his neighbor was sick. He visited him, and the neighbor was so moved by this kindness that he embraced Islam.\n\n2. The Prophet's Advice to Abu Dharr:\nThe Prophet ﷺ specifically told Abu Dharr: \"When you cook soup, add extra water and share it with your neighbors.\" (Muslim)\n\n3. The Prophet's Gift-Giving:\nThe Prophet ﷺ said: \"Do not belittle any good deed, even meeting your brother with a cheerful face.\" (Muslim)\n\nModern Neighborhood Challenges and Islamic Solutions:\n\nChallenge 1: Anonymous Urban Living\nSolution: Actively introduce yourself. Knock on doors with a gift. Organize building or street gatherings.\n\nChallenge 2: Cultural and Religious Diversity\nSolution: Islamic teachings apply to all neighbors regardless of faith. Be the best representative of Islam through your character.\n\nChallenge 3: Privacy vs. Community\nSolution: Respect boundaries while being available. A simple greeting doesn't invade privacy but builds connection.\n\nChallenge 4: Digital Disconnection\nSolution: Create neighborhood WhatsApp groups for sharing information and helping each other.\n\nChallenge 5: Busy Lifestyles\nSolution: Small gestures matter. Even a 2-minute conversation when you see them shows care.\n\nChallenge 6: Parking and Space Disputes\nSolution: Be flexible and accommodating. The Prophet ﷺ said: \"Make things easy and do not make them difficult.\" (Bukhari)\n\nPractical Action Plan for Being a Better Neighbor:\n\nWeek 1: Introduce yourself if you haven't already. Share some homemade food or fruits.\nWeek 2: Exchange phone numbers. Offer specific help.\nWeek 3: Learn about their family, culture, and needs.\nWeek 4: Organize a small neighborhood gathering.\n\nOngoing: Maintain regular small gestures - greetings, occasional food sharing, checking on them, helping when needed.\n\nBuilding Community Through Islamic Neighborly Values:\n\n1. Organize Neighborhood Gatherings\n2. Establish Neighborhood Watch Programs\n3. Help Elderly and Disabled Neighbors\n4. Create Safe Spaces for Children\n5. Collaborate on Neighborhood Improvements\n6. Resolve Conflicts Peacefully\n\nConclusion - Neighbors as Extended Family:\n\nThe Prophet ﷺ said: \"Gabriel continued to advise me about the neighbor to the point that I thought he would inherit from him.\" (Agreed upon)\n\nYour neighbor has nearly the status of a family member who would inherit from you. This is how important they are in Islam. When you understand this, you'll never see your neighborhood the same way again.",
        "ur": "پڑوسی - وسیع خاندان کی طرح\n\nاسلام نے پڑوسیوں کے حقوق پر بہت زور دیا ہے۔\n\nپڑوسیوں کا مقام:\n• \"اللہ کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ ٹھہراؤ، اور والدین کے ساتھ اچھا سلوک کرو اور رشتہ داروں، یتیموں، محتاجوں اور قریبی پڑوسی اور دور کے پڑوسی کے ساتھ۔\" (قرآن 4:36)\n• نبی کریم ﷺ نے فرمایا: \"جبریل مجھے پڑوسی کے بارے میں نصیحت کرتے رہے یہاں تک کہ میں نے سوچا کہ وہ اسے وارث بنا دیں گے۔\" (بخاری و مسلم)\n• پڑوسیوں کے رشتہ داروں جیسے حقوق ہیں\n\nتین قسمیں:\n1. مسلمان پڑوسی جو رشتہ دار بھی ہے - تین حقوق: اسلام کا حق، رشتہ داری کا حق، اور پڑ��سی ہونے کا حق\n2. مسلمان پڑوسی - دو حقوق: اسلام کا حق اور پڑوسی ہونے کا حق\n3. غیر مسلم پڑوسی - پڑوسی ہونے کا حق\n\nپڑوسیوں کے حقوق:\n• کسی بھی طرح سے انہیں نقصان نہ پہنچائیں\n• ان کے نقصان پر صبر کریں\n• ان کے ساتھ کھانا بانٹیں\n• نبی کریم ﷺ نے فرمایا: \"وہ مومن نہیں جو پیٹ بھر کر کھائے جبکہ اس کا پڑوسی بھوکا ہو۔\" (بیہقی)\n• ضرورت کے وقت مدد کریں\n• بیماری میں ملاقات کریں\n• خوشی کے موقع پر مبارکباد دیں\n• غم کے وقت تعزیت کریں\n\nاچھے پڑوسی کی خصوصیات:\n• سلام کے ساتھ ملاقات\n• نگاہ جھکانا اور رازداری کا احترام\n• ان کے گھروں میں جھانکنا نہیں\n• شور کی سطح کم رکھنا\n• ان کے راستے میں رکاوٹ نہ ڈالنا\n• پھل اور اچھی چیزیں بانٹنا\n• ضرورت پڑنے پر چیزیں ادھار دینا\n\nبرے پڑوسی کی تنبیہ:\n• ایک عورت نے پوچھا: \"اے اللہ کے رسول، فلاں عورت رات کو نماز پڑھتی ہے، دن میں روزہ رکھتی ہے، نیک کام کرتی ہے اور صدقہ دیتی ہے، لیکن وہ اپنی زبان سے اپنے پڑوسیوں کو تکلیف دیتی ہے۔\" آپ نے فرمایا: \"وہ جہنم میں ہے۔\" (احمد)\n• اچھی عبادت پڑوسیوں کے ساتھ برے سلوک کا بہانہ نہیں بنتی\n• پڑوسیوں کے ساتھ آپ کا سلوک آپ کے ایمان کی عکاسی کرتا ہے\n\nعملی قدم:\n• نئے پڑوسیوں سے اپنا تعارف کرائیں\n• فون نمبر تبدیل کریں\n• فعال طور پر مدد کی پیشکش کریں\n• انہیں کھانے پر بلائیں\n• اپنی برکتیں بانٹیں\n• ہنگامی حالات میں موجود رہیں\n• کمیونٹی کے بندھن بنائیں\n\nکمیونٹی بنانا:\n• محلے کے اجتماعات کا اہتمام کریں\n• نگرانی کے پروگرام قائم کریں\n• بوڑھے پڑوسیوں کی مدد کریں\n• بچوں کے لیے کھیل کے علاقے بنائیں\n• محلے کی بہتری پر تعاون کریں\n• تنازعات کو امن سے حل کریں",
        "hi": "पड़ोसी - वसी ख़ानदान की तरह\n\nइस्लाम ने पड़ोसियों के हुक़ूक़ पर बहुत ज़ोर दिया है।\n\nपड़ोसियों का मक़ाम:\n• \"अल्लाह की इबादत करो और उसके साथ किसी को शरीक न ठहराओ, और वालिदैन के साथ अच्छा सुलूक करो और रिश्तेदारों, यतीमों, मोहताजों और क़रीबी पड़ोसी और दूर के पड़ोसी के साथ।\" (क़ुरआन 4:36)\n• नबी करीम ﷺ ने फ़रमाया: \"जिबरील मुझे पड़ोसी के बारे में नसीहत करते रहे यहां तक कि मैंने सोचा कि वो उसे वारिस बना देंगे।\" (बुख़ारी व मुस्लिम)\n• पड़ोसियों के रिश्तेदारों जैसे हुक़ूक़ हैं\n\nतीन क़िस्में:\n1. मुसलमान पड़ोसी जो रिश्तेदार भी है - तीन हुक़ूक़: इस्लाम का हक़, रिश्तेदारी का हक़, और पड़ोसी होने का हक़\n2. मुसलमान पड़ोसी - दो हुक़ूक़: इस्लाम का हक़ और पड़ोसी होने का हक़\n3. ग़ैर मुस्लिम पड़ोसी - पड़ोसी होने का हक़\n\nपड़ोसियों के हुक़ूक़:\n• किसी भी तरह से उन्हें नुक़सान न पहुंचाएं\n• उनके नुक़सान पर सब्र करें\n• उनके साथ खाना बांटें\n• नबी करीम ﷺ ने फ़रमाया: \"वो मोमिन नहीं जो पेट भरकर खाए जबकि उसका पड़ोसी भूखा हो।\" (बैहक़ी)\n• ज़रूरत के वक़्त मदद करें\n• बीमारी में मुलाक़ात करें\n• ख़ुशी के मौक़े पर मुबारकबाद दें\n• ग़म के वक़्त ताज़ियत करें\n\nअच्छे पड़ोसी की ख़ुसूसियात:\n• सलाम के साथ मुलाक़ात\n• निगाह झुकाना और राज़दारी का एहतराम\n• उनके घरों में झांकना नहीं\n• शोर की सतह कम रखना\n• उनके रास्ते में रुकावट न डालना\n• फल और अच्छी चीज़ें बांटना\n• ज़रूरत पड़ने पर चीज़ें उधार देना\n\nबुरे पड़ोसी की तंबीह:\n• एक औरत ने पूछा: \"ऐ अल्लाह के रसूल, फ़लां औरत रात को नमाज़ पढ़ती है, दिन में रोज़ा रखती है, नेक काम करती है और सदक़ा देती है, लेकिन वो अपनी ज़बान से अपने पड़ोसियों को तकलीफ़ देती है।\" आपने फ़रमाया: \"वो जहन्नम में है।\" (अहमद)\n• अच्छी इबादत पड़ोसियों के साथ बुरे सुलूक का बहाना नहीं बनती\n• पड़ोसियों के साथ आपका सुलूक आपके ईमान की अक्कासी करता है\n\nअमली क़दम:\n• नए पड़ोसियों से अपना तआरुफ़ कराएं\n• फ़ोन नंबर तबदील करें\n• फ़ेअल तौर पर मदद की पेशकश करें\n• उन्हें खाने पर बुलाएं\n• अपनी बरकतें बांटें\n• हंगामी हालात में मौजूद रहें\n• कम्युनिटी के बंधन बनाएं\n\nकम्युनिटी बनाना:\n• मोहल्ले के इजतिमाआत का एहतमाम करें\n• निगरानी के प्रोग्राम क़ायम करें\n• बूढ़े पड़ोसियों की मदद करें\n• बच्चों के लिए खेल के इलाक़े बनाएं\n• मोहल्ले की बेहतरी पर तआवुन करें\n• तनाज़ुआत को अमन से हल करें",
        "ar": "الجيران كالعائلة\n\nحقوق الجيران في الإسلام.\n\nفضل حسن الجوار:\n• قال النبي ﷺ: \"ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه\" (البخاري)\n• من الإيمان بالله واليوم الآخر\n• \"وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ\" (سورة النساء: 36)\n\nأنواع الجيران:\n• الجار القريب: له ثلاثة حقوق (الجوار والقرابة والإسلام)\n• الجار المسلم البعيد: له حقان (الجوار والإسلام)\n• الجار غير المسلم: له حق الجوار\n\nحقوق الجار:\n• رد السلام والبشاشة\n• تحمل الأذى والصبر\n• المساعدة في الحاجة\n• عدم التطلع إلى عورته\n• عيادته إذا مرض\n\nأذى الجار:\n• قال النبي ﷺ: \"والله لا يؤمن، والله لا يؤمن، والله لا يؤمن\" قيل: من يا رسول الله؟ قال: \"الذي لا يأمن جاره بوائقه\" (البخاري)\n• من كبائر الذنوب\n• يمنع من دخول الجنة\n\nالإحسان إلى الجار:\n• الهدية والصلة\n• المشاركة في الأفراح والأحزان\n• تفقد أحواله\n• الدعاء له بظهر الغيب"
      }
    },
    {
      "step": 4,
      "title_key": "relative_fazilat_4_muslim_brotherhood",
      "title": {
        "en": "Muslim Brotherhood",
        "ur": "مسلم بھائی چارہ",
        "hi": "मुस्लिम भाईचारा",
        "ar": "الأخوة الإسلامية"
      },
      "icon": "circle",
      "color": "purple",
      "details": {
        "en": "Muslim Brotherhood (Ukhuwwah) - The Bond That Transcends All Boundaries\n\nThe concept of Islamic brotherhood (Ukhuwwah) is one of the most beautiful and revolutionary teachings of Islam. It created a social structure where people of different races, tribes, nations, and backgrounds became one family united by faith.\n\nThe Divine Declaration of Brotherhood:\n\nAllah says in the Quran: \"The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.\" (Quran 49:10)\n\nThis verse establishes that all believers, regardless of ethnicity, language, or nationality, are brothers and sisters in Islam. This brotherhood is not metaphorical—it carries real rights and responsibilities.\n\n\"And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers.\" (Quran 3:103)\n\nThis verse reminds us how Islam transformed sworn enemies into beloved brothers. The tribes of Aws and Khazraj in Madinah had been in conflict for generations, but Islam united them as Ansar (helpers).\n\nThe Historic Brotherhood Between Muhajireen and Ansar:\n\nWhen the Prophet ﷺ migrated to Madinah, he established a formal bond of brotherhood between the Muhajireen (migrants from Makkah) and the Ansar (helpers from Madinah). This wasn't just symbolic:\n\n• The Ansar shared their homes with the Muhajireen\n• They divided their wealth equally\n• Some even offered to divorce one of their wives so their Muhajir brother could marry\n• They gave half their date palm trees and property\n• They treated each other as actual blood brothers\n\nThis practical demonstration of brotherhood transformed society and showed the world what true Islamic unity means.\n\nThe Prophet's Powerful Descriptions of Brotherhood:\n\n1. The Body Analogy:\nThe Prophet ﷺ said: \"The example of the believers in their affection, mercy, and compassion for each other is that of a body. When any limb aches, the whole body reacts with sleeplessness and fever.\" (Bukhari & Muslim)\n\nThis means: When one Muslim suffers anywhere in the world, all Muslims should feel that pain and respond to help.\n\n2. The Building Analogy:\nThe Prophet ﷺ said: \"The believer to another believer is like a building whose different parts support each other.\" Then he ﷺ clasped his hands with the fingers interlaced. (Bukhari & Muslim)\n\nMuslims should support, strengthen, and hold each other up like bricks in a wall.\n\n3. The Mirror Analogy:\nThe Prophet ﷺ said: \"The believer is a mirror to his brother. The believer is the brother of a believer; he protects him from ruin and guards his back.\" (Abu Dawud - Sahih)\n\nA true brother shows you your faults privately (like a mirror), protects your reputation, and defends you in your absence.\n\nThe Complete Rights of Muslims Upon Each Other - 15+ Authentic Hadith:\n\n1. Returning the Greeting of Peace:\nThe Prophet ﷺ said: \"The rights of one Muslim over another are six.\" He was asked: \"What are they, O Messenger of Allah?\" He said: \"When you meet him, greet him with peace; when he invites you, respond to his invitation; when he seeks your advice, advise him; when he sneezes and praises Allah, say 'Yarhamuk Allah' (may Allah have mercy on you); when he falls ill, visit him; and when he dies, follow his funeral.\" (Muslim)\n\n2. Helping Fellow Muslims:\nThe Prophet ﷺ said: \"Whoever fulfills the needs of his brother, Allah will fulfill his needs. Whoever removes a worldly hardship from a believer, Allah will remove from him one of the hardships of the Day of Resurrection.\" (Bukhari & Muslim)\n\n3. Loving Them for Allah's Sake:\nThe Prophet ﷺ said: \"The strongest bond of faith is to love for the sake of Allah and to hate for the sake of Allah.\" (Abu Dawud - Sahih)\n\nThe Prophet ﷺ also said: \"On the Day of Resurrection, Allah will say: 'Where are those who loved each other for My glory? Today I will shade them in My shade on the day when there is no shade but Mine.'\" (Muslim)\n\n4. Advising Sincerely:\nThe Prophet ﷺ said: \"Religion is sincerity.\" We said: \"To whom?\" He said: \"To Allah, His Book, His Messenger, and to the leaders of the Muslims and their common folk.\" (Muslim)\n\n5. Not Harming Them:\nThe Prophet ﷺ said: \"A Muslim is a brother of another Muslim. He does not wrong him, nor does he forsake him, nor does he lie to him, nor does he hold him in contempt.\" (Muslim)\n\n6. Visiting the Sick:\nThe Prophet ﷺ said: \"Feed the hungry, visit the sick, and free the captives.\" (Bukhari)\n\nThe Prophet ﷺ said: \"When a Muslim visits his sick Muslim brother in the morning, seventy thousand angels make dua for him until the evening. And when he visits him in the evening, seventy thousand angels make dua for him until the morning, and he will be granted a garden in Paradise.\" (Tirmidhi - Hasan)\n\n7. Attending Funerals:\nThe Prophet ﷺ said: \"Whoever follows the funeral procession until he offers the funeral prayer for it, will get a reward equal to one Qirat, and whoever accompanies it till burial, will get a reward equal to two Qirats.\" Someone asked, \"What are two Qirats?\" He replied, \"Like two huge mountains.\" (Bukhari & Muslim)\n\n8. Accepting Invitations:\nThe Prophet ﷺ said: \"If any of you is invited, let him accept the invitation.\" (Muslim)\n\n9. Praying for Them in Their Absence:\nThe Prophet ﷺ said: \"The supplication of a Muslim for his brother in his absence will certainly be answered. Every time he makes a supplication for good for his brother, the angel appointed for this particular task says: 'Ameen! May it be for you, too.'\" (Muslim)\n\n10. Concealing Their Faults:\nThe Prophet ﷺ said: \"Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the Hereafter.\" (Muslim)\n\n11. Defending Their Honor:\nThe Prophet ﷺ said: \"Whoever defends the honor of his brother, Allah will protect his face from the Fire on the Day of Resurrection.\" (Tirmidhi - Sahih)\n\n12. Forgiving Their Mistakes:\nThe Prophet ﷺ said: \"Do not hate one another, do not envy one another, do not turn away from one another, but be servants of Allah as brothers. It is not permissible for a Muslim to forsake his brother for more than three days.\" (Bukhari & Muslim)\n\n13. Being Trustworthy:\nThe Prophet ﷺ said: \"The signs of a hypocrite are three: when he speaks, he lies; when he makes a promise, he breaks it; and when he is entrusted with something, he betrays that trust.\" (Bukhari & Muslim)\n\n14. Helping in Righteousness:\n\"And cooperate in righteousness and piety, but do not cooperate in sin and aggression. And fear Allah; indeed, Allah is severe in penalty.\" (Quran 5:2)\n\n15. Wishing Good for Them:\nThe Prophet ﷺ said: \"None of you truly believes until he loves for his brother what he loves for himself.\" (Bukhari & Muslim)\n\nWhat Breaks and Weakens Brotherhood - What to Avoid:\n\n1. Envy and Jealousy:\nThe Prophet ﷺ said: \"Beware of envy because envy consumes good deeds just as fire consumes wood or grass.\" (Abu Dawud - Sahih)\n\n2. Spying and Suspicion:\n\"O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other.\" (Quran 49:12)\n\nThe Prophet ﷺ said: \"Beware of suspicion, for suspicion is the worst of false tales.\" (Bukhari & Muslim)\n\n3. Backbiting and Gossip:\nThe Prophet ﷺ said: \"Do you know what backbiting is?\" They said: \"Allah and His Messenger know best.\" He said: \"It is to mention your brother in a way he dislikes.\" (Muslim)\n\n4. Hatred and Hostility:\nThe Prophet ﷺ said: \"Do not hate one another, do not envy one another, do not turn away from one another, but be servants of Allah as brothers.\" (Muslim)\n\n5. Breaking Promises:\nThe Prophet ﷺ said: \"The signs of a hypocrite are three: when he speaks, he lies; when he makes a promise, he breaks it; and when he is entrusted with something, he betrays that trust.\" (Bukhari & Muslim)\n\n6. Rejoicing at Their Misfortune:\nThe Prophet ﷺ warned against this behavior. Instead, we should feel sympathy and offer help.\n\n7. Competing in Worldly Matters:\nThe Prophet ﷺ said: \"There is no envy except in two cases: a person whom Allah has given wealth and he spends it in the right way, and a person whom Allah has given wisdom and he acts upon it and teaches it to others.\" (Bukhari & Muslim)\n\nLoving for Allah's Sake - The Highest Form of Love:\n\nThe Prophet ﷺ said: \"Seven people will be shaded by Allah on the Day when there will be no shade except His. Among them are: a just ruler, a young person who grew up in the worship of Allah, a man whose heart is attached to the mosque, two people who love each other for the sake of Allah—meeting for that purpose and parting upon it...\" (Bukhari & Muslim)\n\nThis is the purest form of love—loving someone not for their wealth, status, beauty, or benefit to you, but purely because they help you get closer to Allah.\n\nThe Prophet ﷺ said: \"A man set out to visit a brother in another town. Allah sent an angel to wait for him on the road. When the man came along, the angel asked: 'Where are you going?' He said: 'I am going to visit my brother in this town.' The angel said: 'Have you done any favor for him?' He said: 'No, except that I love him for the sake of Allah.' The angel said: 'I am a messenger to you from Allah to tell you that Allah loves you as you have loved your brother for His sake.'\" (Muslim)\n\nPractical Ways to Build and Strengthen Brotherhood:\n\n1. Regular Gatherings for Dhikr:\nThe Prophet ﷺ said: \"No people gather together in one of the houses of Allah, reciting the Book of Allah and studying it together, except that tranquility descends upon them, mercy covers them, angels surround them, and Allah mentions them amongst those who are with Him.\" (Muslim)\n\n2. Sharing Meals Together:\nThe Prophet ﷺ said: \"O people! Spread peace, feed the hungry, and pray at night when people are sleeping, and you will enter Paradise in peace.\" (Tirmidhi - Sahih)\n\n3. Exchanging Gifts:\nThe Prophet ﷺ said: \"Give gifts to one another and you will love one another.\" (Al-Adab Al-Mufrad - Sahih)\n\n4. Visiting One Another:\nThe Prophet ﷺ said: \"Whoever visits a sick person or visits a brother in faith, a caller announces: 'You are blessed, your walking is blessed, and you have made a dwelling in Paradise.'\" (Tirmidhi - Hasan)\n\n5. Making Dua for Each Other:\nMake sincere prayers for your brothers and sisters in their absence. The angels say \"Ameen, and for you the same.\"\n\n6. Helping in Times of Need:\nBe the first to help when a brother faces difficulty—financial, emotional, or spiritual.\n\n7. Celebrating Joys Together:\nShare in their happiness at weddings, births, achievements, and good news.\n\n8. Consoling in Sorrows:\nBe present during their difficulties, losses, and trials.\n\nUnity of the Ummah - Preserving Brotherhood on a Global Scale:\n\n\"And hold firmly to the rope of Allah all together and do not become divided.\" (Quran 3:103)\n\nThe Prophet ﷺ said: \"The believers, in their mutual love, mercy, and compassion, are like one body. If one part of it complains, the rest of the body responds with wakefulness and fever.\" (Bukhari & Muslim)\n\nModern Applications of Islamic Brotherhood:\n\n1. Supporting Muslim Communities Globally:\nFeel the pain of Muslims facing hardship anywhere in the world and help through charity, advocacy, and dua.\n\n2. Building Local Muslim Communities:\nCreate strong bonds with Muslims in your mosque, school, and neighborhood.\n\n3. Mentorship and Youth Development:\nOlder Muslims should mentor younger ones, strengthening generational bonds.\n\n4. Professional Networking:\nHelp fellow Muslims find jobs, business opportunities, and career growth.\n\n5. Marriage and Family Support:\nHelp single Muslims find spouses and support families in need.\n\n6. Educational Support:\nShare knowledge, tutor students, and help with scholarships.\n\n7. Digital Brotherhood:\nUse technology to stay connected, share knowledge, and support each other online while maintaining Islamic etiquette.\n\nThe Ultimate Goal - Paradise Together:\n\nThe Prophet ﷺ said: \"A man will be with those whom he loves.\" (Bukhari & Muslim)\n\nWhen a man asked the Prophet ﷺ about the Hour, the Prophet asked: \"What have you prepared for it?\" He said: \"Nothing, except that I love Allah and His Messenger.\" The Prophet ﷺ said: \"You will be with those whom you love.\" (Bukhari & Muslim)\n\nAnas (the narrator) said: \"We have never been more pleased than when the Prophet ﷺ said: 'You will be with those whom you love.' I love the Prophet, Abu Bakr, and Umar, and I hope that I will be with them because of my love for them, even though I have not done deeds like theirs.\"\n\nConclusion - The Strength of Muslim Brotherhood:\n\nIslamic brotherhood is not just a nice idea—it's a practical system that, when implemented, creates the strongest, most compassionate, and most resilient communities on earth. It transforms strangers into family, weakness into strength, and isolation into belonging.\n\nThe Prophet ﷺ said: \"The believer is to another believer like a building whose parts support each other.\" (Bukhari & Muslim)\n\nWhen Muslims truly understand and practice Ukhuwwah, they become unstoppable in goodness, mercy, and positive impact on the world.",
        "ur": "مسلم بھائی چارہ (اخوت)\n\nتمام مسلمان ایمان میں بھائی بہن ہیں۔\n\nاسلام کا رشتہ:\n• \"مومن آپس میں بھائی ہیں، تو اپنے بھائیوں میں صلح کراؤ۔\" (قرآن 49:10)\n• اسلامی بھائی چارہ نسل، قومیت اور قبیلے سے بالاتر ہے\n• خونی رشتوں سے مضبوط\n• نبی کریم ﷺ نے مہاجرین اور انصار کے درمیان بھائی چارہ قائم کیا\n\nمسلمان بھائیوں کے حقوق:\n• ضرورت کے وقت مدد کریں\n• بیماری میں ملاقات کریں\n• ان کے جنازے میں شرکت کریں\n• ان کی دعوتیں قبول کریں\n• مخلصانہ نصیحت کریں\n• اللہ کی خاطر ان سے محبت کریں\n• ان کی غیر موجودگی میں ان کے لیے دعا کریں\n\nنبی کریم ﷺ کی تشبیہ:\n• \"مومنوں کی مثال ان کی محبت، رحمت اور شفقت میں جسم کی طرح ہے۔ جب کوئی عضو درد کرتا ہے تو پورا جسم بے خوابی اور بخار سے متاثر ہوتا ہے۔\" (بخاری و مسلم)\n• \"مسلمان دوسرے مسلمان کا بھائی ہے۔ وہ اس پر ظلم نہیں کرتا، نہ ضرورت کے وقت اسے چھوڑتا ہے۔\" (مسلم)\n\nکیا نہ کریں:\n• ان سے حسد نہ کریں\n• ان کی جاسوسی نہ کریں\n• ان کی غیبت نہ کریں\n• ان سے نفرت نہ کریں\n• دنیاوی معاملات میں مقابلہ نہ کریں\n• ان سے وعدے نہ توڑیں\n• ان کی مصیبت پر خوش نہ ہوں\n\nاللہ کی خاطر محبت:\n• نبی کریم ﷺ نے فرمایا: \"اللہ قیامت کے دن فرمائے گا: 'کہاں ہیں وہ جو میری خاطر ایک دوسرے سے محبت کرتے تھے؟ آج میں انہیں اپنے سائے میں جگہ دوں گا جس دن میرے سائے کے سوا کوئی سایہ نہیں۔'\" (مسلم)\n• محبت کی سب سے پاک صورت\n• آخرت میں بھی جاری رہتی ہے\n• نیکی اور ایمان پر مبنی\n\nبھائی چارہ بنانا:\n• اللہ کی یاد کے لیے باقاعدہ اجتماعات\n• ساتھ کھانا کھانا\n• ضرورت کے وقت مدد کرنا\n• خوشیاں ساتھ منانا\n• غموں میں تسلی دینا\n• ایک دوسرے کے لیے دعا کرنا\n• تحائف دینا محبت بڑھاتا ہے\n\nامت کی وحدت:\n• تقسیم نہ کریں\n• اندھا دھند مختلف فرقوں کی پیروی نہ کریں\n• قرآن اور سنت کی طرف لوٹیں\n• اختلاف رائے کا احترام کریں\n• مشترکہ بھلائی کے لیے مل کر کام کریں\n• \"اور اللہ کی رسی کو مضبوطی سے تھامو اور تفرقہ نہ ڈالو۔\" (قرآن 3:103)",
        "hi": "मुस्लिम भाईचारा (उख़ुव्वत)\n\nतमाम मुसलमान ईमान में भाई बहन हैं।\n\nइस्लाम का रिश्ता:\n• \"मोमिन आपस में भाई हैं, तो अपने भाइयों में सुलह कराओ।\" (क़ुरआन 49:10)\n• इस्लामी भाईचारा नस्ल, क़ौमियत और क़बीले से बालातर है\n• ख़ूनी रिश्तों से मज़बूत\n• नबी करीम ﷺ ने मुहाजिरीन और अंसार के दरमियान भाईचारा क़ायम किया\n\nमुसलमान भाइयों के हुक़ूक़:\n• ज़रूरत के वक़्त मदद करें\n• बीमारी में मुलाक़ात करें\n• उनके जनाज़े में शिरकत करें\n• उनकी दावतें क़बूल करें\n• मुख़्लिसाना नसीहत करें\n• अल्लाह की ख़ातिर उनसे मोहब्बत करें\n• उनकी ग़ैर मौजूदगी में उनके लिए दुआ करें\n\nनबी करीम ﷺ की तशबीह:\n• \"मोमिनों की मिसाल उनकी मोहब्बत, रहमत और शफ़क़त में जिस्म की तरह है। जब कोई उज़्व दर्द करता है तो पूरा जिस्म बेख़्वाबी और बुख़ार से मुतास्सिर होता है।\" (बुख़ारी व मुस्लिम)\n• \"मुसलमान दूसरे मुसलमान का भाई है। वो उस पर ज़ुल्म नहीं करता, न ज़रूरत के वक़्त उसे छोड़ता है।\" (मुस्लिम)\n\nक्या न करें:\n• उनसे हसद न करें\n• उनकी जासूसी न करें\n• उनकी ग़ीबत न करें\n• उनसे नफ़रत न करें\n• दुनियावी मुआमलात में मुक़ाबला न करें\n• उनसे वादे न तोड़ें\n• उनकी मुसीबत पर ख़ुश न हों\n\nअल्लाह की ख़ातिर मोहब्बत:\n• नबी करीम ﷺ ने फ़रमाया: \"अल्लाह क़यामत के दिन फ़रमाएगा: 'कहां हैं वो जो मेरी ख़ातिर एक दूसरे से मोहब्बत करते थे? आज मै�� उन्हें अपने साए में जगह दूंगा जिस दिन मेरे साए के सिवा कोई साया नहीं।'\" (मुस्लिम)\n• मोहब्बत की सबसे पाक सूरत\n• आख़िरत में भी जारी रहती है\n• नेकी और ईमान पर मबनी\n\nभाईचारा बनाना:\n• अल्लाह की याद के लिए बाक़ायदा इजतिमाआत\n• साथ खाना खाना\n• ज़रूरत के वक़्त मदद करना\n• ख़ुशियां साथ मनाना\n• ग़मों में तसल्ली देना\n• एक दूसरे के लिए दुआ करना\n• तोहफ़े देना मोहब्बत बढ़ाता है\n\nउम्मत की वहदत:\n• तक़सीम न करें\n• अंधा धुंध मुख़्तलिफ़ फ़िर्क़ों की पैरवी न करें\n• क़ुरआन और सुन्नत की तरफ़ लौटें\n• इख़्तिलाफ़ राय का एहतराम करें\n• मुश्तरका भलाई के लिए मिलकर काम करें\n• \"और अल्लाह की रस्सी को मज़बूती से थामो और तफ़र्क़ा न डालो।\" (क़ुरआन 3:103)",
        "ar": "الأخوة الإسلامية\n\nحقوق المسلم على المسلم.\n\nمعنى الأخوة:\n• \"إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ\" (سورة الحجرات: 10)\n• رابطة الإيمان أقوى من رابطة النسب\n• المؤمنون كالجسد الواحد\n• قال النبي ﷺ: \"المؤمن للمؤمن كالبنيان يشد بعضه بعضاً\" (البخاري)\n\nحقوق الأخوة:\n• رد السلام\n• إجابة الدعوة\n• تشميت العاطس\n• عيادة المريض\n• اتباع الجنازة\n• نصرة المظلوم\n\nالمحبة في الله:\n• قال النبي ﷺ: \"سبعة يظلهم الله في ظله... ورجلان تحابا في الله\" (البخاري)\n• أعلى درجات الإيمان\n• سبب لمحبة الله\n• \"وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ\" (سورة الحشر: 9)\n\nالنصيحة:\n• قال النبي ﷺ: \"الدين النصيحة\" (مسلم)\n• نصح الأخ من المحبة\n• بالحكمة والموعظة الحسنة\n• سراً لا علانية\n\nالتكافل الاجتماعي:\n• مساعدة المحتاج\n• إعانة الضعيف\n• قضاء حوائج المسلمين\n• \"وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ\" (سورة المائدة: 2)"
      }
    },
    {
      "step": 5,
      "title_key": "relative_fazilat_5_inheritance_family_wealth",
      "title": {
        "en": "Inheritance & Family Wealth",
        "ur": "وراثت اور خاندانی دولت",
        "hi": "विरासत और ख़ानदानी दौलत",
        "ar": "الميراث والمال العائلي"
      },
      "icon": "circle",
      "color": "amber",
      "details": {
        "en": "Inheritance & Family Wealth - The Divine System of Justice\n\nIslamic inheritance law (Ilm al-Faraid) is one of the most detailed and sophisticated aspects of Islamic jurisprudence. Unlike human-made systems that change with time and culture, Islamic inheritance laws are fixed by Allah Himself, ensuring perfect justice for all family members across all times and places.\n\nThe Divine Command - Allah's Direct Legislation:\n\n\"For men is a share of what the parents and close relatives leave, and for women is a share of what the parents and close relatives leave, be it little or much—an obligatory share.\" (Quran 4:7)\n\nThis verse revolutionized inheritance by:\n• Guaranteeing women's right to inherit (unprecedented in pre-Islamic Arabia)\n• Making inheritance obligatory, not optional\n• Ensuring both rich and poor families distribute wealth justly\n• Preventing powerful family members from monopolizing wealth\n\n\"Allah instructs you concerning your children: for the male, what is equal to the share of two females.\" (Quran 4:11)\n\nThis verse begins a detailed explanation of inheritance shares, showing that Allah Himself legislated these laws—not the Prophet ﷺ, not scholars, but Allah directly.\n\nWhy Inheritance Laws are Fixed by Allah:\n\nThe Prophet ﷺ said: \"Give the obligatory shares to those who are entitled to them, and what remains goes to the nearest male heir.\" (Bukhari & Muslim)\n\nThe Prophet ﷺ also said: \"Indeed, Allah has given every deserving person his right. So there is no will for an heir.\" (Tirmidhi - Sahih)\n\nThis means:\n• You cannot change the shares Allah has determined\n• You cannot disinherit someone Allah has given a share\n• You cannot give extra inheritance to one heir over another\n• These laws are divine protection against human greed and injustice\n\nThe Severe Consequences of Violating Inheritance Laws:\n\n1. Allah's Direct Warning:\n\n\"And whoever disobeys Allah and His Messenger and transgresses His limits - He will put him into the Fire to abide eternally therein, and he will have a humiliating punishment.\" (Quran 4:14)\n\nThis verse comes immediately after the inheritance verses, showing the severity of violating these laws.\n\n2. Consuming the Wealth of Orphans:\n\n\"Indeed, those who devour the property of orphans unjustly are only consuming into their bellies fire. And they will be burned in a Blaze.\" (Quran 4:10)\n\nWhen someone dies, their minor children are orphans. Denying them their rightful inheritance is literally consuming fire.\n\n3. Injustice to Daughters:\n\n\"When news is brought to one of them of the birth of a female child, his face darkens, and he is filled with inward grief! With shame does he hide himself from his people, because of the bad news he has had! Shall he retain it on sufferance and contempt, or bury it in the dust? Ah! What an evil choice they decide on?\" (Quran 16:58-59)\n\nIslam came to elevate women's status. Denying daughters their inheritance contradicts the very spirit of Islam.\n\n4. Family Destruction:\n\nThe Prophet ﷺ said: \"Learn about inheritance and teach it to the people, for it is half of knowledge, and it will be forgotten. This will be the first thing to be taken away from my Ummah.\" (Tirmidhi - Hasan)\n\nMost family feuds and broken relationships stem from inheritance disputes. Following Islamic law prevents this.\n\nOverview of Islamic Inheritance Laws:\n\nFixed Shares (Fard):\nAllah has specified exact shares for:\n• Spouse: 1/4 or 1/2 depending on presence of children\n• Father: 1/6 when there are children\n• Mother: 1/6 or 1/3 depending on circumstances\n• Daughter(s): 1/2 for one daughter, 2/3 for two or more daughters\n• Son(s): Residuary heirs (take what remains after fixed shares)\n• Siblings: Various shares depending on other heirs\n• Grandparents, uncles, cousins: Specified shares in specific circumstances\n\nThe Wisdom of \"Male gets double the female\":\n\n\"Allah instructs you concerning your children: for the male, what is equal to the share of two females.\" (Quran 4:11)\n\nThis is often misunderstood. The wisdom includes:\n• Men are financially responsible for their wives, children, and sometimes extended family\n• Women keep their inheritance entirely for themselves—no obligation to spend it on family\n• Women receive mahr (dowry) upon marriage, which men don't receive\n• The husband must provide for his wife even if she's wealthy\n• Overall, when you calculate total wealth accumulation, women often end up with more\n\nExample: A brother and sister each inherit. The brother gets 2 shares, sister gets 1 share. But the brother must use his wealth to pay mahr for marriage, provide for his wife and children, and help needy relatives. The sister keeps her inheritance, receives mahr, is provided for by her husband, and has no financial obligations. The apparent difference balances out.\n\nIMPORTANT: The 2:1 Ratio is NOT Universal:\n\nMany people mistakenly believe that women always get half of what men get in Islamic inheritance. This is incorrect! The 2:1 ratio applies ONLY to children inheriting from their parents when both sons and daughters are present.\n\nThere are many cases where women receive EQUAL or even MORE than men:\n\n1. Mother vs Father: If a deceased person leaves only parents and a spouse, the mother inherits 1/3 while the father inherits 1/6 (mother gets DOUBLE the father's share!)\n\n2. Husband and Wife: A husband inherits 1/4 or 1/2 depending on children, while a wife inherits 1/8 or 1/4. But considering the husband must spend his entire wealth on the family while the wife keeps hers, she may end up wealthier overall.\n\n3. Daughters in certain scenarios: When there are only daughters and no sons, they receive 2/3 of the estate to share. If there's only one daughter, she gets 1/2.\n\n4. Uterine siblings: Brothers and sisters from the same mother get equal shares when inheriting from each other.\n\nThe variation in shares is based on financial responsibility, not gender value. Islam was the first religion to grant women inheritance rights 1400+ years ago, a revolutionary reform when women were not even considered human in many cultures!\n\nThe Rights of All Heirs - 10+ Quranic Verses on Inheritance:\n\n1. General Right to Inherit:\n\"For men is a share of what the parents and close relatives leave, and for women is a share of what the parents and close relatives leave, be it little or much—an obligatory share.\" (Quran 4:7)\n\n2. Children's Shares:\n\"Allah instructs you concerning your children: for the male, what is equal to the share of two females. But if there are more than two daughters, they share two-thirds of what he left. And if there is only one, for her is half. And for one's parents, to each one of them is a sixth of his estate if he left children.\" (Quran 4:11)\n\n3. Spouses' Shares:\n\"And for you is half of what your wives leave if they have no child. But if they have a child, for you is one fourth of what they leave, after any bequest they may have made or debt. And for the wives is one fourth if you leave no child. But if you leave a child, then for them is an eighth of what you leave, after any bequest you may have made or debt.\" (Quran 4:12)\n\n4. Siblings' Shares:\n\"If a man or woman leaves neither ascendants nor descendants but has a brother or a sister, then for each one of them is a sixth. But if they are more than two, they share a third, after any bequest which was made or debt, as long as there is no detriment. This is an ordinance from Allah, and Allah is Knowing and Forbearing.\" (Quran 4:12)\n\n5. The Finality of These Laws:\n\"These are the limits set by Allah. And whoever obeys Allah and His Messenger will be admitted to gardens beneath which rivers flow, abiding eternally therein; and that is the great attainment.\" (Quran 4:13)\n\n6. The Punishment for Violation:\n\"And whoever disobeys Allah and His Messenger and transgresses His limits - He will put him into the Fire to abide eternally therein, and he will have a humiliating punishment.\" (Quran 4:14)\n\n7. Kindness and Justice:\n\"And when [other] relatives and orphans and the needy are present at the [time of] division, then provide for them [something] out of the estate and speak to them words of appropriate kindness.\" (Quran 4:8)\n\nCommon Violations to Avoid:\n\n1. Depriving Daughters:\nIn some cultures, daughters don't receive their shares. This is a major sin. The Prophet ﷺ said: \"Whoever has three daughters, is patient with them, clothes them from his wealth—they will be a shield for him from the Fire.\" (Tirmidhi - Sahih) If daughters are so honored in life, how can we deny them their rights after death?\n\n2. Favoring Some Children Over Others:\nThe Prophet ﷺ said: \"Fear Allah and treat your children fairly.\" (Bukhari & Muslim) Giving preference to one child during life or through unequal distribution is unjust.\n\n3. Using Cultural Traditions Instead of Islamic Law:\nMany cultures have traditions that contradict Islam (only sons inherit, eldest son gets everything, etc.). The Prophet ﷺ said: \"Whoever introduces anything into this matter of ours that is not part of it will have it rejected.\" (Bukhari & Muslim)\n\n4. Delaying Distribution:\nSome families delay inheritance distribution for years or decades, causing hardship for heirs who need their shares. This is injustice and oppression.\n\n5. Hiding Assets:\nSome executors hide assets from other heirs. This is betrayal of trust and theft. \"Indeed, Allah commands you to render trusts to whom they are due.\" (Quran 4:58)\n\n6. Giving Inheritance to Non-Heirs:\nThe Prophet ﷺ said: \"Indeed Allah has appointed for everyone who has a right what is due to him, and no bequest must be made to an heir.\" (Tirmidhi - Sahih)\n\nThe Importance of Writing a Will (Wasiyyah):\n\nThe Prophet ﷺ said: \"It is not permissible for any Muslim who has something to will to stay for two nights without having his last will and testament written and kept ready with him.\" (Bukhari & Muslim)\n\nWhat Can You Include in a Will:\n\n1. Up to One-Third for Non-Heirs:\nYou can will up to 1/3 of your estate to:\n• Charity\n• Distant relatives who don't inherit\n• Friends\n• Islamic causes\n• Anyone except your heirs (they already have fixed shares)\n\n2. Executor Appointment:\nName someone trustworthy to execute your will and distribute inheritance according to Islamic law.\n\n3. Funeral Arrangements:\nSimple, Sunnah-compliant funeral without extravagance.\n\n4. Debt Acknowledgment:\nList any debts you owe so they can be paid before inheritance distribution.\n\n5. Guardians for Minor Children:\nName guardians to care for your children if both parents pass away.\n\nWhat You CANNOT Do in a Will:\n\n• Will more than 1/3 of your estate\n• Give any portion to your heirs (they already have Allah-designated shares)\n• Disinherit someone entitled to inheritance\n• Contradict Islamic inheritance laws in any way\n\nThe Order of Inheritance Distribution:\n\n1. Funeral Expenses: Simple, dignified Islamic burial\n2. Outstanding Debts: All debts must be paid first\n3. Bequests: Up to 1/3 for non-heirs\n4. Inheritance: Remaining estate divided according to Islamic law\n\nAvoiding Family Disputes Over Inheritance:\n\n1. Get a Proper Islamic Inheritance Calculation:\nConsult qualified Islamic scholars or use verified Islamic inheritance calculators to ensure proper distribution.\n\n2. Distribute Promptly:\nDon't delay. Heirs have immediate rights to their shares.\n\n3. Transparent Accounting:\nProvide clear documentation of all assets, debts, and calculations to all heirs.\n\n4. Mediation by Respected Elders:\nIf disagreements arise, involve trusted family elders or Islamic scholars to mediate.\n\n5. Remember the Hereafter:\nGreed for worldly wealth that belongs to others is foolish when you'll face Allah soon.\n\nFamily Wealth Ethics Beyond Inheritance:\n\n1. Spending on Poor Relatives:\nThe Prophet ﷺ said: \"Charity to the poor is charity, but charity to a relative is two things: charity and upholding the ties of kinship.\" (Tirmidhi - Sahih)\n\n2. Fair Distribution During Life:\nThe Prophet ﷺ said: \"Fear Allah and be just among your children.\" (Bukhari & Muslim) Give gifts equally during your lifetime.\n\n3. Not Letting Wealth Create Divisions:\nRich family members shouldn't look down on poor ones. Poor ones shouldn't envy the rich. \"And lower your wing to those who follow you of the believers.\" (Quran 26:215)\n\n4. Teaching Children About Halal Wealth:\n\"O you who have believed, indeed, intoxicants, gambling, [sacrificing on] stone altars [to other than Allah], and divining arrows are but defilement from the work of Satan, so avoid it that you may be successful.\" (Quran 5:90) Earn and spend only halal.\n\n5. Avoiding Extravagance and Miserliness:\n\"And those who, when they spend, do so not excessively or sparingly but are ever, between that, [justly] moderate.\" (Quran 25:67)\n\nReal-Life Scenarios and Solutions:\n\nScenario 1: Parents want to give their house to only one son who cared for them.\nSolution: This is not permissible. All heirs must receive their Islamic shares. The caring son can be compensated during the parents' lifetime as a gift (which should still be fair to other children), but inheritance must follow Islamic law.\n\nScenario 2: A wealthy man has one daughter and wants to give everything to her.\nSolution: The daughter gets her fixed share (1/2 as the only daughter). The remainder goes to other eligible heirs (his parents, siblings, etc.). He can give her extra during his lifetime or will up to 1/3 to her if she's not an heir at the time of death.\n\nScenario 3: Family members want to voluntarily give up their shares to help a needy sibling.\nSolution: This is permissible AFTER they receive their shares and voluntarily, without pressure, give it as a gift to the needy sibling.\n\nThe Ultimate Perspective:\n\nAllah says: \"You know not whether your parents or your children are nearest to you in benefit. [These shares are] an obligation [imposed] by Allah. Indeed, Allah is ever Knowing and Wise.\" (Quran 4:11)\n\nWe don't know who will benefit us most before Allah—maybe the child we thought was least successful will be the one whose prayers save us in the grave. So trust Allah's distribution system.\n\nThe Prophet ﷺ said: \"Whoever would like Allah to save him from the hardships of the Day of Resurrection, let him give more time to his debtor who is in difficulty, or let him write off the debt.\" (Muslim)\n\nGive up some wealth now to gain eternal rewards. Don't destroy family bonds over temporary worldly possessions that you'll leave behind anyway.\n\nConclusion:\n\nInheritance law is where family bonds are either strengthened or shattered. By following Allah's perfect system, we protect relationships, ensure justice, and earn divine pleasure. Violating it brings Allah's anger, family destruction, and Hellfire.\n\nMake your will today. Learn Islamic inheritance law. Teach it to your family. Ensure justice for all heirs. This is half of knowledge, as the Prophet ﷺ said, and protecting it protects the Ummah.",
        "ur": "وراثت اور خاندانی دولت\n\nاسلامی وراثت کے قوانین خاندانی بندھن کو محفوظ رکھتے اور انصاف کو یقینی بناتے ہیں۔\n\nالٰہی تقسیم:\n• \"مردوں کے لیے حصہ ہے جو والدین اور قریبی رشتہ دار چھوڑیں، اور عورتوں کے لیے بھی حصہ ہے جو والدین اور قریبی رشتہ دار چھوڑیں۔\" (قرآن 4:7)\n• وراثت کے قوانین اللہ نے مقرر کیے ہیں\n• اختیاری یا کسی کے ذریعہ تبدیل نہیں کیے جا سکتے\n• ان کی خلاف ورزی کبیرہ گناہوں میں سے ہے\n\nاسلامی قانون کی پیروی کی اہمیت:\n• نبی کریم ﷺ نے فرمایا: \"حصے حقداروں کو دو، اور جو بچے وہ قریب ترین مرد وارث کو جائے۔\" (بخاری و مسلم)\n• تمام خاندانی اراکین کے حقوق کی حفاظت\n• جھگڑوں اور ناانصافی سے بچاتا ہے\n• عورتوں کے حقوق کی ضمانت\n\nعام خلاف ورزیاں جن سے بچنا چاہیے:\n• بیٹیوں کو ان کے حصے سے محروم کرنا\n• ایک بچے کو دوسرے پر ترجیح دینا\n• اسلامی قانون کی بجائے ثقافتی روایات استعمال کرنا\n• وراثت کی تقسیم میں تاخیر\n• حقدار وارثوں سے اثاثے چھپانا\n\nناانصافی کا گناہ:\n• \"بیشک جو یتیموں کا مال ناحق کھاتے ہیں وہ اپنے پیٹ میں صرف آگ بھرتے ہیں۔\" (قرآن 4:10)\n• کسی کا حق لینا شدید ظلم ہے\n• قیامت کے دن جوابدہ ہوں گے\n• خاندانی رشتوں کو تباہ کر سکتا ہے\n\nاپنی وصیت تیار کرنا:\n• اسلامی قانون کے مطابق وصیت لکھیں\n• اپنی جائیداد کے 1/3 سے زیادہ کی وصیت نہیں کر سکتے\n• وارث کو وراثت نہیں دے سکتے (ان کے پہلے سے مقررہ حصے ہیں)\n• 1/3 غیر وارثوں کے لیے ہے (صدقہ، دور کے رشتہ دار وغیرہ)\n• نبی کریم ﷺ نے فرمایا: \"کسی بھی مسلمان کے لیے جس کے پاس وصیت کرنے کی کوئی چیز ہو، دو راتیں گزارنا جائز نہیں کہ اس کی وصیت لکھی ہوئی نہ ہو۔\" (بخاری و مسلم)\n\nاتحاد برقرار رکھنا:\n• وراثت فوری طور پر تقسیم کریں\n• اپنے حصے پر مطمئن رہیں\n• دولت پر مقابلہ یا جھگڑا نہ کریں\n• یاد رکھیں: \"تم اسے دوسروں کے لیے چھوڑ جاؤ گے\"\n• جھگڑے پیدا ہونے سے پہلے صلح کریں\n• واضح نہ ہو تو اسلامی علماء سے مدد لیں\n\nخاندانی دولت کی رہنمائی:\n• پہلے غریب رشتہ داروں پر خرچ کریں\n• دولت کے فرق کی وجہ سے رشتے نہ توڑیں\n• امیر غریب خاندانی اراکین کی مدد کریں\n• دولت کا دکھاوا کرنے سے بچیں\n• بچوں کو دولت کے صحیح انتظام کے بارے میں سکھائیں\n• صرف حلال آمدنی کمائیں",
        "hi": "विरासत और ख़ानदानी दौलत\n\nइस्लामी विरासत के क़वानीन ख़ानदानी बंधन को महफ़ूज़ रखते और इंसाफ़ को यक़ीनी बनाते हैं।\n\nइलाही तक़सीम:\n• \"मर्दों के लिए हिस्सा है जो वालिदैन और क़रीबी रिश्तेदार छोड़ें, और औरतों ��े लिए भी हिस्सा है जो वालिदैन और क़रीबी रिश्तेदार छोड़ें।\" (क़ुरआन 4:7)\n• विरासत के क़वानीन अल्लाह ने मुक़र्रर किए हैं\n• इख़्तियारी या किसी के ज़रीआ तबदील नहीं किए जा सकते\n• उनकी ख़िलाफ़वर्ज़ी कबीरा गुनाहों में से है\n\nइस्लामी क़ानून की पैरवी की अहमियत:\n• नबी करीम ﷺ ने फ़रमाया: \"हिस्से हक़दारों को दो, और जो बचे वो क़रीबतरीन मर्द वारिस को जाए।\" (बुख़ारी व मुस्लिम)\n• तमाम ख़ानदानी अराकीन के हुक़ूक़ की हिफ़ाज़त\n• झगड़ों और नाइंसाफ़ी से बचाता है\n• औरतों के हुक़ूक़ की ज़मानत\n\nआम ख़िलाफ़वर्ज़ियां जिनसे बचना चाहिए:\n• बेटियों को उनके हिस्से से महरूम करना\n• एक बच्चे को दूसरे पर तरजीह देना\n• इस्लामी क़ानून की बजाए सक़ाफ़ती रिवायतें इस्तेमाल करना\n• विरासत की तक़सीम में तअख़ीर\n• हक़दार वारिसों से असासे छुपाना\n\nनाइंसाफ़ी का गुनाह:\n• \"बेशक जो यतीमों का माल नाहक़ खाते हैं वो अपने पेट में सिर्फ़ आग भरते हैं।\" (क़ुरआन 4:10)\n• किसी का हक़ लेना शदीद ज़ुल्म है\n• क़यामत के दिन जवाबदेह होंगे\n• ख़ानदानी रिश्तों को तबाह कर सकता है\n\nअपनी वसीयत तैयार करना:\n• इस्लामी क़ानून के मुताबिक़ वसीयत लिखें\n• अपनी जायदाद के 1/3 से ज़्यादा की वसीयत नहीं कर सकते\n• वारिस को विरासत नहीं दे सकते (उनके पहले से मुक़र्ररा हिस्से हैं)\n• 1/3 ग़ैर वारिसों के लिए है (सदक़ा, दूर के रिश्तेदार वग़ैरह)\n• नबी करीम ﷺ ने फ़रमाया: \"किसी भी मुसलमान के लिए जिसके पास वसीयत करने की कोई चीज़ हो, दो रातें गुज़ारना जाइज़ नहीं कि उसकी वसीयत लिखी हुई न हो।\" (बुख़ारी व मुस्लिम)\n\nइत्तेहाद बरक़रार रखना:\n• विरासत फ़ौरन तक़सीम करें\n• अपने हिस्से पर मुतमइन रहें\n• दौलत पर मुक़ाबला या झगड़ा न करें\n• याद रखें: \"तुम इसे दूसरों के लिए छोड़ जाओगे\"\n• झगड़े पैदा होने से पहले सुलह करें\n• वाज़ेह न हो तो इस्लामी उलमा से मदद लें\n\nख़ानदानी दौलत की रहनुमाई:\n• पहले ग़रीब रिश्तेदारों पर ख़र्च करें\n• दौलत के फ़र्क़ की वजह से रिश्ते न तोड़ें\n• अमीर ग़रीब ख़ानदानी अराकीन की मदद करें\n• दौलत का दिखावा करने से बचें\n• बच्चों को दौलत के सही इंतिज़ाम के बारे में सिखाएं\n• सिर्फ़ हलाल आमदनी कमाएं",
        "ar": "الميراث والمال العائلي\n\nأحكام الميراث وحقوق الورثة.\n\nأهمية الميراث:\n• \"لِّلرِّجَالِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ\" (سورة النساء: 7)\n• نظام إلهي عادل\n• حفظ حقوق الورثة\n• منع الظلم والخلافات\n\nتقسيم الميراث:\n• يقسم حسب الشرع\n• لكل وارث نصيبه المقدر\n• \"تِلْكَ حُدُودُ اللَّهِ\" (سورة النساء: 13)\n• عدم التلاعب بالأنصبة\n\nالوصية:\n• جائزة في حدود الثلث\n• لا وصية لوارث\n• قال النبي ﷺ: \"إن الله أعطى كل ذي حق حقه فلا وصية لوارث\" (الترمذي)\n\nحق البنات:\n• \"لِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْنِ\" (سورة النساء: 11)\n• للبنات نصيب مقرر\n• منع حرمانهن من الميراث\n• العدل بين الورثة\n\nتجنب الخلافات:\n• الصلح خير\n• الرضا بحكم الله\n• الابتعاد عن الطمع\n• طلب الفتوى من أهل العلم"
      }
    },
    {
      "step": 6,
      "title_key": "relative_fazilat_6_breaking_family_ties",
      "title": {
        "en": "Breaking Family Ties",
        "ur": "خاندانی تعلقات توڑنا",
        "hi": "ख़ानदानी तअल्लुक़ात तोड़ना",
        "ar": "قطع صلة الرحم"
      },
      "icon": "circle",
      "color": "red",
      "details": {
        "en": "Breaking Family Ties (Qat ar-Rahm) - The Seventh Greater Sin\n\nSevering family ties (Qat ar-Rahm) is among the most severe sins in Islam, carrying consequences in this world and devastating punishment in the Hereafter. Islamic scholars classify it as the Seventh Greater Sin (Kabira) - one of the major sins that require sincere repentance. It's so serious that Allah mentions it alongside the worst transgressions, and the Prophet ﷺ gave it special emphasis in numerous authentic Hadith.\n\nWhat Exactly is Qat ar-Rahm?\n\nQat ar-Rahm means \"cutting the womb\" - severing the sacred bonds of kinship. This includes:\n• Completely cutting off communication with relatives\n• Refusing to visit or maintain contact\n• Harboring hatred and enmity toward family members\n• Failing to fulfill their rights\n• Abandoning them in times of need\n• Not forgiving them or seeking reconciliation\n\nEven neglecting family ties (not completely severing, but being negligent) is blameworthy, though severing is the major sin.\n\nThe Severe Quranic Warnings - 15+ Verses About This Sin:\n\n1. The Direct Curse of Allah:\n\n\"So would you perhaps, if you turned away, cause corruption on earth and sever your [ties of] relationship? Those [who do so] are the ones that Allah has cursed, so He deafened them and blinded their vision.\" (Quran 47:22-23)\n\nThis verse shows:\n• Breaking family ties leads to corruption on earth\n• It earns Allah's curse (La'nah)\n• It causes spiritual deafness (unable to hear truth)\n• It causes spiritual blindness (unable to see guidance)\n\n2. Connected to the Gravest Sins:\n\n\"And those who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and cause corruption on earth. It is those who are the losers.\" (Quran 2:27)\n\nBreaking family ties is mentioned alongside breaking covenant with Allah—showing its gravity.\n\n\"And those who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and spread corruption on earth—for them is the curse, and they will have the worst home.\" (Quran 13:25)\n\nThe \"worst home\" is Hellfire.\n\n3. Among the Qualities Allah Hates Most:\n\n\"Then, do those who have believed not know that if Allah had willed, He could have guided all the people? And those who disbelieve do not cease to be struck, for what they have done, by calamity—or it will descend near their home—until there comes the promise of Allah. Indeed, Allah does not fail in His promise.\" (Quran 13:31)\n\nThe scholars explain this includes those who break family ties—calamity strikes them.\n\nThe Authentic Prophetic Warnings - 15+ Hadith:\n\n1. No Entry to Paradise:\n\nThe Prophet ﷺ said: \"The one who severs the ties of kinship will not enter Paradise.\" (Bukhari & Muslim)\n\nThis is one of the clearest, most authentic statements. Some scholars say the person won't enter initially (severe delay), others say if they die unrepentant, they may be barred entirely until they're purified in Hell.\n\n2. One of the Quickest Sins to Be Punished:\n\nThe Prophet ﷺ said: \"There is no sin more deserving of having its punishment hastened in this world, in addition to what is reserved for its perpetrator in the Hereafter, than oppression and severing the ties of kinship.\" (Tirmidhi & Abu Dawud - Sahih)\n\nThis means you'll see worldly punishment (loss of blessings, problems, difficulties) BEFORE you even face Hellfire.\n\n3. Deeds Not Accepted:\n\nThe Prophet ﷺ said: \"The deeds of the children of Adam are presented every Thursday night (to Allah), and the deeds of one who severs family ties are not accepted.\" (Ahmad - Sahih)\n\nImagine: your prayers, fasting, charity—all rejected because you've severed family ties!\n\n4. Ar-Rahim (The Womb) Speaks to Allah:\n\nThe Prophet ﷺ said: \"Allah created the creation, and when He finished it, Ar-Rahim (the womb, i.e., family ties) got up and caught hold of Allah. Allah said: 'Stop! What do you want?' It said: 'I seek refuge with You from those who sever ties.' Allah said: 'Would you be pleased if I keep good relations with those who keep good relations with you, and sever relations with those who sever relations with you?' It said: 'Yes, O my Lord!' Allah said: 'Then that is for you.'\" (Bukhari & Muslim)\n\nThis powerful Hadith shows:\n• Allah personally maintains ties with those who maintain family ties\n• Allah severs ties with those who sever family ties\n• The womb (symbol of family bonds) has such honor that it \"speaks\" to Allah\n\n5. Deeds Won't Ascend to Allah:\n\nThe Prophet ﷺ said: \"Deeds are presented on Mondays and Thursdays, and I love that my deeds be presented while I am fasting.\" (Tirmidhi - Sahih)\n\nBut in another narration: \"The gates of Paradise are opened on Mondays and Thursdays, and every servant who does not associate anything with Allah is forgiven, except for a man who has enmity between him and his brother. It is said: 'Delay these two until they reconcile.'\" (Muslim)\n\n6. Mercy is Withheld:\n\nThe Prophet ﷺ said: \"Mercy will not descend upon people among whom there is one who severs ties of kinship.\" (Bayhaqi - Sahih)\n\nYour entire community loses Allah's mercy because of one person's sin!\n\n7. The Angels Announce It:\n\nThe Prophet ﷺ said: \"No people sit in a gathering in which they do not remember Allah and send blessings upon the Prophet without it being a source of regret for them. If Allah wills, He will punish them, and if He wills, He will forgive them.\" (Tirmidhi - Hasan)\n\nSimilarly, when someone severs ties, it's announced in the heavens as a major transgression.\n\nWhat Exactly Breaks Family Ties - Detailed Explanation:\n\n1. Complete Severance of Communication:\nNot calling, messaging, visiting, or responding to their attempts to communicate. This is the clearest form.\n\n2. Refusing to Visit or Receive Visits:\nWhen they come to your home and you don't receive them, or when they invite you and you refuse without valid excuse.\n\n3. Harboring Deep Hatred and Enmity:\nEven if you maintain minimal contact but your heart is filled with hatred, you're breaking the true bond.\n\n4. Not Helping in Times of Genuine Need:\nWhen they're sick, poor, or in crisis and you have the ability to help but refuse.\n\n5. Ignoring Their Rights:\nNot attending their weddings, funerals, or major life events. Not fulfilling their Islamic rights upon you.\n\n6. Speaking Badly About Them:\nBackbiting, slandering, spreading their secrets, or destroying their reputation.\n\n7. Rejoicing at Their Misfortune:\nBeing happy when calamity strikes them. This is a sign of deep spiritual sickness.\n\n8. Not Defending Them When Others Attack Them:\nAllowing others to backbite or harm them without defending them.\n\n9. Cutting Them Off Over Trivial Matters:\nSmall arguments, minor disagreements, or perceived slights that you allow to destroy the relationship.\n\n10. Preferring Others Over Them:\nMaintaining relationships with friends while cutting off family—showing where your priorities truly lie.\n\nCommon Excuses That Don't Justify Breaking Ties:\n\n1. \"They wronged me first\":\nThe Prophet ﷺ addressed this directly. True kinship is continuing despite being cut off.\n\n2. \"They're difficult and toxic\":\nDifficult doesn't mean cut off completely. Maintain from a distance, send gifts through others, make dua.\n\n3. \"I'm too busy\":\nYou're never too busy for what you prioritize. A 2-minute phone call monthly isn't too busy.\n\n4. \"They don't respect me\":\nRespect is earned, but family ties are obligatory regardless of respect.\n\n5. \"We had a major argument\":\nArguments happen in every relationship. Reconciliation is mandatory, not optional.\n\n6. \"They don't practice Islam properly\":\nYou maintain ties hoping they'll be guided by your good character, not cut them off in arrogance.\n\n7. \"My spouse doesn't like them\":\nYour spouse doesn't have the right to order you to break family ties. This is a sin they cannot demand.\n\n8. \"I feel hurt and betrayed\":\nFeelings are valid, but they don't override divine commands. Seek healing while maintaining minimal ties.\n\nHow Long is Too Long - The Islamic Timeline:\n\nThe Prophet ﷺ said: \"It is not permissible for a Muslim to forsake his brother for more than three days. They meet and this one turns away and that one turns away. The better of the two is the one who is first to give greetings.\" (Bukhari & Muslim)\n\nThis is for general Muslims. For relatives:\n• Some scholars say even 3 days is too long for close family\n• Others say you should reconcile before the next obligatory prayer if possible\n• The safer opinion: Reconcile immediately, don't let the sun set on your anger\n\nThe Prophet ﷺ warned: \"Whoever deserts his brother for a year is like one who sheds his blood.\" (Abu Dawud - Sahih)\n\nOne year of silence = symbolically like murder!\n\nStories and Examples - Real Consequences:\n\nStory 1: The Man Who Died Unforgiven\n\nA man came to the Prophet ﷺ asking about his father who died while severing family ties. The Prophet ﷺ told him to give charity on his behalf and keep making dua, but couldn't guarantee forgiveness. This shows even death doesn't erase this sin automatically.\n\nStory 2: The Woman Denied Paradise\n\nA woman prayed all night and fasted all day but harmed her neighbors with her tongue. The Prophet ﷺ said she's in Hell. Similarly, no worship compensates for severing family ties.\n\nStory 3: The Blessed Reconciliation\n\nTwo brothers didn't speak for years over an inheritance dispute. One fell terminally ill. The other rushed to his bedside, they reconciled crying, and the sick brother recovered miraculously. The family witnessed the barakah of reconciliation.\n\nThe Path to Repentance and Reconciliation - Step-by-Step Guide:\n\nStep 1: Recognize the Severity\nUnderstand you're committing a major sin that can lead to Hellfire. This realization motivates change.\n\nStep 2: Sincere Repentance to Allah\nMake Tawbah: \"O Allah, I have wronged myself by severing ties with my family. I repent to You sincerely. Forgive me and help me reconnect.\"\n\nStep 3: Don't Wait for Them\nThe Prophet ﷺ said the better of two is the one who initiates reconciliation. Be that person.\n\nStep 4: Practical Steps to Reconnect:\n\nOption A - Direct Approach:\n• Call them: \"Assalamu alaikum, I've been thinking about you and wanted to check how you're doing.\"\n• Visit them: Show up with a gift or food\n• Write a letter/message: \"I'm sorry for the distance between us. Can we please reconnect?\"\n\nOption B - Indirect Approach (if direct is too difficult):\n• Send gifts through a third party\n• Send Salam through mutual family members\n• Attend family gatherings where they'll be present\n• Make dua for them publicly so they hear about it\n\nStep 5: Be Humble and Apologize\nEven if you feel you were right, prioritize the relationship over your ego. The Prophet ﷺ said: \"I guarantee a house in Paradise for one who gives up arguing even if he is right.\" (Abu Dawud - Sahih)\n\nStep 6: Don't Bring Up Past Grievances\nFocus on moving forward, not rehashing old wounds. \"Let's start fresh for Allah's sake.\"\n\nStep 7: Make It About Allah, Not You\n\"I realized that our broken relationship is displeasing to Allah, and I don't want to meet Him with this sin. Can we please reconcile for His sake?\"\n\nStep 8: Be Patient and Persistent\nIf they reject your first attempt, don't give up. Try again in a few weeks. Keep trying.\n\nStep 9: Involve Respected Family Elders\nAsk a respected elder (parents, grandparents, uncle, etc.) to mediate reconciliation.\n\nStep 10: Make Consistent Dua\n\"O Allah, soften their heart toward me and mine toward them. Make us reconcile for Your pleasure.\"\n\nIf They Refuse Your Attempts - Your Status Before Allah:\n\nThe Prophet ﷺ said: \"The one who maintains family ties is not the one who reciprocates. Rather, the one who maintains ties is one who, when his relatives cut him off, he maintains ties with them.\" (Bukhari)\n\nIf you've sincerely tried multiple times and they refuse:\n• Keep sending occasional greetings and gifts\n• Don't cut them off in return\n• Make dua for them regularly\n• Attend major family events (funerals, weddings)\n• Your reward is guaranteed with Allah\n• The sin is entirely on the one who refuses\n\nPrevention is Better Than Cure:\n\n1. Don't Let Small Issues Escalate:\nAddress minor problems immediately before they become major rifts. \"Can we talk about what happened?\"\n\n2. Forgive Quickly and Generously:\n\"Those who restrain anger and who pardon people - Allah loves the doers of good.\" (Quran 3:134)\n\n3. Communicate Openly and Kindly:\nMost family issues come from miscommunication. Talk it out with wisdom and kindness.\n\n4. Remember Death:\nYou could die tomorrow, or they could. Do you want to meet Allah with this sin? Do you want their last memory of you to be animosity?\n\n5. Think of Your Own Sins:\nYou want Allah to forgive your countless sins, but you won't forgive your relative's one mistake?\n\n6. Consider Your Children:\nYour children are learning from you. Is breaking family ties the legacy you want to leave them?\n\n7. Remember the Hereafter:\nThis life is temporary. Paradise is eternal. Don't sacrifice eternity for temporary ego satisfaction.\n\nThe Tremendous Blessings of Maintaining Ties - Positive Motivation:\n\n1. Increased Lifespan and Wealth:\n\nThe Prophet ﷺ said: \"Whoever would like his provision to be increased and his lifespan to be extended, let him maintain the ties of kinship.\" (Bukhari & Muslim)\n\nScholars explain: Either actual extension of life, or barakah (blessing) in time making it more productive and beneficial.\n\n2. Allah Maintains Ties With You:\n\nRemember the Hadith: Allah severs ties with those who sever family ties, and maintains ties with those who maintain them. Do you want Allah to cut you off? Or stay connected to you?\n\n3. Deeds Accepted:\n\nWhen ties are maintained, your worship is accepted. Your prayers reach the heavens. Your charity is blessed.\n\n4. Protection from Calamity:\n\nThe Prophet ﷺ said maintaining ties prevents hasty punishment and brings divine protection.\n\n5. Peace of Heart:\n\nWhen you've fulfilled your obligations to family, you sleep peacefully knowing you've pleased Allah.\n\n6. Role Model for Your Children:\n\nYour children will treat you the way they see you treat your parents and relatives. Plant the seeds of good treatment now.\n\n7. Paradise Awaits:\n\nThe Prophet ﷺ guaranteed Paradise for those who maintain ties sincerely for Allah's sake.\n\nDua for Reconciliation:\n\n\"O Allah, You who unite hearts, unite my heart with my family members. Remove enmity, hatred, and grudges from our hearts. Replace them with love, mercy, and compassion. Soften their hearts toward me and mine toward them. Make our reconciliation easy and blessed. Make us among those who maintain family ties for Your pleasure alone. Ameen.\"\n\nThe Ultimate Perspective - Meeting Allah:\n\nImagine standing before Allah on Judgment Day:\n• Your parents ask: \"Why didn't you maintain ties with your brother?\"\n• Your children ask: \"You taught us to be petty and unforgiving?\"\n• Allah asks: \"I commanded you to maintain ties, but you chose your ego instead?\"\n\nThe temporary satisfaction of being \"right\" or holding a grudge is not worth eternal regret.\n\nThe Prophet ﷺ said: \"When a man dies, his deeds come to an end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him.\" (Muslim)\n\nIf you've severed ties, that righteous child might not pray for you. Your family won't remember you with love. Your legacy will be brokenness, not blessing.\n\nConclusion - The Choice is Yours:\n\nEvery day you continue severing family ties, you accumulate sin and distance yourself from Allah's mercy. Every day you maintain ties despite difficulty, you build your Paradise and earn Allah's love.\n\nThe choice is clear:\n• Reconnect today\n• Humble yourself\n• Make the first move\n• Seek forgiveness\n• Rebuild bridges\n• Earn Allah's pleasure\n\nDon't die with this sin on your record. Don't let another day pass in Allah's anger. Pick up the phone. Send the message. Visit them. Reconcile.\n\nYour family is a trust from Allah. How you treat them determines how Allah treats you.\n\nMay Allah soften all our hearts, heal all family rifts, and make us among those who maintain family ties for His pleasure alone. Ameen.",
        "ur": "خاندانی تعلقات توڑنا (قطع رحم)\n\nخاندانی تعلقات توڑنا اسلام میں سب سے بڑے گناہوں میں سے ہے۔\n\nسخت تنبیہ:\n• \"کیا تم نے اگر منہ پھیر لیا تو زمین میں فساد کرو گے اور اپنے رشتے توڑو گے؟ یہ وہ لوگ ہیں جن پر اللہ نے لعنت کی ہے۔\" (قرآن 47:22-23)\n• سب سے جلد سزا دیے جانے والے گناہوں میں سے\n• اللہ کی لعنت کا سبب\n• جنت میں داخلے سے روکتا ہے\n\nنبی کریم ﷺ کا بیان:\n• \"رشتے توڑنے والا جنت میں داخل نہیں ہوگا۔\" (بخاری و مسلم)\n• یہ سخت ��نبیہ ہے\n• اس گناہ کی سنگینی ظاہر کرتا ہے\n• رشتے برقرار رکھنے کی اہمیت پر زور دیتا ہے\n\nکیا رشتے توڑتا ہے:\n• مکمل طور پر رابطہ کاٹنا\n• ملاقات کرنے یا ملنے سے انکار\n• نفرت اور دشمنی رکھنا\n• ضرورت کے وقت مدد نہ کرنا\n• ان کے حقوق کو نظرانداز کرنا\n• ان کے بارے میں برا بولنا\n• ان کی مصیبت پر خوش ہونا\n\nعام بہانے (درست نہیں):\n• \"انہوں نے پہلے میرے ساتھ غلط کیا\"\n• \"ان سے نمٹنا مشکل ہے\"\n• \"میں بہت مصروف ہوں\"\n• \"وہ میرا احترام نہیں کرتے\"\n• \"ہماری چھوٹی سی بحث ہوئی\"\n• ان میں سے کوئی بھی بہانہ رشتے توڑنے کو جائز نہیں بناتا\n\nکتنا لمبا بہت زیادہ ہے:\n• نبی کریم ﷺ نے فرمایا: \"کسی مسلمان کے لیے جائز نہیں کہ وہ اپنے بھائی سے تین دن سے زیادہ ناراض رہے۔\" (بخاری و مسلم)\n• کچھ علماء کہتے ہیں کہ رشتہ داروں کے لیے یہ اور بھی کم ہے\n• اپنے غصے پر سورج غروب نہ ہونے دیں\n• جتنی جلدی ممکن ہو صلح کریں\n\nکیسے صلح کریں:\n• پہل کریں\n• ان کی معذرت کا انتظار نہ کریں\n• دوسروں کے ذریعے سلام بھیجیں\n• تحفہ دیں\n• خود جا کر ملیں\n• صلح کی طاقت کے لیے دعا کریں\n• اللہ کے ثواب کو یاد رکھیں\n\nاگر وہ انکار کریں:\n• وقتاً فوقتاً کوشش جاری رکھیں\n• مکمل طور پر ہار نہ مانیں\n• ان کے لیے دعا کریں\n• تحائف اور سلام بھیجیں\n• آپ کا ثواب اللہ کے پاس ہے\n• گناہ انکار کرنے والے پر ہے\n\nروک تھام بہتر ہے:\n• چھوٹے مسائل کو بڑا نہ ہونے دیں\n• جلدی معاف کریں\n• کھل کر بات کریں\n• مسائل کو جلدی حل کریں\n• یاد رکھیں خون تکبر سے گاڑھا ہے\n• اللہ کی خوشی سوچیں، انا نہیں\n\nدوبارہ جڑنا:\n• \"جو چاہے کہ اس کا رزق بڑھے اور عمر دراز ہو، وہ صلہ رحمی کرے۔\" (بخاری)\n• اس زندگی میں فوری برکتیں\n• آخرت میں ثواب\n• دل و دماغ کا سکون\n• اللہ کی خوشی",
        "hi": "ख़ानदानी तअल्लुक़ात तोड़ना (क़त अर-रहम)\n\nख़ानदानी तअल्लुक़ात तोड़ना इस्लाम में सबसे बड़े गुनाहों में से है।\n\nसख़्त तंबीह:\n• \"क्या तुमने अगर मुंह फेर लिया तो ज़मीन में फ़साद करोगे और अपने रिश्ते तोड़ोगे? यह वो लोग हैं जिन पर अल्लाह ने लानत की है।\" (क़ुरआन 47:22-23)\n• सबसे जल्द सज़ा दिए जाने वाले गुनाहों में से\n• अल्लाह की लानत का सबब\n• जन्नत में दाख़िले से रोकता है\n\nनबी करीम ﷺ का बयान:\n• \"रिश्ते तोड़ने वाला जन्नत में दाख़िल नहीं होगा।\" (बुख़ारी व मुस्लिम)\n• यह सख़्त तंबीह है\n• इस गुनाह की संगीनी ज़ाहिर करता है\n• रिश्ते बरक़रार रखने की अहमियत पर ज़ोर देता है\n\nक्या रिश्ते तोड़ता है:\n• मुकम्मल तौर पर राबिता काटना\n• मुलाक़ात करने या मिलने से इंकार\n• नफ़रत और दुश्मनी रखना\n• ज़रूरत के वक़्त मदद न करना\n• उनके हुक़ूक़ को नज़रअंदाज़ करना\n• उनके बारे में बुरा बोलना\n• उनकी मुसीबत पर ख़ुश होना\n\nआम बहाने (दुरुस्त नहीं):\n• \"उन्होंने पहले मेरे साथ ग़लत किया\"\n• \"उनसे निपटना मुश्किल है\"\n• \"मैं बहुत मसरूफ़ हूं\"\n• \"वो मेरा एहतराम नहीं करते\"\n• \"हमारी छोटी सी बहस हुई\"\n• इनमें से कोई भी बहाना रिश्ते तोड़ने को जाइज़ नहीं बनाता\n\nकितना लंबा बहुत ज़्यादा है:\n• नबी करीम ﷺ ने फ़रमाया: \"किसी मुसलमान के लिए जाइज़ नहीं कि वो अपने भाई से तीन दिन से ज़्यादा नाराज़ रहे।\" (बुख़ारी व मुस्लिम)\n• कुछ उलमा कहते हैं कि रिश्तेदारों के लिए यह और भी कम है\n• अपने ग़ुस्से पर सूरज ग़ुरूब न होने दें\n• जितनी जल्दी मुमकिन हो सुलह करें\n\nकैसे सुलह करें:\n• पहल करें\n• उनकी माफ़ी का इंतिज़ार न करें\n• दूसरों के ज़रीए सलाम भेजें\n• तोहफ़ा दें\n• ख़ुद जाकर मिलें\n• सुलह की ताक़त के लिए दुआ करें\n• अल्लाह के सवाब को याद रखें\n\nअगर वो इंकार करें:\n• वक़्तन फ़ौक़्तन कोशिश जारी रखें\n• मुकम्मल तौर पर हार न मानें\n• उनके लिए दुआ करें\n• तोहफ़े और सलाम भेजें\n• आपका सवाब अल्लाह के पास है\n• गुनाह इंकार करने वाले पर है\n\nरोकथाम बेहतर है:\n• छोटे मसाइल को बड़ा न होने दें\n• जल्दी माफ़ करें\n• खुलकर बात करें\n• मसाइल को जल्दी हल करें\n• याद रखें ख़ून तकब्बुर से गाढ़ा है\n• अल्लाह की ख़ुशी सोचें, अना नहीं\n\nदोबारा जुड़ना:\n• \"जो चाहे कि उसका रिज़्क़ बढ़े और उम्र दराज़ हो, वो सिला रहमी करे।\" (बुख़ारी)\n• इस ज़िंदगी में फ़ौरी बरकतें\n• आख़िरत में सवाब\n• दिल व दिमाग़ का सुकून\n• अल्लाह की ख़ुशी",
        "ar": "قطع صلة الرحم\n\nعقوبة قطع الأرحام في الدنيا والآخرة.\n\nحرمة القطيعة:\n• \"فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ\" (سورة محمد: 22)\n• من كبائر الذنوب\n• قال النبي ﷺ: \"لا يدخل الجنة قاطع رحم\" (البخاري)\n\nعقوبة القطيعة:\n• تعجيل العقوبة في الدنيا\n• محق البركة من العمر والرزق\n• الحرمان من الجنة\n• \"أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ\" (سورة محمد: 23)\n\nأسباب القطيعة:\n• الخلافات المالية\n• سوء الظن\n• الكبر والحسد\n• الانشغال بالدنيا\n• تأثير الآخرين\n\nعلاج القطيعة:\n• المبادرة بالصلح\n• الاعتذار عن الخطأ\n• طلب الوساطة\n• \"وَأَن تَعْفُوا أَقْرَبُ لِلتَّقْوَىٰ\" (سورة البقرة: 237)\n\nالتوبة من القطيعة:\n• الندم على ما فات\n• العزم على الوصل\n• زيارة الأقارب\n• الإحسان إليهم"
      }
    }
  ]
}