{
  "title": {
    "en": "Wudu Additional Info",
    "ur": "وضو کی مزید معلومات",
    "hi": "वुज़ू की अतिरिक्त जानकारी",
    "ar": "معلومات إضافية عن الوضوء"
  },
  "icon": "list_alt",
  "steps": [
    {
      "step": 11,
      "title_key": "wazu_11_things_that_break_wudu",
      "title": {
        "en": "Things That Break Wudu",
        "ur": "وضو توڑنے والی چیزیں",
        "hi": "वुज़ू तोड़ने वाली चीज़ें",
        "ar": "نواقض الوضوء"
      },
      "icon": "cancel",
      "color": "red",
      "details": {
        "en": "Things That Break Wudu (Nawaqid al-Wudu)\n\n1. Natural bodily excretions:\n   • Urine\n   • Stool\n   • Passing wind (gas)\n   • Pre-seminal fluid (Madhi)\n   • Prostatic fluid (Wadi)\n\n2. Deep sleep (lying down or reclining)\n\n3. Loss of consciousness\n\n4. Touching private parts directly (according to some scholars)\n\n5. Eating camel meat (according to some scholars)\n\n6. Blood or pus flowing from a wound (Hanafi opinion)\n\n7. Vomiting a mouthful (Hanafi opinion)\n\n8. Laughing loudly during prayer (Hanafi opinion)\n\nNote: Different schools of thought have slight variations. Follow the guidance of your scholar or school.",
        "ur": "وضو توڑنے والی چیزیں (نواقض الوضو)\n\n۱۔ قدرتی جسمانی اخراج:\n   • پیشاب\n   • پاخانہ\n   • ہوا خارج ہونا (ریاح)\n   • مذی\n   • ودی\n\n۲۔ گہری نیند (لیٹ کر یا ٹیک لگا کر)\n\n۳۔ بے ہوشی\n\n۴۔ شرمگاہ کو براہ راست چھونا (بعض علماء کے مطابق)\n\n۵۔ اونٹ کا گوشت کھانا (بعض علماء کے مطابق)\n\n۶۔ زخم سے خون یا پیپ بہنا (حنفی رائے)\n\n۷۔ منہ بھر قے آنا (حنفی رائے)\n\n۸۔ نماز میں زور سے ہنسنا (حنفی رائے)\n\nنوٹ: مختلف مکاتب فکر میں معمولی فرق ہے۔ اپنے عالم یا مسلک کی رہنمائی پر عمل کریں۔",
        "hi": "वुज़ू तोड़ने वाली चीज़ें (नवाक़िज़ अल-वुज़ू)\n\n१. क़ुदरती जिस्मानी इख़राज:\n   • पेशाब\n   • पाख़ाना\n   • हवा ख़ारिज होना (रियाह)\n   • मज़ी\n   • वदी\n\n२. गहरी नींद (लेटकर या टेक लगाकर)\n\n३. बेहोशी\n\n४. शर्मगाह को बिलावास्ता छूना (बाज़ उलमा के मुताबिक़)\n\n५. ऊंट का गोश्त खाना (बाज़ उलमा के मुताबिक़)\n\n६. ज़ख़्म से ख़ून या पीप बहना (हनफ़ी राय)\n\n७. मुंह भर क़ै आना (हनफ़ी राय)\n\n८. नमाज़ में ज़ोर से हंसना (हनफ़ी राय)\n\nनोट: मुख़्तलिफ़ मकातिब-ए-फ़िक्र में मामूली फ़र्क़ है। अपने आलिम या मसलक की रहनुमाई पर अमल करें।",
        "ar": "نواقض الوضوء\n\n١. الإفرازات الطبيعية من الجسم:\n   • البول\n   • الغائط\n   • خروج الريح\n   • المذي\n   • الودي\n\n٢. النوم العميق (مستلقياً أو متكئاً)\n\n٣. فقدان الوعي\n\n٤. لمس الفرج مباشرة (حسب بعض العلماء)\n\n٥. أكل لحم الإبل (حسب بعض العلماء)\n\n٦. نزول الدم أو القيح من جرح (رأي الحنفية)\n\n٧. القيء بملء الفم (رأي الحنفية)\n\n٨. الضحك بصوت عالٍ في الصلاة (رأي الحنفية)\n\nملاحظة: هناك اختلافات طفيفة بين المذاهب الفقهية. اتبع إرشادات عالمك أو مذهبك."
      }
    },
    {
      "step": 12,
      "title_key": "wazu_12_wudu_with_socks_masah",
      "title": {
        "en": "Wudu with Socks (Masah)",
        "ur": "موزوں پر مسح",
        "hi": "मोज़ों पर मसह",
        "ar": "المسح على الجوارب"
      },
      "icon": "catching_pokemon",
      "color": "grey",
      "details": {
        "en": "Wiping Over Socks (Masah alal Khuffain)\n\nIt is permissible to wipe over leather socks (khuff) or thick socks instead of washing the feet, under certain conditions.\n\nConditions:\n1. Socks must be put on after complete Wudu\n2. Socks must cover the entire foot up to the ankles\n3. Socks must be thick enough that water doesn't seep through easily\n4. Must be able to walk in them\n\nDuration:\n• Resident (Muqeem): 24 hours (one day and night)\n• Traveler (Musafir): 72 hours (three days and nights)\n\nMethod of Wiping:\n1. Wet your hands\n2. Place fingers on top of the toes\n3. Wipe upward toward the ankles\n4. Wipe the top of the foot only (not the bottom)\n5. Wipe both feet\n\nWhat Breaks This Permission:\n• Removal of socks\n• End of the time period\n• Major impurity (requiring Ghusl)\n\nNote: Regular cotton socks are a matter of scholarly difference. Some allow wiping over them, others require leather socks.",
        "ur": "موزوں پر مسح\n\nچمڑے کے موزوں (خف) یا موٹے موزوں پر پاؤں دھونے کی بجائے مسح کرنا جائز ہے، بعض شرائط کے ساتھ۔\n\nشرائط:\n۱۔ موزے مکمل وضو کے بعد پہنے ہوں\n۲۔ موزے پورے پاؤں کو ٹخنوں تک ڈھانپتے ہوں\n۳۔ موزے اتنے موٹے ہوں کہ پانی آسانی سے نہ گزرے\n۴۔ ان میں چلنا ممکن ہو\n\nمدت:\n• مقیم: 24 گھنٹے (ایک دن اور رات)\n• مسافر: 72 گھنٹے (تین دن اور راتیں)\n\nمسح کا طریقہ:\n۱۔ اپنے ہاتھ گیلے کریں\n۲۔ انگلیاں پاؤں کی انگلیوں کے اوپر رکھیں\n۳۔ ٹخنوں کی طرف اوپر مسح کریں\n۴۔ صرف پاؤں کے اوپر مسح کریں (نیچے نہیں)\n۵۔ دونوں پاؤں کا مسح کریں\n\nیہ اجازت کب ختم ہوتی ہے:\n• موزے اتارنا\n• مدت ختم ہونا\n• بڑی ناپاکی (غسل ضروری ہونا)\n\nنوٹ: عام سوتی موزے علماء کے درمیان اختلافی ہیں۔ بعض ان پر مسح کی اجازت دیتے ہیں، بعض چمڑے کے موزے ضروری سمجھتے ہیں۔",
        "hi": "मोज़ों पर मसह\n\nचमड़े के मोज़ों (ख़ुफ़) या मोटे मोज़ों पर पांव धोने की बजाय मसह करना जायज़ है, बाज़ शराइत के साथ।\n\nशराइत:\n१. मोज़े मुकम्मल वुज़ू के बाद पहने हों\n२. मोज़े पूरे पांव को टख़नों तक ढांपते हों\n३. मोज़े इतने मोटे हों कि पानी आसानी से न गुज़रे\n४. उनमें चलना मुमकिन हो\n\nमुद्दत:\n• मुक़ीम: 24 घंटे (एक दिन और रात)\n• मुसाफ़िर: 72 घंटे (तीन दिन और रातें)\n\nमसह का तरीक़ा:\n१. अपने हाथ गीले करें\n२. उंगलियां पांव की उंगलियों के ऊपर रखें\n३. टख़नों की तरफ़ ऊपर मसह करें\n४. सिर्फ़ पांव के ऊपर मसह करें (नीचे नहीं)\n५. दोनों पांव का मसह करें\n\nयह इजाज़त कब ख़त्म होती है:\n• मोज़े उतारना\n• मुद्दत ख़त्म होना\n• बड़ी नापाकी (ग़ुस्ल ज़रूरी होना)\n\nनोट: आम सूती मोज़े उलमा के दरमियान इख़्तिलाफ़ी हैं। बाज़ उन पर मसह की इजाज़त देते हैं, बाज़ चमड़े के मोज़े ज़रूरी समझते हैं।",
        "ar": "المسح على الخفين (الجوارب)\n\nيجوز المسح على الخفين (الجوارب الجلدية) أو الجوارب السميكة بدلاً من غسل القدمين، بشروط معينة.\n\nالشروط:\n١. يجب لبس الجوارب بعد وضوء كامل\n٢. يجب أن تغطي الجوارب القدم كاملة حتى الكعبين\n٣. يجب أن تكون الجوارب سميكة بحيث لا يتسرب الماء بسهولة\n٤. يجب أن يكون المشي فيها ممكناً\n\nالمدة:\n• المقيم: ٢٤ ساعة (يوم وليلة)\n• المسافر: ٧٢ ساعة (ثلاثة أيام ولياليها)\n\nطريقة المسح:\n١. بلل يديك\n٢. ضع أصابعك على أطراف أصابع القدم\n٣. امسح صعوداً نحو الكعبين\n٤. امسح ظاهر القدم فقط (وليس الباطن)\n٥. امسح كلتا القدمين\n\nما يبطل هذا الإذن:\n• خلع الجوارب\n• انتهاء المدة المحددة\n• الحدث الأكبر (الذي يتطلب الغسل)\n\nملاحظة: الجوارب القطنية العادية محل خلاف بين العلماء. بعضهم يجيز المسح عليها، والبعض يشترط الخفاف الجلدية."
      }
    },
    {
      "step": 13,
      "title_key": "wazu_13_virtues_benefits",
      "title": {
        "en": "Virtues & Benefits of Wudu",
        "ur": "وضو کی فضیلت اور فوائد",
        "hi": "वुज़ू की फ़ज़ीलत और फ़ायदे",
        "ar": "فضائل وفوائد الوضوء"
      },
      "icon": "star",
      "color": "amber",
      "details": {
        "en": "Virtues and Benefits of Wudu\n\n1. Radiance on the Day of Resurrection:\nThe Prophet ﷺ said: \"On the Day of Resurrection, my followers will be summoned 'Al-Ghurr Al-Muhajjalun' (with radiant faces, hands, and feet) from the traces of Wudu. Whoever can increase the area of his radiance should do so.\"\n(Sahih Bukhari 136, Sahih Muslim 246)\n\n2. Forgiveness of Sins:\nThe Prophet ﷺ said: \"When a Muslim performs ablution, washing his face, every evil that he looked at with his eyes comes out with the water. When he washes his hands, every evil his hands touched comes out with the water. When he washes his feet, every evil his feet walked towards comes out with the water, until he emerges cleansed of sin.\"\n(Sahih Muslim)\n\n3. Eight Gates of Paradise:\nWhen one performs Wudu carefully and recites the Shahada, the Prophet ﷺ said: \"The eight gates of Jannah are opened for him. He may enter through whichever of these gates he desires.\"\n(Sahih Muslim)\n\n4. Complete Purification:\nUthman ibn Affan (RA) reported: The Prophet ﷺ said: \"He who performed ablution well, his sins would come out from his body, even coming out from under his nails.\"\n(Sahih Muslim)\n\n5. Key to Prayer:\nThe Prophet ﷺ said: \"The key to Paradise is Salah, and the key to Salah is Wudu.\"\n(Musnad Ahmad)\n\n6. Protection from Shaitan:\nThe Prophet ﷺ said: \"When a person goes to sleep in a state of wudu, an angel stays with him throughout the night.\"\n\n7. Angels Surround You:\nBeing in a state of wudu keeps angels near you and shaitan away.\n\n8. Half of Faith:\nThe Prophet ﷺ said: \"Wudu is half of faith (Iman).\"\n(Sahih Muslim)\n\n9. Physical Health Benefits:\n• Cleanses the body 5 times daily\n• Washes away germs and bacteria\n• Prevents skin diseases\n• Rinses mouth and nose, preventing infections\n• Improves blood circulation\n• Reduces stress and promotes calmness\n\nImportant Reminder:\nMaintain wudu throughout the day, not just for prayer. The Prophet ﷺ was always in a state of purity.",
        "ur": "وضو کی فضیلت اور فوائد\n\n۱۔ قیامت کے دن چمکتے چہرے:\nنبی کریم ﷺ نے فرمایا: \"قیامت کے دن میری امت کو 'الغر المحجلون' (چمکتے چہروں، ہاتھوں اور پاؤں والے) کے نام سے بلایا جائے گا وضو کے نشانات کی وجہ سے۔ جو اپنے نور کا دائرہ بڑھا سکے وہ بڑھائے۔\"\n(صحیح بخاری 136، صحیح مسلم 246)\n\n۲۔ گناہوں کی معافی:\nنبی کریم ﷺ نے فرمایا: \"جب کوئی مسلمان وضو کرتا ہے اور اپنا چہرہ دھوتا ہے تو ہر برائی جو اس نے اپنی آنکھوں سے دیکھی تھی پانی کے ساتھ نکل جاتی ہے۔ جب ہاتھ دھوتا ہے تو ہر برائی جو اس کے ہاتھوں نے چھوئی تھی پانی کے ساتھ نکل جاتی ہے۔ جب پاؤں دھوتا ہے تو ہر برائی جس کی طرف اس کے پاؤں چلے تھے پانی کے ساتھ نکل جاتی ہے، یہاں تک کہ وہ گناہوں سے پاک ہو کر نکلتا ہے۔\"\n(صحیح مسلم)\n\n۳۔ جنت کے آٹھ دروازے:\nجب کوئی احسن طریقے سے وضو کرتا ہے اور کلمہ شہادت پڑھتا ہے تو نبی کریم ﷺ نے فرمایا: \"اس کے لیے جنت کے آٹھ دروازے کھول دیے جاتے ہیں۔ وہ جس دروازے سے چاہے داخل ہو سکتا ہے۔\"\n(صحیح مسلم)\n\n۴۔ مکمل پاکیزگی:\nعثمان بن عفان رضی اللہ عنہ نے روایت کی: نبی کریم ﷺ نے فرمایا: \"جس نے اچھے طریقے سے وضو کیا تو اس کے جسم سے گناہ نکل جاتے ہیں، یہاں تک کہ اس کے ناخنوں کے نیچے سے بھی نکل جاتے ہیں۔\"\n(صحیح مسلم)\n\n۵۔ نماز کی کنجی:\nنبی کریم ﷺ نے فرمایا: \"جنت کی کنجی نماز ہے اور نماز کی کنجی وضو ہے۔\"\n(مسند احمد)\n\n۶۔ شیطان سے حفاظت:\nنبی کریم ﷺ نے فرمایا: \"جب کوئی شخص وضو کی حالت میں سوتا ہے تو ایک فرشتہ رات بھر اس کے ساتھ رہتا ہے۔\"\n\n۷۔ فرشتے آپ کے گرد ہوتے ہیں:\nوضو کی حالت میں رہنے سے فرشتے قریب رہتے ہیں اور شیطان دور رہتا ہے۔\n\n۸۔ نصف ایمان:\nنبی کریم ﷺ نے فرمایا: \"وضو نصف ایمان ہے۔\"\n(صحیح مسلم)\n\n۹۔ جسمانی صحت کے فوائد:\n• روزانہ 5 بار جسم کی صفائی\n• جراثیم اور بیکٹیریا کو دھو دیتا ہے\n• جلد کی بیماریوں سے بچاتا ہے\n• منہ اور ناک کو صاف کرتا ہے، انفیکشن سے بچاتا ہے\n• خون کی گردش بہتر کرتا ہے\n• تناؤ کم کرتا ہے اور سکون فراہم کرتا ہے\n\nاہم یاد دہانی:\nدن بھر وضو کی حالت میں رہیں، نہ صرف نماز کے لیے۔ نبی کریم ﷺ ہمیشہ طہارت کی حالت میں رہتے تھے۔",
        "hi": "वुज़ू की फ़ज़ीलत और फ़ायदे\n\n१. क़यामत के दिन चमकते चेहरे:\nनबी करीम ﷺ ने फ़रमाया: \"क़यामत के दिन मेरी उम्मत को 'अल-ग़ुर्र अल-मुहज्जलून' (चमकते चेहरों, हाथों और पांव वाले) के नाम से बुलाया जाएगा वुज़ू के निशानात की वजह से। जो अपने नूर का दायरा बढ़ा सके वो बढ़ाए।\"\n(सहीह बुख़ारी 136, सहीह मुस्लिम 246)\n\n२. गुनाहों की माफ़ी:\nनबी करीम ﷺ ने फ़रमाया: \"जब कोई मुसलमान वुज़ू करता है और अपना चेहरा धोता है तो हर बुराई जो उसने अपनी आंखों से देखी थी पानी के साथ निकल जाती है। जब हाथ धोता है तो हर बुराई जो उसके हाथों ने छुई थी पानी के साथ निकल जाती है। जब पांव धोता है तो हर बुराई जिसकी तरफ़ उसके पांव चले थे पानी के साथ निकल जाती है, यहां तक कि वो गुनाहों से पाक होकर निकलता है।\"\n(सहीह मुस्लिम)\n\n३. जन्नत के आठ दरवाज़े:\nजब कोई अहसन तरीक़े से वुज़ू करता है और कलिमा शहादत पढ़ता है तो नबी करीम ﷺ ने फ़रमाया: \"उसके लिए जन्नत के आठ दरवाज़े खोल दिए जाते हैं। वो जिस दरवाज़े से चाहे दाख़िल हो सकता है।\"\n(सहीह मुस्लिम)\n\n४. मुकम्मल पाकीज़गी:\nउस्मान बिन अफ़्फ़ान रज़ियल्लाहु अन्हु ने रिवायत की: नबी करीम ﷺ ने फ़रमाया: \"जिसने अच्छे तरीक़े से वुज़ू किया तो उसके जिस्म से गुनाह निकल जाते हैं, यहां तक कि उसके नाख़ुनों के नीचे से भी निकल जाते हैं।\"\n(सहीह मुस्लिम)\n\n५. नमाज़ की कुंजी:\nनबी करीम ﷺ ने फ़रमाया: \"जन्नत की कुंजी नमाज़ है और नमाज़ की कुंजी वुज़ू है।\"\n(मुसनद अहमद)\n\n६. शैतान से हिफ़ाज़त:\nनबी करीम ﷺ ने फ़रमाया: \"जब कोई शख़्स वुज़ू की हालत में सोता है तो एक फ़रिश्ता रात भर उसके साथ रहता है।\"\n\n७. फ़रिश्ते आपके गिर्द होते हैं:\nवुज़ू की हालत में रहने से फ़रिश्ते क़रीब रहते हैं और शैतान दूर रहता है।\n\n८. निस्फ़ ईमान:\nनबी करीम ﷺ ने फ़रमाया: \"वुज़ू निस्फ़ ईमान है।\"\n(सहीह मुस्लिम)\n\n९. जिस्मानी सेहत के फ़ायदे:\n• रोज़ाना 5 बार जिस्म की सफ़ाई\n• जरासीम और बैक्टीरिया को धो देता है\n• जिल्द की बीमारियों से बचाता है\n• मुंह और नाक को साफ़ करता है, इनफ़ेक्शन से बचाता है\n• ख़ून की गर्दिश बेहतर करता है\n• तनाव कम करता है और सुकून फ़राहम करता है\n\nअहम याद दिहानी:\nदिन भर वुज़ू की हालत में रहें, न सिर्फ़ नमाज़ के लिए। नबी करीम ﷺ हमेशा तहारत की हालत में रहते थे।",
        "ar": "فضائل وفوائد الوضوء\n\n١. النور يوم القيامة:\nقال النبي ﷺ: \"إن أمتي يُدعون يوم القيامة غراً محجلين من آثار الوضوء، فمن استطاع منكم أن يطيل غرته فليفعل.\"\n(صحيح البخاري 136، صحيح مسلم 246)\n\n٢. غفران الذنوب:\nقال النبي ﷺ: \"إذا توضأ العبد المسلم أو المؤمن فغسل وجهه خرج من وجهه كل خطيئة نظر إليها بعينيه مع الماء، فإذا غسل يديه خرج من يديه كل خطيئة كان بطشتها يداه مع الماء، فإذا غسل رجليه خرجت كل خطيئة مشتها رجلاه مع الماء حتى يخرج نقياً من الذنوب.\"\n(صحيح مسلم)\n\n٣. أبواب الجنة الثمانية:\nعندما يتوضأ المرء بإحسان ويشهد الشهادة، قال النبي ﷺ: \"فُتحت له أبواب الجنة الثمانية يدخل من أيها شاء.\"\n(صحيح مسلم)\n\n٤. الطهارة الكاملة:\nعن عثمان بن عفان رضي الله عنه: قال النبي ﷺ: \"من توضأ فأحسن الوضوء خرجت خطاياه من جسده حتى تخرج من تحت أظفاره.\"\n(صحيح مسلم)\n\n٥. مفتاح الصلاة:\nقال النبي ﷺ: \"مفتاح الجنة الصلاة، ومفتاح الصلاة الوضوء.\"\n(مسند أحمد)\n\n٦. الحماية من الشيطان:\nقال النبي ﷺ: \"من بات طاهراً بات في شعاره ملك.\"\n\n٧. الملائكة تحيط بك:\nالبقاء على وضوء يُبقي الملائكة قريبة والشيطان بعيداً.\n\n٨. نصف الإيمان:\nقال النبي ﷺ: \"الوضوء شطر الإيمان.\"\n(صحيح مسلم)\n\n٩. الفوائد الصحية الجسدية:\n• تنظيف الجسم 5 مرات يومياً\n• إزالة الجراثيم والبكتيريا\n• الوقاية من أمراض الجلد\n• تنظيف الفم والأنف، الوقاية من العدوى\n• تحسين الدورة الدموية\n• تقليل التوتر وتعزيز الهدوء\n\nتذكير مهم:\nحافظ على الوضوء طوال اليوم، وليس فقط للصلاة. كان النبي ﷺ دائماً على طهارة."
      }
    },
    {
      "step": 14,
      "title_key": "wazu_14_common_mistakes",
      "title": {
        "en": "Common Mistakes in Wudu",
        "ur": "وضو میں عام غلطیاں",
        "hi": "वुज़ू में आम ग़लतियां",
        "ar": "الأخطاء الشائعة في الوضوء"
      },
      "icon": "warning_amber",
      "color": "orange",
      "details": {
        "en": "Common Mistakes to Avoid in Wudu\n\n1. Incomplete Washing of Body Parts:\n❌ Leaving elbows or ankles dry\n❌ Missing between fingers and toes\n❌ Not washing the entire face from forehead to chin\n✓ Ensure every required part is thoroughly washed\n\nThe Prophet ﷺ saw a man performing wudu with a dry spot on his heel and said: \"Woe to the heels from the Hellfire!\"\n(Sahih Bukhari)\n\n2. Lack of Proper Intention (Niyyah):\n❌ Starting without intention\n❌ Losing focus during wudu\n✓ Make sincere intention before beginning\n✓ Stay focused on worship throughout\n\n3. Not Following the Correct Order:\n❌ Washing parts out of sequence\n✓ Follow the order: Face → Arms → Head → Feet\n\nAccording to Shafi'i and Hanbali scholars, the order (Tarteeb) is obligatory for valid wudu.\n\n4. Rushing Through the Process:\n❌ Performing wudu hastily\n❌ Not allowing water to reach all areas\n✓ Perform calmly with mindfulness\n✓ Take time to ensure completeness\n\n5. Using Excessive Water:\n❌ Wasting water unnecessarily\n✓ Use minimal water as the Prophet ﷺ did\n✓ One handful for each limb is sufficient\n\nThe Prophet ﷺ used to perform wudu with one Mudd (approximately 750ml) of water.\n\n6. Not Removing Barriers:\n❌ Nail polish, thick cream, or wax on skin\n❌ Rings too tight to allow water underneath\n✓ Remove anything preventing water from reaching skin\n✓ Ensure jewelry allows water to pass\n\n7. Distractions During Wudu:\n❌ Talking unnecessarily\n❌ Using phone or being distracted\n✓ Focus on the worship\n✓ Maintain silence and mindfulness\n\n8. Missing Between Fingers and Toes:\n❌ Not interlacing fingers\n❌ Not washing between toes\n✓ Use Khilal (interlacing) for thoroughness\n\n9. Washing Less Than Three Times:\n❌ Washing once when you should wash thrice\n✓ Wash face, arms, and feet three times each (Sunnah)\n✓ At minimum, once thoroughly for Fard\n\n10. Not Washing in Sequence (Muwaalaat):\n❌ Long gaps between washing body parts\n✓ Perform wudu continuously without long breaks\n\nImportant Reminder:\nIf you realize you made a mistake during wudu, it's better to repeat it to ensure validity. Prayer with invalid wudu is not accepted.",
        "ur": "وضو میں عام غلطیاں جن سے بچنا چاہیے\n\n۱۔ جسم کے حصوں کا نامکمل دھونا:\n❌ کہنیوں یا ٹخنوں کو خشک چھوڑنا\n❌ انگلیوں کے درمیان چھوڑنا\n❌ پورا چہرہ ماتھے سے ٹھوڑی تک نہ دھونا\n✓ یقینی بنائیں کہ ہر ضروری حصہ اچھی طرح دھویا گیا ہے\n\nنبی کریم ﷺ نے ایک آدمی کو وضو کرتے دیکھا جس کی ایڑی پر خشک جگہ تھی اور فرمایا: \"ایڑیوں کے لیے دوزخ کی آگ سے خرابی ہے!\"\n(صحیح بخاری)\n\n۲۔ صحیح نیت کا نہ ہونا:\n❌ بغیر نیت کے شروع کرنا\n❌ وضو کے دوران توجہ کھونا\n✓ شروع کرنے سے پہلے خلوص نیت کریں\n✓ پوری عبادت میں توجہ برقرار رکھیں\n\n۳۔ صحیح ترتیب کا نہ ہونا:\n❌ حصوں کو غلط ترتیب سے دھونا\n✓ ترتیب پر عمل کریں: چہرہ → بازو → سر → پاؤں\n\nشافعی اور حنبلی علماء کے مطابق، ترتیب (ترتیب) صحیح وضو کے لیے ضروری ہے۔\n\n۴۔ جلدی جلدی کرنا:\n❌ وضو جلدی سے کرنا\n❌ پانی کو تمام جگہوں تک نہ پہنچنے دینا\n✓ سکون سے ہوش مندی کے ساتھ کریں\n✓ مکمل ہونے کو یقینی بنانے کے لیے وقت لیں\n\n۵۔ ضرورت سے زیادہ پانی استعمال کرنا:\n❌ بلا ضرورت پانی ضائع کرنا\n✓ نبی کریم ﷺ کی طرح کم پانی استعمال کریں\n✓ ہر عضو کے لیے ایک چلو کافی ہے\n\nنبی کریم ﷺ ایک مد (تقریباً 750 ملی لیٹر) پانی سے وضو کرتے تھے۔\n\n۶۔ رکاوٹوں کو نہ ہٹانا:\n❌ نیل پالش، موٹی کریم، یا جلد پر موم\n❌ انگوٹھیاں اتنی تنگ کہ نیچے پانی نہ جائے\n✓ ہر وہ چیز ہٹائیں جو پانی کو جلد تک پہنچنے سے روکے\n✓ یقینی بنائیں کہ زیورات پانی گزرنے دیں\n\n۷۔ وضو کے دوران توجہ ہٹانا:\n❌ بلا ضرورت بات کرنا\n❌ فون استعمال کرنا یا مشغول ہونا\n✓ عبادت پر توجہ رکھیں\n✓ خاموشی اور ہوش مندی برقرار رکھیں\n\n۸۔ انگلیوں کے درمیان چھوڑنا:\n❌ انگلیاں نہ ملانا\n❌ پاؤں کی انگلیوں کے درمیان نہ دھونا\n✓ اچھی طرح دھونے کے لیے خلال استعمال کریں\n\n۹۔ تین بار سے کم دھونا:\n❌ ایک بار دھونا جب تین بار دھونا چاہیے\n✓ چہرہ، بازو، اور پاؤں تین بار دھوئیں (سنت)\n✓ کم از کم، فرض کے لیے ایک بار اچھی طرح\n\n۱۰۔ تسلسل میں نہ دھونا (موالات):\n❌ حصوں کو دھونے میں لمبے وقفے\n✓ بغیر لمبے وقفوں کے مسلسل وضو کریں\n\nاہم یاد دہانی:\nاگر آپ کو احساس ہو کہ وضو میں غلطی ہوئی ہے تو بہتر ہے کہ دوبارہ کریں تاکہ درستگی یقینی ہو۔ غلط وضو کے ساتھ نماز قبول نہیں ہوتی۔",
        "hi": "वुज़ू में आम ग़लतियां जिनसे बचना चाहिए\n\n१. जिस्म के हिस्सों का नामुकम्मल धोना:\n❌ कोहनियों या टख़नों को ख़ुश्क छोड़ना\n❌ उंगलियों के दरमियान छोड़ना\n❌ पूरा चेहरा माथे से ठोड़ी तक न धोना\n✓ यक़ीनी बनाएं कि हर ज़रूरी हिस्सा अच्छी तरह धोया गया है\n\nनबी करीम ﷺ ने एक आदमी को वुज़ू करते देखा जिसकी एड़ी पर ख़ुश्क जगह थी और फ़रमाया: \"एड़ियों के लिए दोज़ख़ की आग से ख़राबी है!\"\n(सहीह बुख़ारी)\n\n२. सही नीयत का न होना:\n❌ बग़ैर नीयत के शुरू करना\n❌ वुज़ू के दौरान तवज्जो खोना\n✓ शुरू करने से पहले ख़ुलूस नीयत करें\n✓ पूरी इबादत में तवज्जो बरक़रार रखें\n\n३. सही तरतीब का न होना:\n❌ हिस्सों को ग़लत तरतीब से धोना\n✓ तरतीब पर अमल करें: चेहरा → बाज़ू → सर → पांव\n\nशाफ़ई और हनबली उलमा के मुताबिक़, तरतीब (तरतीब) सही वुज़ू के लिए ज़रूरी है।\n\n४. जल्दी जल्दी करना:\n❌ वुज़ू जल्दी से करना\n❌ पानी को तमाम जगहों तक न पहुंचने देना\n✓ सुकून से होशमंदी के साथ करें\n✓ मुकम्मल होने को यक़ीनी बनाने के लिए वक़्त लें\n\n५. ज़रूरत से ज़्यादा पानी इस्तेमाल करना:\n❌ बिला ज़रूरत पानी ज़ाया करना\n✓ नबी करीम ﷺ की तरह कम पानी इस्तेमाल करें\n✓ हर उज़्व के लिए एक चुल्लू काफ़ी है\n\nनबी करीम ﷺ एक मुद (तक़रीबन 750 मिली लीटर) पानी से वुज़ू करते थे।\n\n६. रुकावटों को न हटाना:\n❌ नेल पॉलिश, मोटी क्रीम, या जिल्द पर मोम\n❌ अंगूठियां इतनी तंग कि नीचे पानी न जाए\n✓ हर वो चीज़ हटाएं जो पानी को जिल्द तक पहुंचने से रोके\n✓ यक़ीनी बनाएं कि ज़ेवरात पानी गुज़रने दें\n\n७. वुज़ू के दौरान तवज्जो हटाना:\n❌ बिला ज़रूरत बात करना\n❌ फ़ोन इस्तेमाल करना या मशग़ूल होना\n✓ इबादत पर तवज्जो रखें\n✓ ख़ामोशी और होशमंदी बरक़रार रखें\n\n८. उंगलियों के दरमियान छोड़ना:\n❌ उंगलियां न मिलाना\n❌ पांव की उंगलियों के दरमियान न धोना\n✓ अच्छी तरह धोने के लिए ख़िलाल इस्तेमाल करें\n\n९. तीन बार से कम धोना:\n❌ एक बार धोना जब तीन बार धोना चाहिए\n✓ चेहरा, बाज़ू, और पांव तीन बार धोएं (सुन्नत)\n✓ कम से कम, फ़र्ज़ के लिए एक बार अच्छी तरह\n\n१०. तसलसुल में न धोना (मुवालात):\n❌ हिस्सों को धोने में लंबे वक़्फ़े\n✓ बग़ैर लंबे वक़्फ़��ं के मुसलसल वुज़ू करें\n\nअहम याद दिहानी:\nअगर आपको अहसास हो कि वुज़ू में ग़लती हुई है तो बेहतर है कि दोबारा करें ताकि दुरुस्तगी यक़ीनी हो। ग़लत वुज़ू के साथ नमाज़ क़बूल नहीं होती।",
        "ar": "الأخطاء الشائعة التي يجب تجنبها في الوضوء\n\n١. عدم غسل أعضاء الجسم بالكامل:\n❌ ترك المرفقين أو الكعبين جافين\n❌ تفويت ما بين الأصابع\n❌ عدم غسل الوجه كاملاً من الجبهة إلى الذقن\n✓ تأكد من غسل كل جزء مطلوب جيداً\n\nرأى النبي ﷺ رجلاً يتوضأ وفي عقبه مثل موضع الدرهم لم يصبه الماء فقال: \"ويل للأعقاب من النار!\"\n(صحيح البخاري)\n\n٢. عدم النية الصحيحة:\n❌ البدء بدون نية\n❌ فقدان التركيز أثناء الوضوء\n✓ اعقد نية صادقة قبل البدء\n✓ حافظ على التركيز في العبادة\n\n٣. عدم اتباع الترتيب الصحيح:\n❌ غسل الأعضاء خارج التسلسل\n✓ اتبع الترتيب: الوجه → الذراعان → الرأس → القدمان\n\nوفقاً لعلماء الشافعية والحنابلة، الترتيب واجب لصحة الوضوء.\n\n٤. التعجل في الوضوء:\n❌ أداء الوضوء بسرعة\n❌ عدم السماح للماء بالوصول لكل الأماكن\n✓ أدِّ الوضوء بهدوء ووعي\n✓ خذ وقتك لضمان الاكتمال\n\n٥. الإسراف في الماء:\n❌ إضاعة الماء دون داع\n✓ استخدم الماء القليل كما كان النبي ﷺ\n✓ حفنة واحدة لكل عضو كافية\n\nكان النبي ﷺ يتوضأ بمد واحد (حوالي 750 مل) من الماء.\n\n٦. عدم إزالة الحواجز:\n❌ طلاء الأظافر، الكريمات الثقيلة، أو الشمع على الجلد\n❌ الخواتم ضيقة جداً لا تسمح للماء بالمرور\n✓ أزل أي شيء يمنع الماء من الوصول للجلد\n✓ تأكد أن المجوهرات تسمح بمرور الماء\n\n٧. التشتت أثناء الوضوء:\n❌ التحدث دون ضرورة\n❌ استخدام الهاتف أو التشتت\n✓ ركز على العبادة\n✓ حافظ على الصمت والوعي\n\n٨. تفويت ما بين الأصابع:\n❌ عدم تخليل الأصابع\n❌ عدم غسل ما بين أصابع القدمين\n✓ استخدم التخليل للتأكد من الشمولية\n\n٩. الغسل أقل من ثلاث مرات:\n❌ الغسل مرة واحدة عندما يجب ثلاث مرات\n✓ اغسل الوجه والذراعين والقدمين ثلاث مرات (سنة)\n✓ على الأقل، مرة واحدة جيداً للفرض\n\n١٠. عدم الموالاة:\n❌ فترات طويلة بين غسل الأعضاء\n✓ أدِّ الوضوء متتالياً بدون فترات طويلة\n\nتذكير مهم:\nإذا أدركت خطأ في وضوئك، من الأفضل إعادته لضمان الصحة. الصلاة بوضوء غير صحيح غير مقبولة."
      }
    },
    {
      "step": 15,
      "title_key": "wazu_15_fard_sunnah_mustahab",
      "title": {
        "en": "Fard, Sunnah & Mustahab",
        "ur": "فرض، سنت اور مستحب",
        "hi": "फ़र्ज़, सुन्नत और मुस्तहब",
        "ar": "الفرض والسنة والمستحب"
      },
      "icon": "list_alt",
      "color": "indigo",
      "details": {
        "en": "Classification of Wudu Acts\n\n## FARD (Obligatory) - 4 Essential Acts\n\nThese are absolutely required for valid wudu:\n\n1. **Washing the Face**\n   • From hairline to chin\n   • From ear to ear\n   • Including rinsing mouth and nose (according to most scholars)\n\n2. **Washing Both Arms**\n   • From fingertips to elbows\n   • Including the elbows themselves\n   • Must be washed completely\n\n3. **Wiping the Head (Masah)**\n   • At least one-fourth of the head\n   • With wet hands\n   • Cannot be replaced with washing\n\n4. **Washing Both Feet**\n   • From toes to ankles\n   • Including the ankles themselves\n   • Between the toes must be washed\n\n⚠️ Missing any Fard action invalidates the entire wudu!\n\n## SUNNAH (Recommended) - Following the Prophet's Way\n\nThese bring great reward but are not required:\n\n1. **Saying Bismillah** before starting\n2. **Washing hands three times** at the beginning\n3. **Using Miswak** or brushing teeth\n4. **Rinsing mouth (Madmada)** three times\n5. **Rinsing nose (Istinshaq)** three times\n6. **Washing each part three times** (not exceeding three)\n7. **Starting with the right side** before left\n8. **Running fingers through the beard**\n9. **Interlacing fingers and toes (Khilal)**\n10. **Continuous washing** without long breaks (Muwaalaat)\n11. **Following the order** (Tarteeb - Fard in Shafi'i school)\n12. **Reciting dua after completion**\n\n## MUSTAHAB (Preferred) - Extra Blessings\n\nThese are liked acts that bring additional reward:\n\n1. **Facing the Qibla** during wudu\n2. **Not talking** unnecessarily\n3. **Not wasting water** - using minimal amount\n4. **Avoiding help** unless necessary\n5. **Drying with a clean towel** (permissible)\n6. **Making dua** during each step\n7. **Two Rak'at prayer** after wudu (Sunnah)\n\n## What Breaks Wudu?\n\nFard situations that require new wudu:\n• Any discharge from private parts\n• Deep sleep lying down\n• Loss of consciousness\n• Touching private parts (according to some schools)\n\n## Important Notes:\n\n✓ The 4 Fard acts MUST be done for valid wudu\n✓ Sunnah acts should be followed as much as possible\n✓ Mustahab acts bring extra blessings\n✓ Intention is essential (some consider it Fard)\n\nThe Prophet ﷺ said: \"Shall I not tell you something by which Allah removes sins and raises ranks? They said: 'Yes, O Messenger of Allah.' He said: 'Performing wudu properly despite difficulties.'\"\n(Sahih Muslim)",
        "ur": "وضو کے اعمال کی تقسیم\n\n## فرض (لازمی) - 4 ضروری اعمال\n\nیہ صحیح وضو کے لیے بالکل ضروری ہیں:\n\n۱۔ **چہرہ دھونا**\n   • بالوں کی لکیر سے ٹھوڑی تک\n   • کان سے کان تک\n   • منہ اور ناک دھونا شامل (اکثر علماء کے مطابق)\n\n۲۔ **دونوں بازو دھونا**\n   • انگلیوں کی نوک سے کہنیوں تک\n   • کہنیاں بھی شامل\n   • مکمل طور پر دھونا ضروری\n\n۳۔ **سر کا مسح**\n   • کم از کم سر کا چوتھائی حصہ\n   • گیلے ہاتھوں سے\n   • دھونے سے تبدیل نہیں کیا جا سکتا\n\n۴۔ **دونوں پاؤں دھونا**\n   • انگلیوں سے ٹخنوں تک\n   • ٹخنے بھی شامل\n   • انگلیوں کے درمیان دھونا ضروری\n\n⚠️ کوئی بھی فرض عمل چھوڑنے سے پورا وضو باطل ہو جاتا ہے!\n\n## سنت (تجویز شدہ) - نبی کریم ﷺ کے طریقے پر عمل\n\nیہ بڑا ثواب لاتے ہیں لیکن لازمی نہیں:\n\n۱۔ شروع میں **بسم اللہ** کہنا\n۲۔ شروع میں **ہاتھ تین بار** دھونا\n۳۔ **مسواک** استعمال کرنا یا دانت صاف کرنا\n۴۔ **کلی** تین بار کرنا\n۵۔ **ناک میں پانی** تین بار ڈالنا\n۶۔ **ہر حصہ تین بار** دھونا (تین سے زیادہ نہیں)\n۷۔ **دائیں جانب سے شروع** کرنا بائیں سے پہلے\n۸۔ **داڑھی میں انگلیاں** پھیرنا\n۹۔ **انگلیوں میں خلال** کرنا\n۱۰۔ **مسلسل دھونا** بغیر لمبے وقفے کے (موالات)\n۱۱۔ **ترتیب پر عمل** (شافعی مسلک میں فرض)\n۱۲۔ تکمیل کے بعد **دعا پڑھنا**\n\n## مستحب (پسندیدہ) - اضافی برکتیں\n\nیہ پسندیدہ اعمال ہیں جو اضافی ثواب لاتے ہیں:\n\n۱۔ وضو کے دوران **قبلہ رو** ہونا\n۲۔ بلا ضرورت **بات نہ** کرنا\n۳۔ **پانی ضائع نہ** کرنا - کم سے کم استعمال\n۴۔ جب تک ضروری نہ ہو **مدد سے پرہیز**\n۵۔ **صاف تولیے سے خشک** کرنا (جائز)\n۶۔ ہر قدم پر **دعا** کرنا\n۷۔ وضو کے بعد **دو رکعت نماز** (سنت)\n\n## وضو کیا توڑتا ہے؟\n\nفرض حالات جن میں نیا وضو ضروری ہے:\n• شرمگاہ سے کوئی خارج\n• لیٹ کر گہری نیند\n• بے ہوشی\n• شرمگاہ چھونا (بعض مسالک کے مطابق)\n\n## اہم نکات:\n\n✓ 4 فرض اعمال صحیح وضو کے لیے ضروری ہیں\n✓ سنت اعمال کی زیادہ سے زیادہ پیروی کرنی چاہیے\n✓ مستحب اعمال اضافی برکتیں لاتے ہیں\n✓ نیت ضروری ہے (بعض اسے فرض سمجھتے ہیں)\n\nنبی کریم ﷺ نے فرمایا: \"کیا میں تمہیں ایسی چیز نہ بتاؤں جس سے اللہ گناہ مٹاتا اور درجات بلند کرتا ہے؟\" انہوں نے کہا: 'جی ہاں، اے اللہ کے رسول۔' آپ ﷺ نے فرمایا: 'مشکلات کے باوجود اچھی طرح وضو کرنا۔'\"\n(صحیح مسلم)",
        "hi": "वुज़ू के आमाल की तक़सीम\n\n## फ़र्ज़ (लाज़िमी) - 4 ज़रूरी आमाल\n\nये सही वुज़ू के लिए बिल्कुल ज़रूरी हैं:\n\n१. **चेहरा धोना**\n   • बालों की लकीर से ठोड़ी तक\n   • कान से कान तक\n   • मुंह और नाक धोना शामिल (अकसर उलमा के मुताबिक़)\n\n२. **दोनों बाज़ू धोना**\n   • उंगलियों की नोक से कोहनियों तक\n   • कोहनियां भी शामिल\n   • मुकम्मल तौर पर धोना ज़रूरी\n\n३. **सर का मसह**\n   • कम से कम सर का चौथाई हिस्सा\n   • गीले हाथों से\n   • धोने से तब्दील नहीं किया जा सकता\n\n४. **दोनों पांव धोना**\n   • उंगलियों से टख़नों तक\n   • टख़ने भी शामिल\n   • उंगलियों के दरमियान धोना ज़रूरी\n\n⚠️ कोई भी फ़र्ज़ अमल छोड़ने से पूरा वुज़ू बातिल हो जाता है!\n\n## सुन्नत (तजवीज़ शुदा) - नबी करीम ﷺ के तरीक़े पर अमल\n\nये बड़ा सवाब लाते हैं लेकिन लाज़िमी नहीं:\n\n१. शुरू में **बिस्मिल्लाह** कहना\n२. शुरू में **हाथ तीन बार** धोना\n३. **मिसवाक** इस्तेमाल करना या दांत साफ़ करना\n४. **कुल्ली** तीन बार करना\n५. **नाक में पानी** तीन बार डालना\n६. **हर हिस्सा तीन बार** धोना (तीन से ज़्यादा नहीं)\n७. **दाहिनी जानिब से शुरू** करना बाएं से पहले\n८. **दाढ़ी में उंगलियां** फेरना\n९. **उंगलियों में ख़िलाल** करना\n१०. **मुसलसल धोना** बग़ैर लंबे वक़्फ़े के (मुवालात)\n११. **तरतीब पर अमल** (शाफ़ई मसलक में फ़र्ज़)\n१२. तकमील के बाद **दुआ पढ़ना**\n\n## मुस्तहब (पसंदीदा) - इज़ाफ़ी बरकतें\n\nये पसंदीदा आमाल हैं जो इज़ाफ़ी सवाब लाते हैं:\n\n१. वुज़ू के दौरान **क़िबला रू** होना\n२. बिला ज़रूरत **बात न** करना\n३. **पानी ज़ाया न** करना - कम से कम इस्तेमाल\n४. जब तक ज़रूरी न हो **मदद से परहेज़**\n५. **साफ़ तौलिए से ख़ुश्क** करना (जायज़)\n६. हर क़दम पर **दुआ** करना\n७. वुज़ू के बाद **दो रकात नमाज़** (सुन्नत)\n\n## वुज़ू क्या तोड़ता है?\n\nफ़र्ज़ हालात जिनमें नया वुज़ू ज़रूरी है:\n• शर्मगाह से कोई ख़ारिज\n• लेटकर गहरी नींद\n• बेहोशी\n• शर्मगाह छूना (बाज़ मसालिक के मुताबिक़)\n\n## अहम बातें:\n\n✓ 4 फ़र्ज़ आमाल सही वुज़ू के लिए ज़रूरी हैं\n✓ सुन्नत आमाल की ज़्यादा से ज़्यादा पैरवी करनी चाहिए\n✓ मुस्तहब आमाल इज़ाफ़ी बरकतें लाते हैं\n✓ नीयत ज़रूरी है (बाज़ इसे फ़र्ज़ समझते हैं)\n\nनबी करीम ﷺ ने फ़रमाया: \"क्या मैं तुम्हें ऐसी चीज़ न बताऊं जिससे अल्लाह गुनाह मिटाता और दर्जात बुलंद करता है?\" उन्होंने कहा: 'जी हां, ऐ अल्लाह के रसूल।' आप ﷺ ने फ़रमाया: 'मुश्किलात के बावजूद अच्छी तरह वुज़ू करना।'\"\n(सहीह मुस्लिम)",
        "ar": "تصنيف أعمال الوضوء\n\n## الفرض (الواجب) - 4 أعمال أساسية\n\nهذه ضرورية تماماً للوضوء الصحيح:\n\n١. **غسل الوجه**\n   • من منبت الشعر إلى الذقن\n   • من الأذن إلى الأذن\n   • يشمل المضمضة والاستنشاق (حسب أغلب العلماء)\n\n٢. **غسل الذراعين**\n   • من أطراف الأصابع إلى المرفقين\n   • المرفقان نفسهما مشمولان\n   • يجب الغسل الكامل\n\n٣. **مسح الرأس**\n   • ربع الرأس على الأقل\n   • بأيدٍ مبللة\n   • لا يمكن استبداله بالغسل\n\n٤. **غسل القدمين**\n   • من الأصابع إلى الكعبين\n   • الكعبان نفسهما مشمولان\n   • يجب غسل ما بين الأصابع\n\n⚠️ تفويت أي عمل فرض يبطل الوضوء بالكامل!\n\n## السنة (الموصى به) - اتباع طريقة النبي ﷺ\n\nهذه تجلب أجراً عظيماً لكنها ليست واجبة:\n\n١. **قول بسم الله** قبل البدء\n٢. **غسل اليدين ثلاث مرات** في البداية\n٣. **استخدام السواك** أو تنظيف الأسنان\n٤. **المضمضة** ثلاث مرات\n٥. **الاستنشاق** ثلاث مرات\n٦. **غسل كل عضو ثلاث مرات** (لا تزيد عن ثلاث)\n٧. **البدء بالجانب الأيمن** قبل الأيسر\n٨. **تخليل اللحية** بالأصابع\n٩. **تخليل الأصابع والأصابع**\n١٠. **الموالاة** بدون فترات طويلة\n١١. **اتباع الترتيب** (فرض في المذهب الشافعي)\n١٢. **قراءة الدعاء** بعد الانتهاء\n\n## المستحب (المفضل) - بركات إضافية\n\nهذه أعمال محبوبة تجلب أجراً إضافياً:\n\n١. **استقبال القبلة** أثناء الوضوء\n٢. **عدم الكلام** دون ضرورة\n٣. **عدم الإسراف في الماء** - استخدام الحد الأدنى\n٤. **تجنب المساعدة** إلا عند الضرورة\n٥. **التجفيف بمنشفة نظيفة** (مباح)\n٦. **الدعاء** في كل خطوة\n٧. **صلاة ركعتين** بعد الوضوء (سنة)\n\n## ما ينقض الوضوء؟\n\nحالات الفرض التي تتطلب وضوءً جديداً:\n• أي خروج من السبيلين\n• النوم العميق مستلقياً\n• فقدان الوعي\n• لمس الفرج (حسب بعض المذاهب)\n\n## ملاحظات مهمة:\n\n✓ الأعمال الأربعة الفرض يجب القيام بها للوضوء الصحيح\n✓ يجب اتباع أعمال السنة قدر الإمكان\n✓ أعمال المستحب تجلب بركات إضافية\n✓ النية ضرورية (يعتبرها البعض فرضاً)\n\nقال النبي ﷺ: \"ألا أدلكم على ما يمحو الله به الخطايا ويرفع به الدرجات؟\" قالوا: 'بلى يا رسول الله.' قال: 'إسباغ الوضوء على المكاره.'\"\n(صحيح مسلم)"
      }
    }
  ]
}